{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51050": {"pageid": 51050, "ns": 0, "title": "Abe Nussbaum", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x12Abe.png\n|name = Abe Nussbaum\n|status = Alive\n|diagnosis = Chronic obstructive pulmonary disease\n|doctors = [[Sam Bennett]]\n|treatment = *In-home care\n*Inhaler\n|marital = Esty Nussbaum †\n|children = [[Lisa Nussbaum]]\n|other family = *Parents-in-law\n*Barry ''(son-in-law)''\n*At least two grandchildren\n|only appearance = [[Heaven Can Wait]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Paul Dooley]]\n}}\n'''Abe Nussbaum''' is a patient whose home healthcare worker was stealing from him.\n\n==History==\nSam came to Abe's home for a house call. His daughter, Lisa, was frustrated because he drank a lot and wasn't doing much in his life. His home healthcare worker, [[Simone Parker]], enabled him instead of helping him. She left in anger and Sam talked to Abe about his health and how to improve it. He said that without his late wife, he had nothing to look forward to. Sam tried to get him to come in for an exam, but Abe declined.\n\nAbe later came into the practice and agreed to be examined. Sam diagnosed COPD and said he wanted to talk about getting him better in-home care than Simone.\n\nWhen Pete found out that Simone had several credit cards in Abe's name, the doctors called in Lisa, who said that since her mother died, her father had become a completely different person. He'd been pushing his daughter away. Lisa was told she needed to get rid of Simone and they'd help her find someone else.\n\nWhen Abe found out that Simone had been fired, he said he knew she'd been stealing and said he didn't care, because he'd hired her because he liked to look at her ass. He admitted it bothered him to need help because he'd always been the one to help. He'd taken extra jobs and sacrificed where needed to give his family whatever they wanted.\n\nSam brought Lisa to Abe's home and she invited him to come live with her and her family, saying she'd love it. She said she wanted to be the help for once. He agreed to move in with her.\n\n==Relationships==\n===Romantic===\nHe was married to Esty Nussbaum until she died.\n\n===Familial===\nHis wife's parents were immigrants.\n\n==Career==\nHe used to run a deli.\n\n{{DEFAULTSORT:Nussbaum, Abe}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Cardio)]]"}]}}}}