{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49852": {"pageid": 49852, "ns": 0, "title": "Adam (Private Practice)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Other Characters Infobox\n|image = PP109Adam.png\n|name = Adam\n|status = Alive\n|job = Personal assistant\n|only appearance = [[In Which Dell Finds His Fight]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 1 (Private Practice)|1]]\n|portrayed by = [[Jocko Sims]]\n}}\n\n'''Adam''' is [[Jack Grossman|Jack Grossman's]] personal assistant.\n\n==History==\nAdam was taken Cooper and Pete's parenting class. He was enthusiastic and offered to try things first. At the end of the first session, he confessed to them that he wasn't actually an expectant father. He was attending the class for his boss, who was expecting a baby. They told him that his boss needed to attend the class for himself.\n\nAdam came back to the next session with a recorder. Cooper talked into the recorder, telling Jack that his wife was about to have a baby and he needed to stop sending Adam to do his dirty work. They then sent Adam away from the class.\n\nAdam returned with Jack, who was angry that they'd called him a jackass and sent Adam away. They told him that the baby was coming whether he was ready or not, so he better get ready. He sent Adam away, assuring him he wasn't fired, before joining the class.\n\n==Career==\nAdam is an assistant. He said he's the second assistant, but hoped doing the class for Jack would help him move up.\n\n{{DISPLAYTITLE:Adam}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S1 Characters]]"}]}}}}