{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52511": {"pageid": 52511, "ns": 0, "title": "Adam Stanfield", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP6x03AdamStanfield.png\n|name = Adam Stanfield\n|status = Alive\n|doctora = [[Violet Turner]]\n|treatment = Talk therapy\n|marital = Wife\n|parents = Mother\n|siblings = Ricky Stanfield\n|only appearance = [[Good Grief]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 6 (Private Practice)|6]]\n|portrayed by = [[Joshua Bitton]]\n}}\n\n'''Adam Stanfield''' is a patient who was seeing Violet for his anger problem.\n\n==History==\nAdam came to Violet because he had trouble managing his anger. He said it felt random what would set him off. He snapped at his wife for talking about drapes. Violet said in order to address the anger, they needed to know the root cause. After being assured that what he said would be protected by doctor-patient confidentiality, Adam told Violet that he'd shot a man eleven years prior.\n\nHe was 18 and he was raising his brother by himself after their mom bailed. It was Super Bowl Sunday. Adam got a gun and planned to use it only to get some money so they could eat. But the man he tried to rob wouldn't give him the money. He lunged at Adam, who panicked and fired. Then he ran away. He didn't know what happened to the man and said he didn't need to know.\n\nIn his next session, Adam said he felt relieved just by telling Violet what had happened. He knew what he had done was wrong, but he felt much better. He felt like he was finally making progress, but Violet had to end the session early because she knew the man had died.\n\nIn another session, Adam started to talk about how he was feeling better about things. He really turned his life around after that day. Violet asked him if he ever thought about that man and how his family felt. Adam started to cry and said he was sorry. Violet, horrified by what she'd done, apologized to Adam and said what she'd done was wrong. She said she needed to refer him to a new therapist. He thought that meant no one could help him, but Violet said he was already living his amends, being a better person.\n\n==Relationships==\n===Romantic===\nHe is married.\n\n===Familial===\nHe helped raise his brother Ricky after her mother bailed. They had two different fathers they never met.\n\n==Notes and Trivia==\n*His brother is five years younger than he is.\n*The man he killed was Kevin Glanville, who was married with two children.\n\n{{DEFAULTSORT:Stanfield, Adam}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S6 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Psych)]]"}]}}}}