{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"86596": {"pageid": 86596, "ns": 0, "title": "Aiden", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S196x04Aiden.png\n|name = Aiden\n|status = Alive \n|parents = *[[Paul (Demons)|Paul]]\n*[[Lisa (Demons)|Lisa]]\n|only appearance = [[Demons]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 6 (Station 19)|6]]\n|portrayed by = *[[Tucker Hellman]]\n*[[Carter Hellman]]\n}}\n\n'''Aiden''' is a child who got caught in a corn maze that was on fire.\n\n==History==\nAiden went to the Halloween carnival with his parents, [[Lisa (Demons)|Lisa]] and [[Paul (Demons)|Paul]]. His father wanted to go in the haunted corn maze, but Aiden was scared. Paul talked him into going, but while they were in the maze, two people fighting with torches ignited the corn. Paul tried to get the two of them out, but they ended up lost and Paul sustained burns to his legs. [[Maya Bishop|Maya]], who had climbed the Ferris wheel to get an aerial view of the maze, spotted them heading away from the exit. She climbed down and then entered the maze to find them. When she found them, she had them cover their mouths, then tried to get them out. With flames surrounding them, she put her jacket on them. Paul tried to get her to take Aiden and get out, but she refused to leave Paul. She used the fire extinguisher she'd brought with her to push back the flames until it ran out. Then she stayed with them while they waited for the other firefighters to find them. Finally, [[Theo Ruiz|Theo]] found them and helped Maya carry Paul out while Aiden walked ahead of them. Outside the maze, Aiden was reunited with his mother while his father was put on a gurney to start getting treatment.\n\n==Relationships==\n===Familial===\nHis father says Aiden is his favorite person.\n\n==Notes and Trivia==\n*He went as a letter carrier for Halloween and his father as a mailbox.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS196x04-21.jpg\nS196x04-24.jpg\nS196x04-25.jpg\n</gallery>\n\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S6 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}