{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50018": {"pageid": 50018, "ns": 0, "title": "Alexander Ball", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP213AlexanderBall.png\n|name = Alexander Ball\n|status = Deceased\n|title = M.D.\n|diagnosis = Stage IV-B pancreatic cancer\n|doctors = *[[Pete Wilder]]\n*[[Sam Bennett]]\n|treatment = *Chemotherapy\n*Acupuncture\n*Euthanasia\n|job = Radiologist\n|only appearance = [[Nothing to Fear]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Joel Grey]]\n}}\n\n'''Alexander Ball''' is a terminally ill patient whom Sam and Pete helped euthanize.\n\n==History==\nAlexander had pancreatic cancer. He came to the practice for acupuncture to treat the pain caused by his treatment. Sam came in to tell him the chemo hadn't helped and there was nothing more they could do. Alexander noted that he had 3-4 very painful weeks left. He asked them to help him die sooner than that.\n\nSam was opposed to the idea, but Pete supported it. Despite this, Sam said they couldn't do it. Pete went to Alexander's house and told him they couldn't help him. He found Alexander eating pudding that he had laced with a mixture of drugs he intended to kill him. Pete stayed with him as they waited for the drugs to work. Sam arrived and saw what was happening and said he was going to call an ambulance. However, Pete talked him out of it and they both stayed with Alexander. Seeing Alexander in pain, Pete left to get a syringe of morphine to end his life quickly.\n\nWhen he returned, Sam tried to stop him from injecting the morphine, but Pete said that his job is to manage people's pain and they needed to help Alexander. Sam took the syringe and gave it to Alexander, then told him he and Pete were going to sit and talk and possibly not pay any attention to what he was doing. Alexander asked if it was enough and Pete confirmed that it was. Alexander then injected the morphine into his arm. They stayed with him as he died. He said he had started to feel heavy and Sam said he had narcan to reverse the effects, but Alexander said he wanted to do it. He was scared because he had no one on this side with him. He said no one would remember he was there. Pete held him and reassured him as he took his final breaths.\n\n==Relationships==\n===Friendships===\nHe said he was the last of his friends left alive.\n\n==Career==\nHe was a doctor and worked in radiology.\n\n{{DEFAULTSORT:Ball, Alexander}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Deceased Characters]]\n[[Category:Doctors]]\n[[Category:Patients]]\n[[Category:Patients (Oncology)]]\n[[Category:Patients (General)]]\n[[Category:Patients (CAM)]]"}]}}}}