{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"78250": {"pageid": 78250, "ns": 0, "title": "Alicia", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S193x11Alicia.png\n|name = Alicia\n|status = Alive\n|parents = Mother\n|marital = [[Emmett Dixon]] ''(ex-fiancé)''\n|only appearance = [[No Days Off]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 3 (Station 19)|3]]\n|portrayed by = [[Remy Nozik]]\n}}\n\n'''Alicia''' is the ex-fiancée of [[Emmett Dixon]].\n\n==History==\nAlicia came to the station one day with [[Michael Dixon]] for a tour and to have lunch with him and Emmett. While there, she also met Travis and Travis was pressured to join them for lunch. She told Travis the story of how she met Emmett in college and then again at a museum after graduation. After lunch, she found Travis in the locker room and asked him if he knew why Emmett hadn't proposed to her after all the time they'd been together and said she wanted to grow old with him. Travis said firefighters don't always get to grow old and said if she married him, she'd be signing up for a lifetime of heartbreak. Later, Alicia asked Travis to join them for dinner sometime. She then saw them off when they were called to a five-alarm fire. ''(\"[[No Days Off]]\")''\n\n==Relationships==\n===Romantic===\nShe is dating [[Emmett Dixon]] and she's unaware that he's gay. She wants to marry him, but worried because after six years together, he still hadn't proposed to her. ''(\"[[No Days Off]]\")''\n\nAfter this conversation, Alicia proposed and they became engaged. ''(\"[[Dream a Little Dream of Me]]\")''\n\nHe later broke off their engagement. ''(\"[[Bad Guy]]\")''\n\n==Notes and Trivia==\n*She was two years behind Emmett in school.\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S3 Characters]]"}]}}}}