{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"83394": {"pageid": 83394, "ns": 0, "title": "Alysha", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S195x02Alysha.png\n|name = Alysha\n|status = Alive\n|parents = [[Ms. Debbie]]\n|only appearance = [[Can't Feel My Face]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Tierra Peters]]\n}}\n\n'''Alysha''' is a woman who had a psychiatric episode while caring for her mother.\n\n==History==\nAlysha was living in an apartment with and caring for her mother, Debbie, who had multiple sclerosis. When Alysha started having psychiatric symptoms, including hearing voices, Debbie was concerned, but hung up every time she called 911 before summoning help as previous police responses when neighbors called 911 had involved them assuming Alysha was using drugs when she wasn't. After they didn't leave the apartment for three days, their landlord, [[Luis]], called for a welfare check. Crisis One responded and Luis let them in the apartment, where Alysha had locked herself and her mother in the bedroom. They asked Debbie to open the door but she was unable to because of her condition. Alysha was tying the bedsheets together to make a sail so they could sail out the window.\n\nDean wanted to break the door in to get into the room, but Emmett cautioned against it as it would escalate the situation. Alysha believed someone was coming to hurt them and wanted to keep her mother safe. Emmett told Vic and Dean to validate her fears and concerns, as he was taught in his training. Vic began speaking to Alysha, following Emmett's advice to validate her. She asked Alysha to tell her about the people who were coming. Alysha said they were trying to hurt her and her mom. Emmett finally had the idea to use Debbie's medication as an excuse for Alysha to open the door. She did so reluctantly, and they forced their way into the room where Dean restrained her. They talked to her and tried to explain what they were doing. When she resisted restraint, her mother talked her into allowing them to sedate her instead. Once she was sedated, they carried her and her mother out. They put them into aid cars and explained that Alysha would be admitted for a 72-hour hold and would get the help she needed to stabilize her and start treatment. He also told her they had services available to help Debbie. Debbie thanked them for treating her and her daughter like human beings.\n\n==Relationships==\n===Familial===\nShe lives with her mother, who has multiple sclerosis, and cares for her.\n\n==Notes and Trivia==\n*She and her mother live in the Chatham Building.\n\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}