{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"83543": {"pageid": 83543, "ns": 0, "title": "Ameen Deng", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S195x03AmeenDeng.png\n|name = Ameen Deng\n|status = Deceased\n|parents = Mother †\n|grandparents = Grandparents †\n|only appearance = [[Too Darn Hot]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Bamm Ericsen]]\n}}\n\n'''Ameen Deng''' was an old friend of [[Joey Phillips]] with congestive heart failure.\n\n==History==\nAmeen was born in Sudan, but after he was orphaned at age nine during the civil war, he walked to Kenya, then grew up in refugee camps in Kenya and Ethiopia. At age seventeen, he was selected for a resettlement program and came to Seattle. After coming to the US, without any support to find a job or learn to speak English, Ameen ended up living on the streets. At some point, he met Joey and they became friends. During their friendship, Ameen told Joey that he didn't want to be resuscitated. He said he believed in God and when the time came, he didn't want to be hooked up to machines.\n\nAmeen continued living on the streets as his heart worsened. One day, when he started gasping for breath, his neighbor, [[Mel]] called for help. Ben and Jack arrived with Joey, who was doing a ride-along. They gave him nitroglycerin and started CPR after seeing signs of congestive heart failure. While Ben did compressions, Joey told him Ameen was DNR, but since he didn't have any legal paperwork or medical jewelry to confirm it, Ben was forced to continue. After twelve minutes with no return of spontaneous circulation, Ben had Jack take over compressions, then he called Grey Sloan to have a physician pronounce death remotely.\n\n==Relationships==\n===Familial===\nHe was orphaned at age nine.\n\n===Friendships===\nHe and [[Joey Phillips]] were friends after meeting in an encampment.\n\n==Notes and Trivia==\n*According to Joey, he taught himself English and a variety of other skills.\n*He was pronounced dead at 2:37 PM.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS195x03-9.jpg\n</gallery>\n\n{{DEFAULTSORT:Deng, Ameen}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:Deceased Characters]]\n[[Category:S19 Rescuees]]"}]}}}}