{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50202": {"pageid": 50202, "ns": 0, "title": "Amelia Sawyer", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP305AmeliaSawyer.png\n|name = Amelia Sawyer\n|status = Alive\n|diagnosis = *Pregnancy\n*High blood pressure\n|doctors = *[[Naomi Bennett]]\n*[[Addison Forbes Montgomery]]\n|treatment = *Prenatal care\n*Supplemental oxygen\n|marital = Vic Sawyer † ''(husband)''\n|first appearance = [[Yours, Mine & Ours]]\n|last appearance = [[Strange Bedfellows]]\n|count = 2\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]] and [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Robin Weigert]]\n}}\n\n'''Amelia Sawyer''' is a pregnant woman whose embryo was mistakenly implanted in [[Zoe Salter]].\n\n==History==\n===Embryo Switch===\nAmelia came to the practice for prenatal care and blood tests. She'd gotten pregnant with her husband's frozen sperm after his death. Amelia's CVS showed a trait that neither she nor her husband carried in the fetus. Naomi went over the records and found out that she and [[Zoe Salter]] had been implanted the same day and Zoe was a carrier for the trait, meaning Amelia was carrying Zoe's fetus and Zoe was carrying Amelia's, the last embryo from her dead husband's sperm. Naomi shared the news with Amelia and the Salters separately, but they figured out what had happened as they left. They'd met each other in the waiting room and bonded over their similar stories. Amelia wanted to continue the pregnancy and have Zoe do the same, saying she'd respect the Salters' wishes. However, Zoe said she and her husband wanted to terminate and start over with the other embryos they had stored. When Amelia heard that, she said if they terminated, she'd have the baby she was carrying and keep it.\n\nNaomi had Amelia talk to Violet about the pregnancy, reminding her that she could have the baby she was carrying, give it up, and still become a mother another way. She said the pregnancy was her happiness and she couldn't fathom letting it go.\n\nZoe later returned to the practice to talk to Amelia. Amelia told Zoe she wanted the baby she was carrying, but understood she couldn't make Zoe carry him. She believed that maybe it happened because the baby she was carrying, Zoe and Martin's, was her new chance. Naomi said sometimes, you have to let go of one dream so you can move forward with another one. Zoe said she couldn't let Amelia keep the baby, apologized, and left.\n\nZoe returned to the practice and suggested that she could continue to carry Amelia's baby while Amelia carried hers and they could switch them after they were born. ''(\"[[Yours, Mine & Ours]]\")''\n\n===Complication===\nZoe and Amelia began seeing another OB for their pre-natal care. However, when he found something that might be wrong with the baby Zoe was carrying, he said they needed a surgical consult and recommended Addison. Addison did an ultrasound and diagnosed a fetal teratoma that was taking over the baby's blood supply. Addison recommended surgery, but advised Zoe that she'd have to perforate the uterus, which can sometimes cause problems for future pregnancies. Martin had left her because he didn't understand the bond between Zoe and Amelia and the decision they'd made. Zoe said she couldn't do it, so Addison recommended termination. Zoe decided she wanted to wait and left the fetus die in utero naturally, to get Amelia further along in her pregnancy. She didn't want Zoe to think she'd just given up. Addison wanted her to tell Amelia, but Zoe said that she couldn't.\n\nAmelia went to see Naomi, saying she thought something was wrong with the baby and Addison and Zoe were lying to her about it.\n\nThey called Zoe in and Naomi told her about what Amelia had said to her. She reminded her about the decision she'd made. Zoe said that she felt like both babies were both of theirs. If she told Amelia what she was going to do, it would be bad for Amelia's already-high blood pressure. She was already at risk for eclampsia and they could lose both babies. Addison again recommended the surgery. Naomi told her she either needed to let Addison operate or let her end the pregnancy because that was the safest choice if she wanted to get pregnant again. Zoe said she'd do it, but they needed to tell Amelia why the surgery couldn't be done because she couldn't do it.\n\nThey called Amelia in and told her about the teratoma. Amelia said she understood. She said she was worried at first that Zoe wouldn't try to make it work. When she heard they wanted to terminate, she told Zoe she wanted to be there for her. Her blood pressure was high, so they gave her oxygen, which helped. After seeing what Amelia was going through for the baby she was carrying, Zoe decided to take the risk and have the surgery.\n\nAddison operated. Zoe was fine afterward, but Addison was unable to save the baby. Amelia said it was okay because the baby she was carrying was still okay and they were a family. When Marty showed up and made up with Zoe, Amelia left. Naomi told her she couldn't leave and keep the baby, but Amelia said he was all she had left.\n\nMartin was enraged about Amelia leaving, but Zoe said she believed that Amelia was a good person and would come back. She explained to Martin her view of it, from the time she'd spent with Amelia while Martin was gone. ''(\"[[Strange Bedfellows]]\")''\n\n==Relationships==\n===Romantic===\nShe was married until her husband, Vic, died.\n\n===Friendships===\nWhile they were carrying each other's babies, she became close friends with Zoe, especially after Zoe's husband left. When Amelia left with Zoe and Martin's baby, Zoe believed she'd come back because of their friendship and Amelia being a good person.\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPP222AmeliaSawyer.png|[[Yours, Mine & Ours]]\nPP305AmeliaSawyer.png|[[Strange Bedfellows]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP2x22-21.jpg\n</gallery>\n\n==Appearances==\n{{Amelia Sawyer Appearances}}\n\n{{DEFAULTSORT:Sawyer, Amelia}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:PP S3 Characters]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (Genetics)]]\n[[Category:Patients (REI)]]\n[[Category:Patients (Psych)]]"}]}}}}