{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49892": {"pageid": 49892, "ns": 0, "title": "Amina Qalzai", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP2x04-12.jpg\n|name = Amina Qalzai\n|status = Alive\n|marital = [[Idrees Qalzai]] ''(husband)''\n|children = [[Sharbat Qalzai]]\n|only appearance = [[Past Tense]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Sarah Ripard]]\n}}\n\n'''Amina Qalzai''' is the mother of [[Sharbat Qalzai]].\n\n==History==\nAmina came into the practice with her daughter, Sharbat. Sharbat had told her mother that she'd been raped and her mother found out that Addison could do a hymenoplasty in order to restore Sharbat's hymen before her impending marriage to a man back in Afghanistan who could take care of her family.\n\nSharbat privately admitted to Addison that she hadn't been raped and she just had an American boyfriend. Addison pressured her to tell her mother the truth. She did so, though Amina said she already knew. Despite this, Sharbat still wanted to have the surgery, saying her parents had come to the US for her, but she saw that it was making them miserable. Her father was driving a cab when he used to teach university and her mother was lonely. This was their way back.\n\n==Relationships==\n===Romantic===\nShe is married to [[Idrees Qalzai]].\n\n===Familial===\nShe and her husband moved their family to the US for their daughter Sharbat. Sharbat later decided to have surgery and marry a man she'd never met to allow her parents to move back to Afghanistan.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP2x04-8.jpg\nPP2x04-12.jpg\nPP2x04-19.jpg\nPP2x04-34.jpg\n</gallery>\n\n{{DEFAULTSORT:Qalzai, Amina}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]"}]}}}}