{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"84169": {"pageid": 84169, "ns": 0, "title": "Amy", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S195x08Amy.png\n|name = Amy\n|status = Alive\n|marital = [[Greg (Season 5)|Greg]] ''(husband)''\n|children = Son\n|other family = Cousin\n|only appearance = [[All I Want for Christmas is You]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Andrea Bowen]]\n}}\n\n'''Amy''' is a woman who was being abused by her husband.\n\n==History==\nAmy was cooking eggs for her son for dinner when her husband, Greg, got angry and attacked her, throwing the pan across the kitchen floor. Desperate to buy herself some time to let him calm down, Amy called the police pretending to be a concerned neighbor. Vic, Jack, and Emmett responded and found Amy breathing heavily on her kitchen floor. They saw the signs of domestic violence and determined they needed to call police as it was beyond what they could handle on their own. In the meantime, Vic tried to get Amy out of the house, but she refused to leave, saying he had threatened her with taking away their son if she left him. While Jack went to call police, Vic impulsively picked up the child and told Amy it was time to go. Greg immediately called the police and reported it as an attempted kidnapping. When the police arrived, they found multiple bruises on Amy and arrested Greg. After he was gone, Vic came back in the house and apologized for jeopardizing Amy and her son's safety and then helped her pack to leave for her cousin's in Portland. She also encouraged Amy to call the police and tell them she wanted to press charges against him.\n\n==Relationships==\n===Romantic===\nShe is separated from [[Greg (Season 5)|Greg]], who continuously abused her until she left him.\n\n===Familial===\nShe and Greg have a son, whom he used to try to keep her from leaving. She also has a cousin in Portland.\n\n==Notes and Trivia==\n*She and Greg lived at 1163 Forrester Lane until she left him.\n\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}