{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50114": {"pageid": 50114, "ns": 0, "title": "Andrew (Ex-Life)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP216Andrew.png\n|name = Andrew\n|status = Alive\n|marital = [[Rachel]] ''(wife)''\n|children = Cynthia\n|only appearance = [[Ex-Life]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Jeffrey Nicholas Brown]]\n}}\n\n'''Andrew''' is the husband of [[Rachel]].\n\n==History==\nAndrew's wife, Rachel, brought in their young daughter, Cynthia, after Cynthia became submerged in a bath when Rachel answered the phone. Cooper examined her and said that she was fine, but noticed that Rachel was exhausted. He held Cynthia and told Rachel to rest for a minute. He asked Violet to come talk to her, but when they got back, Rachel was gone. They searched the practice and found her in a maternity suite. She talked about Cynthia's birth and said her husband named her, but she loves her. Cooper kept Cynthia and Violet talked to Rachel.\n\nAfter their talk, Violet suggested medication, but Rachel declined because she was breastfeeding, so Violet suggested acupuncture as an alternative. Pete talked about what he was going to do. Rachel talked rapidly to Pete about how Cynthia wasn't sleeping, which led to Pete going to Violet, telling her Rachel was manic. She already knew that. She believed Rachel had postpartum psychosis, so she talked to Rachel's husband and he agreed to pre-admit her to the hospital and come get the baby. While they were talking, Rachel came out of Pete's office with the acupuncture needles still in her face, believing that Cynthia was crying somewhere and trying to get to her. She found Cynthia with Cooper, getting ready to eat. Rachel panicked when they wouldn't let her have Cynthia. Rachel then confessed that she had held Cynthia under the water. She knew her husband wouldn't be home until dinner and no one would know and she could finally get some sleep. Violet sedated Rachel with benzos and started her on an antipsychotic.\n\nAndrew came in and was shocked at what Rachel had done. He'd wondered what he'd missed or what he could have done. Pete and Violet reassured him that it wasn't his fault and there wasn't anything he could have done. Rachel woke up after a few hours of sleep and wanted to see Cynthia, leading Andrew to wonder what he should do.\n\nThe doctors discussed it. Violet believed Rachel was still a danger to Cynthia, but Cooper and Pete insisted that it'd be okay because she'd be monitored the whole time.\n\nThey brought Cynthia in to see Rachel. They handed her off to Andrew and told him to stay right there with her. Rachel held Cynthia and said she was sorry for what she had done. After their visit, Andrew and Rachel slept peacefully in Rachel's hospital bed while Cynthia rested in a basinet next to them.\n\n==Relationships==\n===Romantic===\nHe is married to [[Rachel]].\n\n===Familial===\nHis daughter, Cynthia, nicknamed Cindy, almost died when his wife, who had postpartum psychosis, held her under water.\n\n{{DISPLAYTITLE:Andrew}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]"}]}}}}