{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"12897": {"pageid": 12897, "ns": 0, "title": "Angela Reilly", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PP6x07-6.jpg\n|name = Angela Reilly\n|alias = Ang\n|status = Alive\n|siblings = [[Henry Montgomery]] ''(half-brother)''\n|parents = *[[Jake Reilly]]\n*[[Lily Reilly]] †\n|grandparents = *Grandfather\n*Grandmother †\n|other family = *Three Aunts\n*[[Addison Forbes Montgomery]] ''(stepmother)''\n*[[Bizzy Forbes]] † ''(step-grandmother)''\n*[[\"The Captain\" Montgomery]] ''(step-grandfather)''\n*[[Archer Montgomery]] ''(step-uncle)''\n|first appearance = [[The Letting Go]]\n|last appearance = [[In Which We Say Goodbye]]\n|count = 3\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Private Practice)|5]] and [[Season 6 (Private Practice)|6]]\n|portrayed by = [[Emily Rios]]\n}}\n'''Angela Reilly''' is the daughter of [[Jake Reilly]]. She is known to be in love with her professor from university.\n\n==History==\n===Birthday Dinner===\nOn Angela's birthday, Jake came to have dinner with her. She confessed to him that she'd had sex for the first time, but he didn't want to talk about it. She wanted to tell him because she was so happy. It was nice feeling like she did.\n\nAt dinner, Angela interrogated Jake about his own love life. She figured out he liked someone and he told her about Addison. Angela said her mom would have wanted him to be happy.\n\nWhen Jake talked to Angela later, she said that she wanted to meet Addison at some point, though he said nothing was going to happen with them.\n\nAngela came to visit Jake at the office, where he introduced her to Addison. ''(\"[[The Letting Go]]\")''\n\n===Confrontation Between Jake and Eli===\nAngela started dating Eli, her human sexuality teacher. She introduced him to Jake when they met up at the movie theatre. Jake was surprised at the age difference.\n\nAngela and Jake later had lunch together and Jake expressed his disapproval at their relationship. She warned him not to make her choose because he wouldn't like her choice.\n\nAddison encouraged Jake to invite Angela and Eli over for dinner. After Jake threatened Eli during that dinner, Angela confronted Jake, saying she hoped Eli misunderstood and Jake didn't really threaten his life. She then left in anger. ''(\"[[The World According to Jake]]\")''\n\n===Jake and Addison's Wedding===\nAngela attended her father's wedding to Addison and served as his best man. When they danced at the reception, they talked about their argument and cleared the air.\n\n===Going to Rome===\nThree months later, Angela came to Jake and told him she was taking a semester off from school to go to Rome with Eli while he taught there. Later, before she left, she went to Jake, who apologized for his behavior and said that he only wanted her to be happy, even with Eli. He also said that no matter what, she'd be his girl. ''(\"[[In Which We Say Goodbye]]\")''\n\n==Relationships==\n===Romantic===\n====Ethan====\nAngela dated her classmate Ethan for a period of time. Angela had sex for the first time with him. ''(\"[[The Letting Go]]\")'' Their relationship ended after a short period of time. Angela once said that Ethan was a stupid frat boy, and she was way too good for him. ''(\"[[The World According to Jake]]\")''\n\n====[[Eli Wilson]]====\nEli is Angela's professor at her college. They first met in his human sexuality class.\n\nAngela's father, Jake, disapproves of Eli because he is 30 years older than her. Despite the age difference, she says that she loves Eli. ''(\"[[The World According to Jake]]\")''\n\nShe later decided to go to Rome with Eli for a semester while he taught there. ''(\"[[In Which We Say Goodbye]]\")''\n\n===Familial===\n====Jake Reilly====\nJake is Angela's father. He adopted her after falling in love with her mother. They remain close long after her mother's death. She loves him deeply, despite the conflicts they sometimes have.\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPP5x17AngelaReilly.png|[[The Letting Go]]\nPP6x07AngelaReilly.png|[[The World According to Jake]]\nPP6x13AngelaReilly.png|[[In Which We Say Goodbye]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP6x07-2.jpg\nPP6x07-3.jpg\nPP6x07-5.jpg\nPP6x07-6.jpg\nPP6x07-7.jpg\nPP6x07-8.jpg\nPP6x07-9.jpg\nPP6x07-10.jpg\n</gallery>\n\n==Appearances==\n{{Angela Reilly Appearances}}\n\n{{DEFAULTSORT:Reilly, Angela}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]\n[[Category:PP S6 Characters]]"}]}}}}