{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50963": {"pageid": 50963, "ns": 0, "title": "Angela Deever", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x06AngelaDeever.png\n|name = Angela Deever\n|status = Alive\n|doctors = [[Charlotte King]]\n|treatment = Bladder reconstruction\n|marital = [[Jacob Deever]] ''(husband, separated)''\n|only appearance = [[All in the Family]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Angela Rawna]]\n}}\n\n'''Angela Deever''' is a woman who had a bladder reconstruction so she could have a baby and found out her husband was gay.\n\n==History==\nAngela had had a bladder reconstruction. Charlotte told her she'd healed and could start trying to get pregnant.\n\nWhen Pete and Charlotte learned that her husband was having sex with a male prostitute, they implored him to tell her the truth. He resisted at first, but later relented.\n\nCharlotte called in Angela, Jacob, and Evan to tell Angela about the situation and she said that she knew he was gay and she still loved him and accepted him. However, when she learned that he'd exposed her to HIV, she became enraged. She slapped him and left.\n\n==Relationships==\n===Romantic===\nShe was married to [[Jacob Deever]] for almost 20 years. She loved him, despite knowing he was gay. However, she became enraged when she learned he'd exposed her to HIV.\n\n{{DEFAULTSORT:Deever, Angela}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Urology)]]"}]}}}}