{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50521": {"pageid": 50521, "ns": 0, "title": "Angie McConnell", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP319AngieMcConnell.png\n|name = Angie McConnell\n|status = Alive\n|marital = [[Simon McConnell]] ''(husband)''\n|children = Three children\n|first appearance = [[Triangles]]\n|last appearance = [[Eyes Wide Open]]\n|count = 3\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Judith Hoag]]\n}}\n'''Angie McConnell''' is the mother of the babies carried by [[Kayla Lindy]].\n\n==History==\nKayla, acting as a surrogate for Angie and Simon McConnell, was pregnant with triplets. At 20 weeks, she was on bed rest because of a blood clot. Even with heparin, she was forming more clots. Addison recommended reducing the pregnancy to one, but Angie and Simon opposed the idea.\n\nThe McConnells called in [[Vanessa Hoyt]] as a consult and she believed that it was safe for Kayla to continue the pregnancy as triplets.\n\nSam agreed to do the surgery on Kayla. It was successful.\n\nKayla was stable for a while after the surgery, but then she started forming clots above the umbrella. Addison rushed her into surgery to reduce the pregnancy load. Before she could do that, Kayla started throwing more clots and they needed to close and move her to ICU. Her heart stopped when a clot moved to her lung. There was no evidence of higher brain function and she was put on life support. The McConnells asked about the baby that was left and were told that the reduction hadn't been performed. As long as Kayla was on the ventilator, the babies would continue to grow. ''(\"[[Triangles]]\")''\n\nAs Kayla was in a coma, Eddie decided he wanted to turn the machines off, believing Kayla wouldn't want to live like that. Vanessa, opposing the decision, went to Simon and Angie and told them about it. They believed Kayla would want them to continue life support until the babies were born. Eddie still insisted he just wanted Kayla to have peace. The McConnells got a lawyer to prevent him from turning off the machines. Only essential medical personnel were allowed in Kayla's room while they waited for a judge to rule on what would happen.\n\nEddie waited outside Kayla's room in the hallway. He called some lawyers, but couldn't afford any of them. [[Charlotte King]] gave him the name of a lawyer at a non-profit aid group and encouraged him to call.\n\nThe judge came in and ruled that Kayla's life would have to continue until viability had been reached. She also ordered that her room continued to be closed to all but essential medical personnel.\n\nCharlotte later saw Eddie waiting outside Kayla's room, so she left the door unlocked and told him the nurse was on break. He went into her room and locked the door. He then disconnected her ventilator. They broke a window to get into the room, but before they could reconnect the ventilator, they saw that Kayla was breathing on her own. ''(\"[[Pulling the Plug]]\")''\n\nAfter six weeks in a coma, Eddie called in [[Geraldine Ginsberg]] to try to wake Kayla up. After she ran tests and examined Kayla, Ginsberg believed nothing could be done. However, [[Amelia Shepherd]], who was on Ginsberg's team, had an idea. Ginsberg believed it wouldn't work, so she refused to do it. When Ginsberg fired Amelia, she stayed to help Kayla. After speaking with Eddie, Amelia agreed to do the surgery.\n\nAfter hearing about what Amelia had planned, the McConnells asked her not to operate, to give them a little more time so the babies could mature more. Despite this, she operated. During the surgery, the three babies had to be delivered, but Amelia was then able to finish the procedure.\n\nAfter surgery, Kayla's reflexes started to re-emerge and she woke up. ''(\"[[Eyes Wide Open]]\")''\n\n==Relationships==\n===Romantic===\nShe is married to [[Simon McConnell]].\n\n===Familial===\nShe and her husband have three babies, carried by [[Kayla Lindy]].\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPP317AngieMcConnell.png|[[Triangles]]\nPP318AngieMcConnell.png|[[Pulling the Plug]]\nPP319AngieMcConnell.png|[[Eyes Wide Open]]\n</gallery>\n\n==Appearances==\n{{Angie McConnell Appearances}}\n\n{{DEFAULTSORT:McConnell, Angie}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]"}]}}}}