{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49794": {"pageid": 49794, "ns": 0, "title": "Angie Paget", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP106AngiePaget.png\n|name = Angie Paget\n|status = Alive\n|diagnosis = Huntington's disease\n|doctors = *[[Naomi Bennett]]\n*[[Addison Forbes Montgomery]]\n*[[Violet Turner]]\n|treatment = *Genetic testing\n*Assisted reproduction\n|marital = [[Ray Paget]] ''(husband)''\n|parents = Mother †\n|grandparents = Grandmother †\n|only appearance = [[In Which Charlotte Goes Down the Rabbit Hole]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 1 (Private Practice)|1]]\n|portrayed by = [[Kimberly Elise]]\n}}\n'''Angie Paget''' and her husband, Ray, came to the practice for help conceiving.\n\n==History==\nAngie and her husband, Ray, came into the practice because they were unable to conceive. Angie had had tests done, and Naomi determined that she was ovulating, so they started running tests on Ray. While Ray was getting his tests run, Angie came to Naomi and Addison and asked them to lie to Ray and say that he was the reason they couldn't get pregnant. Angie confessed that she'd been lying to him. For a while, she was on the pill, but then she got a cervical cap, which is why they hadn't conceived. She said she had her reasons and when pressed, she said she just didn't want kids, but Ray loved kids. Therefore, she couldn't just tell him she didn't want them. Addison said the doctors couldn't lie to Ray about his test results. Angie left the practice with Ray when he returned.\n\nAngie returned to the practice the next day. She said she'd read about Addison's genetics specialty and that she needed to know if she had Huntington's, which her mother and grandmother had. She wanted to grow old with Ray and also wished to know if there was a chance she might not have it.\n\nAngie had the test and it came back positive, so they brought in Violet in to talk to her. However, Angie left and implied that she'd be leaving Ray, which she believed was for his own benefit.\n\nRay came into the practice, shocked and upset about Angie leaving him. He said she said that her appointment had been a wake-up call and wondered what they'd said to her. They repeatedly called Angie and she eventually came to the practice. She didn't want Ray to have to watch her die and it was better if he just hated her for leaving him. Addison said that she had a disease and was going to die, but she's still alive and she can have all the things she wants. She should live and tell her husband what their future held.\n\nAngie and Ray returned to the practice and said they wanted to share what time they have together with a child and wanted help to conceive as soon as possible. Ray accepted that his wife was going to die and they both accepted the chance that the baby might also have Huntington's.\n\n==Relationships==\n===Romantic===\nShe is married to [[Ray Paget]].\n\n===Familial===\nHer mother and grandmother both had Huntington's.\n\n{{DEFAULTSORT:Paget, Angie}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S1 Characters]]\n[[Category:Patients]]\n[[Category:Patients (REI)]]\n[[Category:Patients (Genetics)]]\n[[Category:Patients (Psych)]]"}]}}}}