{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"81918": {"pageid": 81918, "ns": 0, "title": "Anthony Hughes", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = S194x11-10.jpg\n|name = Anthony Hughes\n|status = Alive\n|marital = [[Lenya Hughes]] ''(wife)''\n|children = [[Victoria Hughes]]\n|parents = [[Marion Hughes]] †\n|job = Owner/Chef\n|workplace = Kaminski's\n|first appearance = [[Here It Comes Again]]\n|last appearance = [[Phoenix from the Flame]]\n|count = 4\n|seasons = '''[[Station 19|S19]]:''' [[Season 4 (Station 19)|4]] and [[Season 5 (Station 19)|5]]\n|portrayed by = [[Rick Worthy]]\n}}\n\n'''Anthony Hughes''' is the father of [[Victoria Hughes]].\n\n==History==\nAnthony was working at his restaurant when his daughter, Vic, came to see him to get pierogis for herself and her team. He spoke amiably with Jack about making pierogis, which he did using ingredients suggested by their various kitchen help throughout the years. ''(\"[[Here It Comes Again]]\")''\n\nAnthony was working at her restaurant with his wife, Lenya, when it was set on fire. Firefighters came to the scene soon afterward and [[Theo Ruiz]] escorted Lenya and Anthony out with help from their daughter, Vic. Theo carried a crock pot out with them, as Lenya refused to leave without it. Once they were out, they were given oxygen, but were focused on how much they would lose and when they'd be able to get back inside.\n\nAfter the fire was out, Lenya and Anthony insisted on Vic taking them inside to start cleaning up and figuring out what they could save. She tried to tell them it wasn't safe, but they knew she could keep them safe. Once they were inside, Vic gave her helmet to her mother, but her mother put it down instead of putting it on as she started to pick up tables. While they cleaned, Vic confronted her parents about them not checking in on her amidst the protests and especially the death of Breonna Taylor.\n\nLater, Vic found an office in the restaurant which had two bulletin boards full of pictures and articles about her. Her mother told her they brought as much of Vic as they could to the restaurant as she rarely came by anymore. Lenya also shared the experience of raising a Black daughter and how much that scared her. She told Vic she wasn't around much when Vic was growing up in service of trying to give her a better life. Lenya then started breaking dishes not broken in the fire. She said it was Greek tradition to start the grief process. Vic, Anthony, Theo, and Travis all joined in. Once the dishes were broken, they started to clean up. ''(\"[[Say Her Name]]\")''\n\n===Maya and Carina's Wedding===\nSeveral weeks later, when the restaurant was restore to its former glory, Vic set it up as the location for Maya and Carina's wedding, for which Lenya and Anthony were grateful. Lenya and Anthony attended the wedding. ''(\"[[Forever and Ever, Amen]]\")''\n\n==Relationships==\n===Romantic===\nHe is married to [[Lenya Hughes]].\n\n===Familial===\nHe worked constantly for the entirety of his daughter's life, trying to build something for her. \n\n==Career==\nHe and his wife own and run Kaminski's, a Polish restaurant.\n\n==Notes and Trivia==\n*[[Theo Ruiz]] is a fan of his restaurant.\n*He appears in the background with no lines in [[Phoenix from the Flame]].\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nS194x11AnthonyHughes.png|[[Here It Comes Again]]\nS194x15AnthonyHughes.png|[[Say Her Name]]\nS194x16AnthonyHughes.png|[[Forever and Ever, Amen]]\nS195x01AnthonyHughes.png|[[Phoenix from the Flame]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS194x15-21.jpg\nS194x15-22.jpg\nS194x15-24.jpg\nS194x15-26.jpg\nS194x16-11.jpg\n</gallery>\n\n==Appearances==\n{{Anthony Hughes Appearances}}\n\n{{DEFAULTSORT:Hughes, Anthony}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}