{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49978": {"pageid": 49978, "ns": 0, "title": "Arlene Perkins", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP211Arlene.png\n|name = Arlene Perkins\n|status = Alive\n|marital = Husband\n|children = *[[Jeffrey Perkins]]\n*[[Michael Perkins]] †\n*[[Will Perkins]]\n|only appearance = [[Contamination]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Jillian Armenante]]\n}}\n'''Arlene Perkins''' is the mother of [[Michael Perkins]].\n\n==History==\nArlene moved her family to Switzerland after her son, Jeffrey, was diagnosed with autism. Two years later, they returned to the US. They came to see their old pediatrician, Cooper, when Michael caught what Arlene thought was a cold on the plane. However, when Cooper examined him, he saw that Michael had measles. They locked down the practice because of it. Cooper also tried to get Arlene to agree to vaccinate her youngest child, Will, in order to prevent him from getting it as well. After the lockdown was lifted, Arlene took her kids home, but later took Michael to the hospital when his fever went up and she couldn't get it down. He was admitted to the pediatric ICU in an isolation room with trouble breathing. Cooper tried again to convince Arlene to vaccinate Will. She said that she couldn't lose a second child to autism and believed that would happen to Will if he got the vaccination.\n\nMichael's condition continued to decline and he had to be intubated. Cooper then went out to the waiting area and vaccinated Will over Arlene's objections. Arlene yelled at Cooper, but then an alarm went off in Michael's room. He stopped breathing and they attempted resuscitation, but were unable to save him and he was pronounced dead.\n\n==Relationships==\n===Romantic===\nShe is married. Her husband stayed in Switzerland while his family returned to LA.\n\n===Familial===\nShe has three children: Jeffrey, Michael, and Will. Jeffrey is autistic and because of that, Arlene moved the family to Switzerland for experimental therapies.\n\n{{DEFAULTSORT:Perkins, Arlene}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]"}]}}}}