{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"83875": {"pageid": 83875, "ns": 0, "title": "Ashley Wright", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = 18x06AshleyWright.png\n|name = Ashley Wright\n|status = Alive\n|diagnosis = *Pregnancy\n*Appendicitis\n|doctors = *[[Richard Webber]]\n*[[Levi Schmitt]]\n*[[Jo Wilson]]\n|treatment = *C-section delivery\n*Appendectomy\n|marital = [[Mr. Wright]] ''(husband)''\n|children = Five children\n|other family = Parents-in-law\n|only appearance = [[Everyday Is a Holiday (With You)]]\n|seasons = '''[[Grey's Anatomy|GA]]:''' [[Season 18 (Grey's Anatomy)|18]]\n|portrayed by = [[Chiquita Fuller]]\n}}\n\n'''Ashley Wright''' is a patient who came to the ER with serious abdominal pain while pregnant.\n\n==History==\nOn Thanksgiving, Ashley left her family dinner and went to the ER because she was 31 weeks pregnant with her fifth child and had severe abdominal pain and nausea. After exiting her car, she vomited on the ground, so Richard helped her get inside. In the ER, Jo said her baby looked fine and the fetal heart rate was strong and stable. She also had free fluid in her right upper quadrant, so they did an MRI. As they were finishing the MRI, Ashley's pain suddenly got a lot worse. The MRI showed appendicitis, but her appendix had been pushed upward by her uterus. She would need surgery because it was infected. As she and her husband were told about the surgery, which carried a risk of emergency c-section and hysterectomy if they couldn't stop the bleeding, she said she couldn't have any more kids, so she asked Jo to tie her tubes if she didn't have to remove her uterus. In surgery, the fetus started having late decels, so Jo was forced to deliver and then, when the bleeding couldn't be stopped, she did an emergency hysterectomy. After the surgery, Ashley was stable and her son was also stable in the NICU.\n\n==Relationships==\n===Romantic===\nShe is married to [[Mr. Wright]].\n\n===Familial===\nShe had twelve people, including her husband and four children, at her house for Thanksgiving. Her in-laws where in town on open-ended tickets. On Thanksgiving, her fifth child was born by emergency c-section.\n\n==Notes and Trivia==\n*She's from the South.\n*She was 40 at the time of her fifth child's birth.\n\n{{DEFAULTSORT:Wright, Ashley}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S18 Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (General)]]\n[[Category:Patients (OB/GYN)]]"}]}}}}