{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49805": {"pageid": 49805, "ns": 0, "title": "Ashley Minahan", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP107AshleyMinahan.png\n|name = Ashley Minahan\n|status = Alive\n|diagnosis = Pregnancy\n|doctors = *[[Addison Forbes Montgomery]]\n*[[Naomi Bennett]]\n*[[Violet Turner]]\n*[[Dell Parker]]\n|treatment = Vaginal delivery\n|marital = [[Patrick Minahan]] ''(husband)''\n|children = *[[Todd Minahan]]\n*[[Danny Minahan]]\n*[[Malcolm Minahan]]\n*Son\n|only appearance = [[In Which Sam Gets Taken for a Ride]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 1 (Private Practice)|1]]\n|portrayed by = [[Rusty Schwimmer]]\n}}\n\n'''Ashley Minahan''' is a woman who was pregnant with her fourth child.\n\n==History==\nAshley was pregnant with her fourth child and ultrasounds had indicated that it was a girl after three boys. She was very excited to be finally having a girl. She came to the practice for a checkup and was found to be in labor. She labored at the practice for a while and then told Dell the baby was coming. He called Naomi to deliver the baby, but by the time she arrived, the baby was born. Naomi had to tell Ashley that the baby was a boy. She was upset and demanded a girl. She refused to look at her new son. They called in Violet to talk to her, to try to get her to bond with her son. Ashley said she couldn't raise four boys on her own. Her husband didn't really help with the parenting. He preferred just to be their friend.\n\nThe doctors called Patrick in and confronted Patrick along with Ashley. They said he needed to grow up and become a parent. Naomi then also said that Ashley needed to grow up. She needed to take the boy she got and not get upset. Or she could meet one of the families Naomi treated who can't even have a baby. When the Minahans' other sons were brought in, Patrick told them to give their mom a break, stepping up.\n\n==Relationships==\n===Romantic===\nShe is married to [[Patrick Minahan]].\n\n===Familial===\nShe and her husband have four sons. She was looking forward to having a daughter with their fourth baby and was upset when it turned about to be a boy.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP1x07-3.jpg\nPP1x07-5.jpg\n</gallery>\n\n{{DEFAULTSORT:Minahan, Ashley}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S1 Characters]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (Psych)]]"}]}}}}