{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"68830": {"pageid": 68830, "ns": 0, "title": "Audrey (Hot Box)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S191x09Audrey.png\n|name = Audrey\n|status = Alive\n|marital = [[Oliver (Hot Box)|Oliver]] ''(husband, separated)''\n|job =\n|workplace = \n|only appearance = [[Hot Box]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 1 (Station 19)|1]]\n|portrayed by = [[Sarayu Rao|Sarayu Blue]]\n}}\n'''Audrey''' is a woman whose personalized security system trapped herself and rescuers in her garage.\n\n==History==\nAudrey was burning her old wedding photos and unity hands when her estranged husband found her. They started arguing and walked away from the fire, which sparked and ignited the nearby carpet. Oliver called for help as the fire grew out of control. Since it was contained in the house and there was no one else inside, they decided to attack the fire from within. They asked Audrey for access to the innermost part of the house, but because she'd burned her finger, her fingerprint wasn't recognized by the keypad. She gave them the code to disable it from inside, but Dean entered it incorrectly more than twice, which locked down the garage, trapping Audrey, [[Karen Reis|Karen]], Ryan, Andy, Jack, and Maya inside.\n\nThey found a jack in the trunk of Audrey's car, but they were unable to use it to lift the door enough to get any access. Because the windows of the house wouldn't shatter and the air conditioning for the garage wasn't working because of the fire, the garage quickly started heating up. After a few more failed ideas to free themselves, Andy had the idea to use the pilot light from the water heater to start a fire and induce an explosion that would break through the door. They siphoned gas out of the car as an accelerant. They started the fire and took cover. The blast was strong enough to break through the garage door and they were freed. Once she was out, Audrey was treated for overheating. She talked to Oliver, who said watching all their stuff go up in flames was a good way to rip off the bandage. She showed him the one photo she'd saved from the garage.\n\n==Relationships==\n===Romantic===\nShe is married to [[Oliver (Hot Box)|Oliver]], but they are separated. They got married in March 2002.\n\n==Career==\nShe works in cybersecurity.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS191x09-3.jpg\nS191x09-5.jpg\nS191x09-10.jpg\nS191x09-60.jpg\n</gallery>\n\n{{DISPLAYTITLE:Audrey}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S1 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}