{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"67021": {"pageid": 67021, "ns": 0, "title": "Ava Linsley", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S191x02AvaLinsley.png\n|name = Ava Linsley\n|status = Alive\n|children = Daughter\n|parents = [[Principal Linsley]]\n|only appearance = [[Invisible to Me]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 1 (Station 19)|1]]\n|portrayed by = [[Emma Loewen]]\n}}\n\n'''Ava Linsley''' is a teenage girl who gave birth in the bathroom of her middle school.\n\n==History==\nAva was pregnant and went into labor at her middle school. Her friend, Tuck, pulled the fire alarm, knowing his dad would come. Once the firefighters arrived, Tuck led them to Ava, who was hiding in a bathroom in the evacuated school. She was close to delivery, so they called for the aid car, but they were told it had been sent away, so they had to prepare to deliver themselves. Victoria taught Ava to sing, \"I'm a little teapot\" to distract her brain from the pain and her baby was quickly born. However, the baby was still completely sealed in the amniotic sac, so they debated whether they should wait for more help or rupture it and stabilize the baby outside the sac. The baby finally twitched after no movement for several moments, so they pinched the sac to rupture it and then suctioned the baby's mouth. Once they got the baby breathing, they handed the baby off to Ava. When her mom came in, Ava asked her not to be mad and was surprised when she wasn't.\n\n==Relationships==\n===Romantic===\nShe has a boyfriend who got her pregnant when they were in eighth grade. The day she gave birth, he was at the orthodontist getting his braces off.\n\n===Familial===\nShe feels that her mother pays attention to all the kids at school except for her, to the point where her mother didn't notice that she was pregnant.\n\n===Friendships===\nShe and [[William George Bailey Jones|Tuck]] are friends. They met when they were part of the debate team together. When she went into labor at school, he pulled the fire alarm so Ben would come help.\n\n==Notes and Trivia==\n*She gets good grades.\n*She was 13 at the time of her pregnancy.\n\n[[es:Ava Linsley]]\n\n{{DEFAULTSORT:Linsley, Ava}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S1 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}