{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50277": {"pageid": 50277, "ns": 0, "title": "Barbara", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP306Barbara.png\n|name = Barbara\n|alias = Barb\n|status = Alive\n|diagnosis = Depression\n|doctors = *[[Pete Wilder]]\n*[[Violet Turner]]\n|treatment = *Antidepressants\n*Acupressure\n*Biofeedback\n*Exercise therapy\n*Talk therapy\n*Electroconvulsive therapy\n|marital = [[Jimmy]] ''(ex-fiancé)''\n|parents = *Father †\n*Mother\n|only appearance = [[Slip Slidin' Away]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Susan May Pratt]]\n}}\n\n'''Barbara''' is a patient who had ECT to treat her severe depression.\n\n==History==\nBarbara had severe depression. Her fiancé, [[Jimmy]], had to drag her into the practice for her treatment, which included biofeedback and talk therapy. She said that she didn't want to continue her treatment and just wanted to kill herself.\n\nJimmy talked to Pete, saying he watched her all the time, but she'd stopped eating. She had nursed her father and then it had been a whole year of her severe depression. After a session with Violet, Barbara decided she wanted to use electroconvulsive therapy to treat her depression.\n\nThey set up the procedure and performed it. Barbara woke up in the hospital with a headache, but without anything pressing down on her shoulders. When Jimmy came in to see her, she asked him who he was.\n\nViolet cautioned him that memory loss was not uncommon. They told him to go in and try to jog her memory.\n\nViolet talked to Barbara, asking her questions, trying to figure out if there were other gaps in her memory. She still had no memory of Jimmy, but everything else was still there. Violet told Pete that because the rest of her memory was intact, she believed that something traumatic happened with Jimmy, something so bad that she blocked it out.\n\nThey brought Jimmy into the room and asked him to talk about their last fight. He said they don't fight because he never wanted to make things worse for her. When Barbara was asked to talk about the last fight she'd had with anyone, she said that she didn't want to think about fights because she was so happy and didn't want to go back.\n\nThey then talked to Barbara, saying that ECT doesn't erase an entire person from your memory. They told her they believed Jimmy was dangerous and that's why she'd blocked him out. She started laughing at the idea that anyone could find Jimmy dangerous because he was a nice guy. She admitted that when she'd woken up, she smiled, but when she saw him, she did't want to smile anymore. She didn't want to hurt his feelings after everything he'd done, but because she knew ECT caused memory loss, she used that to help her. She couldn't remember why she was engaged to him, saying when she was depressed, he seemed fine, but now that she's not, he didn't seem right for her.\n\nWanting to spare Jimmy's feelings, Pete and Violet said he was just gone from her memory and wouldn't come back. They said Barbara was happy now and he should try to be happy for her and move on.\n\n==Relationships==\n===Romantic===\nShe was engaged to [[Jimmy]] until she had ECT. She said before, he seemed fine, but afterward, she couldn't figure out why she liked him, so she pretended not to remember him.\n\n===Familial===\nShe nursed her father when he was sick. He used to tell her stories about Venice, where her parents went on their honeymoon. Her father liked Jimmy a lot.\n\n==Notes and Trivia==\n*She went to Monklands High School.\n*She went to the Romance in Venice prom with Eddie Parker.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP3x06-2.jpg\n</gallery>\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (CAM)]]"}]}}}}