{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"81205": {"pageid": 81205, "ns": 0, "title": "Battalion Chief Gregory", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Firefighter Infobox\n|image = S194x06-9.jpg \n|name = Battalion Chief Gregory\n|status = Deceased\n|title = Battalion Chief\n|job = Battalion Chief\n|workplace = [[Seattle Fire Department]]\n|first appearance = [[Train in Vain]]\n|last appearance = [[I Guess I'm Floating]]\n|count = 3\n|seasons = '''[[Station 19|S19]]:''' [[Season 4 (Station 19)|4]]\n|portrayed by = [[Tom Wright]]\n}}\n\n'''Battalion Chief Gregory''' is a battalion chief who came to station 19 to inspect them.\n\n==History==\n===Becoming a Firefighter===\nWhen he first became a firefighter, he and a man named Harris were the only two Black firefighters in the whole department. The other firefighters at his own station refused to sleep in beds after he'd been in them and broke cups he'd used. He considered quitting until he finally got promoted. ''(\"[[Save Yourself]]\")''\n\n===Inspection===\nGregory came to station 19 to inspect them, an inspection that would determine their budget for the whole year. He arrived to find Dean, Vic, and Travis sleeping at the station. Andy excused their behavior, explaining that the day prior, they'd rescued two kidnapped girls and their captain and one of their lieutenants were out on a call, following a woman who was believed to be involved in the kidnappings. He continued with the inspection.\n\nAs he had the team lined up to inspect their uniforms, he told them he respected their values of honesty and bravery. He also said he'd be proud to have any of them on his team. Then Vic suddenly started crying, startling him. Her teammates rushed to defend her, saying she never did things like that, but she'd been shoving everything down. The team hadn't slept or eaten. ''(\"[[Train in Vain]]\")''\n\n===Observing Station 19===\nIn light of Dean's lawsuit against the police department, the fire department sent Gregory to observe station 19's calls, to head off any more lawsuits. He observed as they rescued [[Karissa Skolaski]] and [[Shayne Riley]] from a car that was driven into the back of a truck. While they worked, he encouraged Sullivan to apply for lieutenant and said he'd support him if he could convince Dean to drop the lawsuit. At the same time, he tried to encourage Dean directly to drop it. When they were finished and found a parking ticket on their hood, courtesy of the police department, he said he'd take care of it. ''(\"[[Save Yourself]]\")''\n\n===Banquet and Death===\nGregory hosted the annual banquet for the Black Firefighters Coalition of Seattle, which included a sunset cruise. He gave a speech which specifically targeted Dean and his lawsuit, reiterating his assertion that it was better to work from within. After the sun had set, Dean spoke to Gregory about why he was firm in his lawsuit. While they were talking, Gregory grabbed his chest, saying he couldn't breathe, then he fell over the railing into the ocean below. Dean jumped in after him, followed by Ben. Once in the water, he fell unconscious. Dean and Ben attempted resuscitation, but they were unsuccessful. Dean refused to let go of his body and held it for several hours before finally losing his grip on it. ''(\"[[I Guess I'm Floating]]\")''\n\n==Career==\nHe is a battalion chief with the [[Seattle Fire Department]]. When he first joined the fire department, he and a man named Claude Harris, who became his mentor, were the only Black firefighters. ''(\"[[Save Yourself]]\")''\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nS194x06BattalionChiefGregory.png|[[Train in Vain]]\nS194x10BattalionChiefGregory.png|[[Save Yourself]]\nS194x13BattalionChiefGregory.png|[[I Guess I'm Floating]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS194x06-7.jpg\nS194x06-8.jpg\nS194x06-9.jpg\nS194x06-11.jpg\nS194x06-12.jpg\nS194x06-14.jpg\n</gallery>\n\n==Appearances==\n{{Battalion Chief Gregory Appearances}}\n\n{{DEFAULTSORT:Gregory, Battalion Chief}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:Deceased Characters]]\n[[Category:Firefighters]]"}]}}}}