{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"67020": {"pageid": 67020, "ns": 0, "title": "Battalion Chief Frankel", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Firefighter Infobox\n|image = S191x02BattalionChiefFrankel.png\n|name = Battalion Chief Frankel\n|status = Alive\n|title = Battalion Chief\n|job = Fire Battalion Chief\n|workplace = [[Seattle Fire Department]]\n|first appearance = [[Invisible to Me]]\n|last appearance = [[Stronger Together]]\n|count = 3\n|seasons = '''[[Station 19|S19]]:''' [[Season 1 (Station 19)|1]]\n|portrayed by = [[Leslie Hope]]\n}}\n\n'''Battalion Chief Frankel''' is a Battalion Chief for [[Seattle Fire Department]].\n\n==History==\nWhen [[Pruitt Herrera]] was forced to step down as captain of Station 19, Frankel came in to check in on things and evaluate Andy and Jack as a part of choosing a new captain. She told them the selection process would take months and they were both eligible to apply. In the meantime, they'd trade off being acting captain for each shift. They'd be evaluated along the way. ''(\"[[Invisible to Me]]\")''\n\nShe later came to one of Station 19's calls. She observed how Andy led the call and how Jack responded to her orders. After the fire was contained, she told them both to do better. Jack gave a report to Frankel after their first call while he was acting Captain. When she expressed a belief that Andy got where she was because of her father being Captain, Jack told her that if anything, her father held her back. ''(\"[[Contain the Flame]]\")''\n\nFrankel supervised as the potential captains who scored the highest on the written exams went through their practical tests. At the end of Andy's drill, she criticized Andy's decision not to come out after they called mayday to rescue [[Cole Edmonds]]. She was stopped by [[Lucas Ripley]], who had come to observe for the day and told her he'd talk to her later. ''(\"[[Stronger Together]]\")''\n\n==Relationships==\n===Professional===\nShe knows Pruitt Herrera through their work with the Seattle Fire Department.\n\n==Career==\nShe is a battalion chief for the [[Seattle Fire Department]], overseeing twelve fire stations. The exact number of her battalion remains unknown to date. When she first started out, she often faced sexist practices, including not having a women's bathroom and using the trunk of her car as a locker.\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nS191x02BattalionChiefFrankel.png|[[Invisible to Me]]\nS191x03BattalionChiefFrankel.png|[[Contain the Flame]]\nS191x06BattalionChiefFrankel.png|[[Stronger Together]]\n</gallery>\n\n==Appearances==\n{{Battalion Chief Frankel Appearances}}\n\n[[es:Jefe de batallón Frankel]]\n{{DEFAULTSORT:Frankel, Battalion Chief}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S1 Characters]]\n[[Category:Firefighters]]"}]}}}}