{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"83273": {"pageid": 83273, "ns": 0, "title": "Bella", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S195x01Bella.png\n|name = Bella\n|status = Alive\n|only appearance = [[Phoenix from the Flame]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Sierra N. Smith]]\n}}\n\n'''Bella''' is one of the group of friends who set off fireworks at the Phoenix Fair.\n\n==History==\nBella was at the Phoenix Fair with [[Tara Brown]], [[Brad DiMarco]], [[Will]], and [[Mac]]. They were all doing mushrooms and decided to set off some fireworks. They were interrupted by the firefighters of station 19, who informed them that setting off fireworks in the park was illegal. However, Brad lit another one and it exploded directly in his face, seriously injuring him. All the friends panicked and Tara's ankle was injured in the ensuing chaos. All the friends begged the firefighters to save Brad and then Will, in a misguided attempt to help Brad, climbed into the fire engine and started to drive it out of the park. He drove it into the intersection, where it was t-boned by a delivery van and tipped on its side, trapping Will inside. The friends stood by while firefighters freed Will and treated Brad, eventually taking him to the hospital for further treatment.\n\n==Relationships==\n===Friendships===\nShe's friends with [[Tara Brown]], [[Brad DiMarco]], [[Will]], and [[Mac]].\n\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]"}]}}}}