{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49731": {"pageid": 49731, "ns": 0, "title": "Beth O'Brien", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP1x02-10.jpg\n|name = Beth O'Brien\n|status = Alive\n|doctors = [[Violet Turner]]\n|marital = [[Greg O'Brien]] ''(husband)''\n|children = [[Sarah O'Brien]]\n|siblings = Sister\n|only appearance = [[In Which Sam Receives an Unexpected Visitor]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 1 (Private Practice)|1]]\n|portrayed by = [[Susan Kelechi Watson]]\n}}\n\n'''Beth O'Brien''' is the mother of [[Sarah O'Brien]], who was switched with [[Emily Stinson]] as an infant.\n\n==History==\nGreg and Beth O'Brien had a nine month old, Emily, who had been ill since she was an infant. The cause of her neurological symptoms was a mystery until a blood draw showed Pelizaeus-Merzbacher disease, an incurable genetic disorder. Concerned about it being genetic, the O'Briens requested tests to figure out which of them had the genetic marker. When tests revealed that neither of them was a carrier, the doctors concluded that Emily wasn't their daughter. Greg and Beth were told that under California law, they'd have to say goodbye to Emily and welcome the other child into their home. Beth insisted that it couldn't be true, believing that as a mother, she would know. After obtaining the nursery records, they determined that their baby had been switched shortly after birth with [[Duncan Stinson|Duncan]] and [[Melinda Stinson|Melinda Stinson's]] baby.\n\nDuncan was arrested after it was discovered that he had switched the girls in the nursery after Emily had a seizure while he was holding her. Under the observation of [[Violet Turner]], the O'Briens handed Emily over to Melinda and took Sarah from her. Beth hesitated because it didn't feel right, but Violet said it was natural to feel like strangers at first. She and Melinda shared information about the girls that would help them transition to their new lives.\n\n==Relationships==\n===Romantic===\nShe is married to [[Greg O'Brien]].\n\n===Familial===\nBeth and Greg have one child. They named her Emily at birth, but after she was switched, she was called Sarah. When they were nine months old, the girls were switched back to live with their birth parents. They spent nine months raising the Stinsons' baby, who had an incurable genetic disorder.\n\nShe also has a sister who was trying to get pregnant, which is why she wanted genetic tests to see which of them was a carrier.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP1x02-8.jpg\nPP1x02-10.jpg\nPP1x02-13.jpg\nPP1x02-14.jpg\nPP1x02-15.jpg\nPP1x02-17.jpg\nPP1x02-18.jpg\n</gallery>\n\n{{DEFAULTSORT:O'Brien, Beth}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S1 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (Genetics)]]"}]}}}}