{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49784": {"pageid": 49784, "ns": 0, "title": "Beth Burton", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP105BethBurton.png\n|name = Beth Burton\n|status = Alive\n|diagnosis = *Scalp laceration\n*Emotional trauma\n*Sexual assault\n|doctors = *[[Sam Bennett]]\n*[[Violet Turner]]\n|treatment = *Stitches\n*Talk therapy\n|marital = [[John Burton]] ''(husband)''\n|parents = Mother\n|children = *Son\n*At least one other child\n|only appearance = [[In Which Addison Finds a Showerhead]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 1 (Private Practice)|1]]\n|portrayed by = [[Amy Stewart]]\n}}\n'''Beth Burton''' is a woman who was attacked during a home invasion.\n\n==History==\nWhile her husband was a on a business trip, Beth was attacked by a home invader. She claimed she hit her head on a glass table and that was the extent of the damage. Her CT was negative, but she asked about a drug that could make you forget a traumatic experience. She said that she'd like to use it because her husband was away for business a lot and she didn't think she'd be able to get a good night's sleep again.\n\nSam consulted with Violet on the drug to see if Beth was a candidate. She suggested that they start with a few sessions of talk therapy before jumping right to medication and even medication would involve talking through what had happened. Beth refused and walked out. Violet became worried at something Beth said and figured out that more had happened during the break-in than Beth had said. When Violet came to her house to talk to her, she admitted that she'd been sexually assaulted. She hadn't told anyone because she didn't believe her husband could handle it. Violet then brought both Beth and her husband in to talk to them, to start working through the trauma.\n\n==Relationships==\n===Romantic===\nShe is married to [[John Burton]].\n\n===Familial===\nShe and her husband have at least two children, including one son.\n\n{{DEFAULTSORT:Burton, Beth}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S1 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Trauma)]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (General)]]"}]}}}}