{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"78252": {"pageid": 78252, "ns": 0, "title": "Beto", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S193x11Beto.png\n|name = Beto\n|status = Alive\n|marital = Wife\n|children = Two daughters\n|job = Line Cook\n|workplace = Domenico's\n|only appearance = [[No Days Off]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 3 (Station 19)|3]]\n|portrayed by = [[Jorge-Luis Pallo]]\n}}\n\n'''Beto''' is a kitchen employee whose boss called ICE on him.\n\n==History==\nBeto was working in a kitchen with [[Dominic]] when Dominic became angry because Beto was distracted by getting garlic and burned a steak. Dominic then called ICE and reported him. Sullivan, who had stepped into the kitchen to put out a grease fire, told him to call them back and tell them not to come as they could also fine him for employing people he knew to be undocumented. In addition to that, Sullivan threatened him with fire violations. Dominic quickly called them back.\n\nDespite this call, [[Agent Prine]] and [[Agent Baxter]] arrived shortly afterward and entered the kitchen to take Beto. Sullivan and Andy followed them into the kitchen and Sullivan quickly stood up to them and protected the kitchen staff, informing them of their rights and claiming the scene as his due to the grease fire. Beto pretended to have a severe burn on his arm so they could treat him instead of letting ICE take him. Once Ben arrived with the PRT, Beto went with them.\n\nOn the way to the hospital, he told Jackson and Ben that he wasn't a criminal. He had to flee his home country with his wife and children to save their lives and he works very hard. Jackson and Ben decided to go in through the parking structure instead of the ambulance bay, allowing Beto to escape unnoticed.\n\n==Relationships==\n===Romantic===\nHe is married.\n\n===Familial===\nHe and his wife have two daughters. The younger daughter is eleven.\n\n==Career==\nHe is a line cook at Domenico's. He says that he was a teacher in his home country before the war.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS193x11-26.jpg\nS193x11-27.jpg\nS193x11-28.jpg\nS193x11-29.jpg\nS193x11-30.jpg\nS193x11-32.jpg\nS193x11-36.jpg\n</gallery>\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S3 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}