{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"4337": {"pageid": 4337, "ns": 0, "title": "Betsey Parker", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PP4x04-8.jpg\n|name = Betsey Parker\n|born = 2003\n|status = Alive\n|parents = *[[Dell Parker]] †\n*[[Heather Parker]] †\n*[[Naomi Bennett]]\n|siblings = [[Maya Bennett]]\n|grandparents = Grandmothers\n|other family = *[[Wendell Parker]] ''(great-grandfather)''\n*[[Olivia Davis]] ''(niece)''\n*[[Monica Bratton]] ''(aunt)''\n*[[Fillmore Davis]] ''(brother-in-law)''\n|first appearance = [[Serving Two Masters]]\n|last appearance = [[...To Change the Things I Can]]\n|count = 11\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]], [[Season 3 (Private Practice)|3]], and [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Hailey Sole]]\n}}\n\n'''Betsey Parker''' is the daughter of the late [[Dell Parker|Dell]] and [[Heather Parker]]. After her father's death, she spent some time with an aunt and then in foster care before [[Naomi Bennett|Naomi]] took her to New York with her.\n\n==History==\n===Early Life===\nWhen [[Dell Parker]] was seventeen years old, he started dating [[Heather Parker|Heather]]. They were both heroin addicts at the time. She got pregnant, but they hadn't been dating long and broke up.\n\nDell felt guilty about trying to force Heather to have an abortion, stating he drove her to the clinic, and when she wouldn't leave the car, he shouted at her, which is the reason he has issues with abortions. ''(\"[[Crime and Punishment]]\")'' Betsey was born and lived with her mother.\n\nDell was only reunited with his daughter much later, as Heather got clean and Dell had access to her.\n\n===Heather's Relapse===\nDell attempted to get an office from both [[Sam Bennett|Sam]] and [[Addison Forbes Montgomery|Addison]], but both put it off for later. He eventually cleaned out a spare office to impress Betsey, wanting her to see that one of her parents had it together after her mother relapsed. When Addison was about to discipline Dell for going against her wishes, she saw Betsey and allowed Dell to keep the office. ''(\"[[Serving Two Masters]]\")''\n\n===Dell's Fight for Custody===\nAfter realizing that he couldn't protect his daughter from the people Heather hung out with, he decided to get a lawyer and fight her for custody. ''(\"[[Tempting Faith]]\")''\n\n===Measles Outbreak===\nBetsey was with Dell at the practice when a kid came in and was diagnosed with measles. She had also played with the kid, [[Michael Perkins]], in the waiting room. Unsure if Betsey had been vaccinated and unable to get a hold of Heather, Dell worried that Betsey could get measles. Cooper advised him to wait until Heather could be reached because he had 24 hours to vaccinate her. When he was finally able to get a hold of Heather at the end of the day, she admitted that she didn't know whether or not Betsey was vaccinated. ''(\"[[Contamination]]\")''\n\n===Leaving Los Angeles===\nHeather got promoted at her job, but the promotion meant moving to St. Louis. Dell refused to let Heather take Betsey, so Heather left in anger. When Dell showed up at the apartment to talk to Heather about it again, he found the apartment cleared out and both Heather and Betsey gone. ''(\"[[What Women Want]]\")''\n\n===Return to Los Angeles===\nEventually, the pressure of her new job got to Heather and she relapsed. She brought Betsey back to Los Angeles and told Dell he could have her if he gave her $10,000. He got the money from Sam, but when she showed up, he said he wouldn't give her the money to kill herself, for Betsey's sake. He then told her to say goodbye to Betsey. She did so and left, leaving Betsey with Dell. ''(\"[[Yours, Mine & Ours]]\")''\n\n===Violet's Attack===\nWhen Violet was attacked and hospitalized, Betsey went with Dell to the hospital, where they waited for news. ''(\"[[A Death in the Family]]\")''\n\n===New School===\nDell took some time off from work to take care of Betsey. When she started at a new school, she cried and clung to his leg when he dropped her off. ''(\"[[Pushing the Limits]]\")''\n\n===Meth Explosion===\nBetsey was in the house with Heather when it exploded. Dell got Betsey out and they were both taken to the hospital. Heather had severe burns, but Betsey had only a minor brain contusion and carbon monoxide poisoning. Dell was told she'd wake in a few hours and she did. Once awake, Pete tried to get Dell to let her see Heather to say goodbye before Heather died. Dell refused, but Pete tried to sneak her there anyway. Right before they arrived, Dell showed up and took Betsey back to her room. Heather then died with only Pete by her side. ''(\"[[Blowups]]\")''\n\n===Living with Naomi and Maya===\nSince their home was destroyed, Dell and Betsey moved in with Naomi. She refused to speak to her father, still angry at him for not letting her say goodbye to her mother. Dell eventually went to Betsey and admitted that he'd made a mistake and was trying to protect her. He apologized to her. ''(\"[[Another Second Chance]]\")''\n\n===Dell's Death===\nWhen Dell was injured in a car accident, he asked to have Betsey brought to him before he had to have brain surgery. He talked to her, saying that if something happened to him, it would be okay because she'd know that everything bad to happen in her life would have already happened, so she'd have good things happening after that. When Dell died in surgery, Pete had to tell Betsey, who started to punch him and cry. ''(\"[[The End of a Beautiful Friendship]]\")''\n\nBetsey was then left orphaned after the accident, ending up with Aunt Monica.\n\n===Return to the Practice===\nAunt Monica showed up one day in OWG, telling Violet that she couldn't keep her for long, and left Betsey behind. Betsey colored and played in her dad's old office. Betsey was later taken home by Violet and Betsey asked if she could stay with them forever, but arguments ensued between Pete and Violet, Cooper and Charlotte, and Sam and Addison about keeping Betsey with them, with none of them willing to keep her for a greater stretch of time. After the discussion, it was decided that Betsey should be submitted to social services and put in foster care. ''(\"[[A Better Place to Be]]\")''\n\n===Second Hospitalization===\nA few months later, Betsey ended up in [[St. Ambrose Hospital|St. Ambrose Hospital's]] [[Emergency Room|ER]] because she fell down the stairs in her foster home. While she was being checked out, she said she didn't want to be there because her mommy and daddy died there. She had a brain contusion, but Amelia said the swelling could go down on its own. They did x-rays, which showed a recent clavicle fracture that had healed. Cooper became suspicious that her foster parents were abusing her. They monitored for a while, but when Betsey started seizing, they rushed her into surgery. Gina and Phil left to follow, leaving their son, Marshall, with Pete. Pete took Marshall to the cafeteria where they were joined by Sheldon. He asked Marshall about his parents. He said that when Betsey doesn't listen, he helps her to listen. He said that the jungle gym fall was her fault.\n\nIn surgery, Betsey started bleeding, so Amelia had to work to stop it. Meanwhile, Sheldon talked to the others, saying he believed Marshall would need help. They went to the Rakoffs about Marshall.\n\nAfter surgery, Betsey was stable, but comatose. After some time, Betsey woke up. When she learned that the Rakoffs had left, she asked where she was going to live. Naomi told her she was coming to live with her. ''(\"[[God Bless the Child]]\")''\n\n===Move to New York===\nBecause Maya had been accepted to Columbia and Naomi wanted to be around to help her with Olivia and she and Gabriel became engaged, she moved Betsey with her to New York. ''(\"[[...To Change the Things I Can]]\")''\n\nBetsey lived with [[Naomi Bennett|Naomi]] and [[Gabriel Fife]], Naomi's fiancé, in New York until Naomi and Fife broke up. Naomi and Betsey moved back to LA for Sam, when Naomi became pregnant with his baby.\n\n==Notes and Trivia==\n*Betsey is often seen drawing.\n*Her last line in the show was, \"That's too bad. I like him.\" (referring to [[Gabriel Fife]]).\n*She was a week overdue.<ref>[[Pushing the Limits]], 3x04 (PP)</ref>\n*She hates the cold.<ref>[[Blowups]], 3x10 (PP)</ref>\n*She and Dell watched cartoons together.<ref>[[A Better Place to Be]], 4x04</ref>\n*According to Naomi, she and Olivia adore each other.<ref>[[In Which We Say Goodbye]], 6x13 (PP)</ref>\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\">\nPP206BetseyParker.png|[[Serving Two Masters]]\nPP211BetseyParker.png|[[Contamination]]\nPP219BetseyParker.png|[[What Women Want]]\nPP222BetseyParker.png|[[Yours, Mine & Ours]]\nPP301BetseyParker.png|[[A Death in the Family]]\nPP310BetseyParker.png|[[Blowups]]\nPP311BetseyParker.png|[[Another Second Chance]]\nPP323BetseyParker.png|[[The End of a Beautiful Friendship]]\nPP4x04BetseyParker.png|[[A Better Place to Be]]\nPP4x21BetseyParker.png|[[God Bless the Child]]\nPP4x22BetseyParker.png|[[...To Change the Things I Can]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP4x04-2.jpg\nPP4x04-4.jpg\nPP4x04-5.jpg\nPP4x04-7.jpg\nPP4x04-8.jpg\nPP4x04-9.jpg\nPP4x04-10.jpg\nPP4x04-15.jpg\nPP4x04-16.jpg\nPP4x04-21.jpg\nPP4x04-23.jpg\nPP4x21-14.jpg\nPP4x21-15.jpg\nPP4x21-16.jpg\nPP4x21-17.jpg\n</gallery>\n\n==Appearances==\n{{Betsey Parker Appearances}}\n{{Scrollbox}}\n\n{{DEFAULTSORT:Parker, Betsey}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:PP S3 Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Peds)]]\n[[Category:Patients (Trauma)]]"}]}}}}