{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"74091": {"pageid": 74091, "ns": 0, "title": "Bill Miller (Character)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = S194x13BillMiller.png\n|name = Bill Miller\n|status = Alive\n|marital = [[Ifeya Miller]] ''(wife)''\n|children = *[[Dean Miller]] †\n*[[Yemi Miller]]\n|grandchildren = [[Pruitt Arike Miller]]\n|first appearance = [[Baby Boom]]\n|last appearance = \n|count = 5\n|seasons = '''[[Station 19|S19]]:''' [[Season 2 (Station 19)|2]], [[Season 4 (Station 19)|4]], and [[Season 5 (Station 19)|5]]\n|portrayed by = [[Jeffrey D. Sams]]\n}}\n\n'''Bill Miller''' is the father of [[Dean Miller]].\n\n==History==\n===Visiting Dean===\nBill, along with his wife and daughter, went to his son's house to have dinner with him and Jack. During the dinner, Ifeya and Bill continuously tried to get Dean to join the family business. This came to a head when Yemi announced that she wanted to move out of their house, inspired by Dean. Ifeya then took Dean outside to talk to him privately, where he explained that being a firefighter is more than a job to him. He and Ifeya then made a deal that she would back off Yemi and let her move out and support her if he would go on a few dates that she set up for him. ''(\"[[Baby Boom]]\")''\n\n===Meeting JJ's Parents===\nWhen JJ's parents came to town to meet Dean and Pru, they arranged to have a dinner with Ifeya and Bill. Despite a small amount of tension, with Ifeya expressing that she didn't want Pru influenced by JJ's lifestyle, the dinner went well and JJ's parents expressed desire to continue visiting her and having a relationship with her. ''(\"[[I Guess I'm Floating]]\")''\n\n===Dean's Death and Taking Pru===\nAfter Dean's death, Bill and his wife struggled with their grief. On Thanksgiving, Bill came to the station and told Bailey that his wife needed her granddaughter. He agreed to stay and have dinner with them, but insisted he would be taking his granddaughter with him when he left. At the end of the meal, Bill left with Pru, whom he called Arike, which he said was her true name. ''(\"[[Little Girl Blue]]\")''\n\nDespite Dean's will stipulating that he wanted Pru to be raised by Ben and Bailey in the event of his death, Ifeya and Bill insisted that they would be raising her instead. They also cleared out Dean's houseboat and arranged for it to be sold. When Ben and Bailey tried to reach a good solution for everyone, Ifeya refused and said she needed to override her son because she didn't believe he'd made the right decision for Pru. However, when Pru woke up that night crying for Bailey, she called Bailey and let her, along with Ben and Joey, help put Pru back to bed. ''(\"[[A House Is Not a Home]]\")''\n\nAfter months of fighting, Ifeya and Bill came to Ben and Bailey's place and told them that they wanted Pru to live with Ben and Bailey permanently, but wanted virtually all holidays and alternating birthdays. Bailey rejected the offer, saying that arrangement made them glorified nannies while Ifeya and Bill got to do all the fun things. She then implied that she was privy to some private medical information that could make the difference in court. Ifeya then told Bailey she'd had a heart attack and had had surgery to implant a pacemaker, which they were still adjusting. It made it difficult to keep up with a toddler. Ifeya and Bill then agreed to sharing the holidays, but Ifeya still asked Ben to quit firefighting, as she didn't want Pru to lose a second father to a fire. ''(\"[[Cold Blue Steel and Sweet Fire]]\")''\n\n==Relationships==\n===Romantic===\nHe is married to [[Ifeya Miller]]. They met when they were 22.\n\n===Familial===\nHe and his wife put a lot of pressure on their children to succeed and didn't approve of Dean being a firefighter.\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nS192x11BillMiller.png|[[Baby Boom]]\nS194x13BillMiller.png|[[I Guess I'm Floating]]\nS195x06BillMiller.png|[[Little Girl Blue]]\nS195x07BillMiller.png|[[A House Is Not a Home]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS195x13-19.jpg\n</gallery>\n\n==Appearances==\n{{Bill Miller Appearances}}\n\n{{DISPLAYTITLE:Bill Miller}}\n\n{{DEFAULTSORT:Miller, Bill}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S2 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:S19 S5 Characters]]"}]}}}}