{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"80236": {"pageid": 80236, "ns": 0, "title": "Billie", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S194x01Billie.png\n|name = Billie\n|status = Alive\n|only appearance = [[Nothing Seems the Same]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 4 (Station 19)|4]]\n|portrayed by = [[Tess Aubert]]\n}}\n\n'''Billie''' is a kid who was injured when they tried taking the radiator cap off a hot car.\n\n==History==\nBillie and their friends, [[Conor Jaxtimer]], [[Frankie Morris]], and [[Kayden Lee]] were driving to a party when Kayden's car broke down. Billie opened the radiator cap and got burned on their arm. Frankie called for help and Travis and Vic quickly arrived. Vic treated Billie's burn and then they left the kids waiting for a tow. After they left, Kayden, believing he could fix the car, poured gasoline in the radiator, causing an explosion and fire. Conor and Frankie immediately ran away but Billie stayed with Kayden until Travis and Vic came back. When Vic asked Billie if they'd taken any drugs, Billie ran away as well. The fire then spread to the nearby woods and the firefighters had to rescue all three teens, who were then taken to the hospital to be treated.\n\n==Relationships==\n===Friendships===\nThey are friends with Conor, Frankie, and Kayden. They were graduating seniors and upset with graduation and prom being cancelled, so they decided to have a party despite the quarantine in effect.\n\n==Notes and Trivia==\n*They are non-binary.\n*They were 18 years old at the time of the fire.\n\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}