{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"2471": {"pageid": 2471, "ns": 0, "title": "Bizzy Forbes", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PP4x12-30.jpg\n|name = Beatrice Bradford Forbes\n|born = 1949; [[Connecticut]]\n|died = 2011; [[Los Angeles]], California\n|status = Deceased\n|marital = *[[\"The Captain\" Montgomery]] ''(ex-husband)''\n*[[Susan Grant]] † ''(wife)''\n|children = *[[Addison Forbes Montgomery]]\n*[[Archer Montgomery]]\n|parents = Father †\n|grandchildren = [[Henry Montgomery]]\n|other family = [[Jake Reilly]] ''(son-in-law)''\n|first appearance = [[Blowups]]\n|last appearance = [[Home Again]]\n|count = 6\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]] and [[Season 4 (Private Practice)|4]]\n|portrayed by = [[JoBeth Williams]]\n}}\n\n'''Bizzy Forbes''' was the eccentric mother of [[Addison Forbes Montgomery|Addison]] and [[Archer Montgomery]].\n\n==History==\n===Telling Addison the Truth===\nAfter The Captain called her to come tell Addison the truth, she flew to Los Angeles. When Susan came there after her, Addison believed that the Captain was having an affair with Susan. However, Addison was shocked when she walked in on Bizzy and Susan kissing. Believing that The Captain pushed Bizzy to do it, Addison talked to Bizzy about facing it, but Bizzy corrected her that she and Susan had been together for 20 years. Bizzy said that Susan was the one thing she did for herself among all the things she did for her children. Seeing how upset having her parents there made Addison, Sam came to her house and told them to leave. They did so, but Addison came to the airport to see them off and talk to Bizzy, though they only talked about the bad service she'd received on the flight to Los Angeles. ''(\"[[Blowups]]\")''\n\n===Susan's Cancer===\nBizzy called Addison in the middle of the night when Susan became sick. They then flew to Los Angeles to get Addison's help. ''(\"[[Just Lose It]]\")''\n\nSusan had stage IV ovarian cancer. Addison ran tests and then had to deliver the news that the cancer had spread and there was nothing she could do. Bizzy slapped Addison and commanded Addison to save Susan's life. Addison called in [[Eric Rodriguez]] and asked for his professional advice. He agreed that there was nothing there could do, but agreed to do some research and consult with colleagues. He suggested that Addison scope her. When Addison did the scope, she saw that the tumor had spread to her liver. She suggested not doing anything, but Bizzy kept pushing, so Addison suggested using the [[Da Vinci Surgical System]] to get angles she couldn't get with her own hands. Susan agreed to try it for Bizzy. Addison brought Eric in on the surgery to use hot chemo to kill the cancer cells left behind. They were able to remove the cancer and place her port for chemo. ''(\"[[If You Don't Know Me By Now]]\")''\n\n===Wedding===\nBizzy, wanting to give Susan the wedding she wanted, had Addison plan an elaborate ceremony. When Addison went to check to see if Susan was dressed for the wedding, she discovered that Susan wasn't better. She knew that her cancer had come back and had chosen to be discharged anyway because she wanted her wedding. She said she'd signed a DNR and didn't want Addison to tell Bizzy. After the wedding, Susan collapsed. ''(\"[[Heaven Can Wait]]\")''\n\n===Susan's Death===\nSusan was stabilized in the ER, but she was in septic shock. They started antibiotics, but Susan developed a clot in her lung and because of her DNR, Addison was unable to do anything. Shortly after Bizzy returned to her bedside, Susan died. Bizzy worried about what she'd do next and Addison said she'd help her figure it out. However, when Addison came to see Bizzy, she found that she had killed herself. ''(\"[[Blind Love]]\")''\n\n===Funeral===\nBizzy requested that Addison give the eulogy at her funeral. Addison hid from everyone that Bizzy had committed suicide. Despite wanting to tell everyone her mother's true colors, Addison gave a glowing eulogy, talking about Bizzy's charity work and personal accomplishments. Before she was interred, Addison placed the urn with Susan's ashes in Bizzy's coffin. ''(\"[[Home Again]]\")''\n\n==Relationships==\n===Romantic===\nShe had a thing with another girl at summer camp when she was 14. ''(\"[[Blowups]]\")''\n\n====[[\"The Captain\" Montgomery]]====\nShe married The Captain, but even though she loved him, she was not \"in love\" with him. They stayed together because of their children, Archer and Addison. The marriage wasn't an easy one. The Captain knew that Bizzy's interest was not in him and therefore had many affairs to fill the void.  \n====[[Susan Grant]]====\n[[File:PP4x12-9.jpg|thumb|Bizzy and Susan at their wedding.]]She had a 20 year secret relationship with her assistant, Susan.\n\nWhen Bizzy and Susan returned to Los Angeles, after Susan had surgery, Bizzy told Addison that she had divorced The Captain and was marrying Susan. ''(\"[[If You Don't Know Me By Now]]\")''\n\nAddison planned an elaborate wedding and the two of them married. ''(\"[[Heaven Can Wait]]\")''\n\nSusan died and Bizzy killed herself. ''(\"[[Blind Love]]\")''\n\n===Famillial===\nBizzy's relationship with her children wasn't an easy one. She wasn't a loving mother, but instead was very demanding of them.\n\nWhen Addison was able to treat Susan after working hard to come up with a solution, she was disappointed when Bizzy didn't even thank her. ''(\"[[If You Don't Know Me By Now]]\")''\n\nAt Bizzy and Susan's reception, Bizzy thanked Addison for planning it and said she'd done a beautiful job. ''(\"[[Heaven Can Wait]]\")''\n\nAfter Susan died, Bizzy blamed Addison for not doing enough to save her. While Bizzy packed up her things, Addison came and told her she loves her and was there for her as she figured out what was next. They made plans for the next day, but when Addison came by to get Bizzy, she found that she had killed herself. ''(\"[[Blind Love]]\")''\n\n==Notes and Trivia==\n*Bizzy refused to be called ''mom''.<ref>[[Tempting Faith]], 2x07 (PP)</ref>\n*She was 62 at the time of her death.<ref>[[Home Again]], 4x14 (PP)</ref>\n*In lieu of flowers, she asked for donations to the City Ballet or the garden club in her name.<ref>[[Home Again]], 4x14 (PP)</ref>\n*At her funeral <ref>[[Home Again]], 4x14 (PP)</ref> it's revealed that her first name is Beatrice\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPP310BizzyForbes.png|[[Blowups]]\nPP4x10BizzyMontgomery.png|[[Just Lose It]]\nPP4x11BizzyForbesMontgomery.png|[[If You Don't Know Me By Now]]\nPP4x12BizzyForbesMontgomery.png|[[Heaven Can Wait]]\nPP4x13BizzyForbes.png|[[Blind Love]]\nPP4x14BizzyForbes.png|[[Home Again]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP3x10-4.jpg\nPP3x10-5.JPG\nPP3x10-7.JPG\nPP3x10-12.jpg\nPP3x10-17.jpg\nPP3x10-18.jpg\nPP3x10-20.jpg\nPP4x11-7.jpg\nPP4x11-14.jpg\nPP4x11-15.jpg\nPP4x11-16.jpg\nPP4x11-17.jpg\nPP4x11-20.jpg\nPP4x12-3.jpg\nPP4x12-9.jpg\nPP4x12-16.jpg\nPP4x12-19.jpg\nPP4x12-27.jpg\nPP4x12-30.jpg\nPP4x12-31.jpg\n</gallery>\n\n==Appearances==\n{{Bizzy Forbes Appearances}}\n{{Scrollbox}}\n\n{{DEFAULTSORT:Forbes, Bizzy}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Deceased Characters]]"}]}}}}