{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50930": {"pageid": 50930, "ns": 0, "title": "Bob Yates", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x03BobYates.png\n|name = Bob Yates\n|status = Deceased\n|diagnosis = *Acute myocardial infarction\n*Dissecting aneurysm\n|doctors = *[[Dr. Warren]]\n*[[Sam Bennett]]\n|treatment = Cardiac bypass\n|job = Teacher\n|only appearance = [[Playing God]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Greg Ainsworth]]\n}}\n'''Bob Yates''' is a patient who confessed to child molestation after a heart attack.\n\n==History==\nBob collapsed during a school play and was taken to the hospital. Sam looked at his scans and diagnosed an acute myocardial infarction. He needed bypass. [[Dr. Warren]] was paged away, so Sam took him up himself, with instructions to call someone if he needed help. As they were taking him to the OR, he became worried he might die and said that he needed to confess something first. He told Sam that he'd molested several children. He said he tried to stop, but he couldn't.\n\nBefore surgery, Bob had a CT angio which revealed a dissecting aneurysm. Because of his confession, Sam decided not to call in help and took Bob up to surgery himself. In surgery, Sam fixed the problem, but Bob started bleeding. Sam delayed life-saving care and Bob was pronounced dead in the OR.\n\n==Career==\nHe was a teacher.\n\n==Notes and Trivia==\n*He was 45 at the time of his death.\n*He was pronounced dead at 20:13.\n\n{{DEFAULTSORT:Yates, Bob}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Deceased Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Cardio)]]"}]}}}}