{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50169": {"pageid": 50169, "ns": 0, "title": "Bobby Douglas", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP221BobbyDouglas.png\n|name = Bobby Douglas\n|status = Alive\n|diagnosis = *Severe allergic reaction\n*Stevens-Johnson Syndrome\n*Chlamydia\n|doctors = [[Cooper Freedman]]\n|treatment = *Solu-medrol\n*Diphenhydramine\n|parents = *[[Ted Douglas]]\n*[[Barbara Douglas]]\n|only appearance = [[What You Do for Love]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Charlie McDermott]]\n}}\n'''Bobby Douglas''' is the student [[Donna Keating]] slept with.\n\n==History==\nBobby came into the ER with a severe allergic reaction. He wouldn't say what he'd ingested that might have caused it, leading Cooper to suspect he'd taken something illegal. His teacher, [[Donna Keating]], came in with him, saying she'd found him. She admitted to Sam that she'd given him both the medicines prescribed to her because she'd been having sexual contact with him. They were able to treat Bobby and stabilize him. He'd reacted to the sulfadiazine.\n\nHe lied to his parents, saying his friend had given something to stay awake so he could study. However, the truth came out when Donna came to visit him again in the hospital. The police arrested Donna, but Bobby insisted that he loved her and wanted to be with her. After being bailed out, she came to see him and told him he didn't love her. He believed she was lying, but she quickly left.\n\n==Relationships==\n===Romantic===\nWhile he was a senior in high school, he had sexual contact with one of his teachers, [[Donna Keating]].\n\n===Familial===\nHis parents came to the hospital with him when he had an allergic reaction. They were horrified to learn what had happened between him and his teacher.\n\n==Notes and Trivia==\n*He was 17 at the time of his hospitalization.\n\n{{DEFAULTSORT:Douglas, Bobby}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Peds)]]"}]}}}}