{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49889": {"pageid": 49889, "ns": 0, "title": "Braden Tisch", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP204BradenTisch.png\n|name = Braden Tisch\n|status = Alive\n|diagnosis = *Acquired aphasia\n*Landau-Kleffner Syndrome\n|doctors = *[[Cooper Freedman]]\n*[[Sam Bennett]]\n|treatment = *Prednisone\n*Anti-convulsants\n|parents = [[Nicole Tisch]]\n|only appearance = [[Past Tense]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Ty Simpkins]]\n}}\n\n'''Braden Tisch''' is a kid whose mother believed he was autistic because he wouldn't speak.\n\n==History==\nBraden came into the practice with his mother, Nicole, who was worried because he wasn't socializing or speaking. He'd had treatments for autism previously, but they hadn't worked. Braden had started speaking and then stopped suddenly at four. Cooper agreed to look into it and see if he could figure out what was wrong. Cooper examined him and during his exam, Braden briefly made eye contact with him before breaking it.\n\nNicole later returned to the practice enraged because she figured out that she recognized Cooper from an adult sex site. She said he shouldn't be a doctor and left quickly.\n\nDespite Nicole's desire to have Cooper not work on her son, Cooper consulted with Sam, asking what he knew about acquired aphasia. He wondered if Braden was having seizures in his sleep, which was causing the aphasia.\n\nCooper went to Nicole's house and she slammed the door in his face. He got her to open it again by saying that Braden might not be autistic. He suggested instead that he had Landau-Kleffner syndrome. He'd had several seizures which caused his aphasia, which caused him to withdraw. He gave her the names of three pediatricians and all his research.\n\nNicole brought Braden back into the practice, where Cooper gave him prednisone. After the prednisone had a chance to work, Braden said a few hesitant words, thanking Cooper for the truck. His mother said he'd started talking 45 minutes prior and said that whatever else Cooper is, he's a good doctor.\n\n==Relationships==\n===Familial===\nHis mother, Nicole, was very worried about him when he stopped speaking suddenly after turning four.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP2x04-1.jpg\nPP2x04-10.jpg\nPP2x04-23.jpg\n</gallery>\n\n{{DEFAULTSORT:Tisch, Braden}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Peds)]]\n[[Category:Patients (Neuro)]]"}]}}}}