{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50141": {"pageid": 50141, "ns": 0, "title": "Brandon Henry", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP219BrandonHenry.png\n|name = Brandon Henry\n|status = Alive\n|diagnosis = *Stage IV throat cancer\n*Human papilloma virus\n*Bleeding\n|doctors = *[[Sam Bennett]]\n*[[Cooper Freedman]]\n*Dr. Pape\n|treatment = *Biopsy\n*Surgery\n|parents = Mother\n|only appearance = [[What Women Want]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Jamie Thomas King]]\n}}\n'''Brandon Henry''' is a patient who contracted throat cancer due to HPV.\n\n==History==\n===Childhood Illness===\nBrandon had a cleft palate as a kid as well as several other ailments. He was one of Cooper's patients and Cooper says Brandon singlehandedly kept his first practice open.\n\n===Cancer===\nBrandon came into the practice with a sore throat. Sam examined him and found a lump in Brandon's throat and wanted to do a biopsy.\n\nThe biopsy showed that the mass was cancerous. The mass was also positive for HPV. When Brandon's girlfriend, [[Lyla]], heard this, she believed she caused his cancer because she also had HPV. She hadn't told him because she didn't think the virus could hurt him. Brandon assured her that he didn't blame her. They ran more tests to stage the cancer and found that it was stage IV and he needed surgery that would involve removing part of his jaw. He said he didn't want that because he had a whole childhood of looking different and didn't want to go back to that. Cooper suggested that they could try chemotherapy and radiation first, but when Brandon started coughing up blood, they found out the tumor was pressing against his carotid artery and would need to be removed surgically. When Lyla heard about this, she left Brandon. Despite initial reluctance, Brandon agreed to have surgery.\n\n==Relationships==\n===Romantic===\nHe was dating [[Lyla]]. They met when they were lab partners and he had purchased a ring to propose, but was trying to get up the nerve to ask her. She left him when he learned he needed surgery to remove part of his jaw.\n\n===Familial===\nHis mother called him her \"little lemon\" because he was always getting sick.\n\n==Notes and Trivia==\n*He was 22 at the time of his cancer diagnosis.\n\n{{DEFAULTSORT:Henry, Brandon}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (General)]]\n[[Category:Patients (Oncology)]]"}]}}}}