{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50284": {"pageid": 50284, "ns": 0, "title": "Brendon", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP307Brendon.png\n|name = Brendon\n|status = Alive\n|diagnosis = Priapism\n|doctors = [[Charlotte King]]\n|treatment = *Needle aspiration\n*Shunt\n|marital = [[Melissa (The Hard Part)|Melissa]] ''(wife)''\n|other family = *Mother-in-law\n*Jenny ''(sister-in-law)''\n|only appearance = [[The Hard Part]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Stephen Sowan]]\n}}'''Brendon''' is a newlywed who overdose on EDs and ended up with priapism.\n\n==History==\nBrendon came into the practice after his wedding with two of his friends, Buck and Dan. He had wanted his wedding night to be special, so he took ED meds right after the ceremony and was unable to go flaccid. Cooper called in Charlotte to take care of him.\n\nBrendon was embarrassed about his condition and only removed his pants after Cooper went in to talk to him. When needle aspiration failed, Charlotte suggested a shunt. By this point, Brendon's wife, [[Melissa (The Hard Part)|Melissa]] had arrived. When she heard that the next option was de-gloving, she ran from the room in horror.\n\nWhile Charlotte was placing the shunt, Melissa confessed that she was pregnant. He was enraged that she'd had sex with someone else. The shunt worked and Brendon was flaccid and had no signs of permanent damage. Charlotte spoke to him and advised him he might regret it if he walked away from his marriage because of what Melissa had done. She advised him to stick it out if he loved her because he owed it to himself to give her a second chance.\n\nHe then told Melissa he loved her and wasn't ready to walk away. They left the practice after Charlotte told him not to use his penis for a few days.\n\n==Relationships==\n===Romantic===\nHe is married to [[Melissa (The Hard Part)|Melissa]]. They made a virginity pledge while they were dating. However, Melissa broke that and had sex with someone else, which resulted in a pregnancy. Despite this, he decided to stay with her.\n\n===Friendships===\nHis friends [[Dan]] and [[Buck]] were his groomsmen and came to the practice with him.\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Urology)]]"}]}}}}