{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49872": {"pageid": 49872, "ns": 0, "title": "Brian Jacobs", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP202BrianJacobs.png\n|name = Brian Jacobs\n|status = Alive\n|doctors = *[[Naomi Bennett]]\n*[[Addison Forbes Montgomery]]\n*[[Violet Turner]]\n|marital = [[Lisa Jacobs]] ''(wife, separated)''\n|parents = Parents\n|only appearance = [[Equal and Opposite]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Fran Kranz]]\n}}\n\n'''Brian Jacobs''' is a patient who came to the practice because he and his wife were unable to conceive.\n\n==History==\nBrian came into the practice with his wife, Lisa. They'd been married for five years and hadn't been able to conceive. They came to the practice in the hopes that the doctors could help them conceive. The doctors ran tests and found that Lisa and Brian were biological half-siblings. Their parents had used the same sperm donor to get pregnant.\n\nNaomi and Addison broke the news to Lisa and Brian and they asked the doctors to help them get pregnant still. They said they were staying together and still wanted a baby. Addison and Naomi said they couldn't help them conceive. They couldn't use a sperm donor or adopt. Brian said they could be together and not have kids. Addison said they'd have to stop having sex because no birth control was 100%. Lisa then declared that she wanted her tubes tied. Addison said she wouldn't do it because Lisa was only 23.\n\nLisa came to Addison alone, pleading with her to do the surgery because she said Brian was her missing piece.\n\nThe next day, they came back to the practice, hoping Addison would do the surgery. She said she wouldn't. And then Brian revealed that he knew before they got married that they had the same biological father. He thought it was suspicious that they had the same allergy, blood type, and toes. He looked into it. Lisa was horrified that he had known and married her anyway. She said it was over between them.\n\nAddison set Lisa up with an appointment to see Violet and Brian got a hotel room.\n\n==Relationships==\n===Romantic===\nHe is married to [[Lisa Jacobs]]. They met in middle school and married when they were 18. They felt like they were meant to be together because they had so much in common. When Lisa learned that Brian knew that they were siblings before they were married, she was disgusted and left him.\n\n===Familial===\nBrian's parents used a sperm donor to conceive him.\n\n==Notes and Trivia==\n*He's allergic to grass and peanuts.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP2x02-3.jpg\nPP2x02-9.jpg\n</gallery>\n\n{{DEFAULTSORT:Jacobs, Brian}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (REI)]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (Genetics)]]"}]}}}}