{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"86694": {"pageid": 86694, "ns": 0, "title": "Brooke", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S196x05-23.jpg\n|name = Brooke\n|status = Alive\n|siblings = *[[Joshua]]\n*Vivian\n*Abby\n|parents = *Mother\n*Father\n|other family = *Laura ''(aunt)''\n*Laura ''(niece)''\n*At least one other niece or nephew\n|only appearance = [[Pick Up The Pieces]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 6 (Station 19)|6]]\n|portrayed by = [[Anna Daines]]\n}}\n\n'''Brooke''' is the biological sister of [[Jack Gibson]].\n\n==History==\nAs an adult, Brooke found out that she and her siblings had another brother whom their parents had placed for adoption after they conceived him in high school. Her brother, [[Joshua]], met him, but after an afternoon together, Jack decided he didn't want to get to know the rest of the family.\n\nMonths later, Brooke came to the clinic at [[SFD Station 19|Station 19]] with an envelope. She was mistaken for a clinic patient, so she claimed she was having pain while urinating. [[Dayna Rutledge]] and [[Peggy Knox]] showed her to an exam room and gave her a cup to provide a urine sample. They also shared their experience getting chlamydia in college. At this point, Carina stepped in and directed Brooke to the bathroom.\n\nInstead of going to the bathroom, Brooke stood outside the exam room where Jack was getting checked out by Ben and eavesdropped on their conversation. When Jack left the room, he ran into Brooke. Carina then found her and directed her again to the bathroom.\n\nBrooke's tests for pregnancy and a UTI came back negative. Carina saw that she didn't seem as relieved as women in her position usually were, so she asked if that was the real reason for her visit. Brooke asked, but already knew, if you should respect the boundaries someone has put into place. Then she asked Carina to deliver the envelope she had with her before leaving. The envelope was addressed to Jack and had a note with her number saying that her parents had kept Jack's baby picture.\n\n==Relationships==\n===Familial===\nShe was raised with two sisters and one brother. Her father was a school superintendent and her mom a teacher. When she was an adult, she found out that she had an older brother her parents had placed for adoption when they were in high school. ''(\"[[The Road You Didn't Take]]\")''\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS196x05-22.jpg\nS196x05-23.jpg\nS196x05-25.jpg\nS196x05-35.jpg\n</gallery>\n\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S6 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}