{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"81343": {"pageid": 81343, "ns": 0, "title": "Brother John", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S194x07BrotherJohn.png\n|name = John\n|status = Alive\n|alias = Father Bust-a-Move\n|only appearance = [[Learning to Fly]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 4 (Station 19)|4]]\n|portrayed by = [[John Ales]]\n}}\n\n'''John''' is a charismatic cult leader who jumped off a roof.\n\n==History==\nJohn was lonely and fearful, so he started what he called a family of people who were also lonely. Some time after that, he climbed onto the roof of a building and started a dance. The whole group danced even as firefighters arrived and began to try to get John to come off the roof. While they set up an air bag below him to catch him if he jumped or fell, Jack went up to the roof to talk to John. While they talked, John tried to convince Jack that his way of living was superior and Jack should join them dancing. Jack danced to placate John and keep him from jumping, but eventually, John ended up jumping anyway. Despite landing on the air bag, he was suspected of having internal bleeding and had to be taken to the hospital, where he was expected to recover. After he was on the ground, [[Officer Wicklund]] asked to talk to him, as he had outstanding warrants. Wicklund was told to meet him at the hospital.\n\n==Notes and Trivia==\n*He told Jack he was an orphan.\n\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}