{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51019": {"pageid": 51019, "ns": 0, "title": "Bruce Tanner", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x10-20.jpg\n|name = Bruce Tanner\n|status = Alive\n|marital = [[Pam Tanner]] ''(wife)''\n|children = [[Justin Tanner]]\n|only appearance = [[Just Lose It]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Don McManus]]\n}}\n\n'''Bruce Tanner''' is the father of [[Justin Tanner]].\n\n==History==\nBruce's son, Justin, came into the practice for the first time in three years. Cooper was shocked to see that he had gained a large amount of weight. It had gotten a lot harder for him to move around, especially recently. Cooper weighed him and found that he had gained 282 pounds in three years.\n\nCooper consulted with Naomi and called in Justin's parents to talk about the situation. He had diabetes and high blood pressure. Bruce believed he was just lazy. They'd hired him a trainer and nutritionist and sent him to fat camp. They ruled out hormonal causes for his weight gain. Justin said he didn't want to get any bigger and he didn't feel good. While they were talking, Justin passed out. They took him to the hospital.\n\nHis blood sugar spiked, which caused dehydration. His parents argued over his case. His mother, Pam, said that he was stressed and used the food as comfort while his father said his mother coddled him.\n\nWhen Justin woke up, he told Cooper that he was being molested and that's why he kept eating, because he thought it would stop if he gained enough weight. Cooper angrily went out to the waiting room and punched Bruce, believing he was the abuser. Bruce quickly called a lawyer to sue Cooper and the hospital.\n\nCooper went back to Justin's hospital room and told Bruce he was telling the police what he'd been doing to Justin. Justin then said it wasn't Bruce. It was Pam. Pam tried to comfort him and both Bruce and Cooper told her to back away. Bruce was very angry and asked how she could hurt their son like that. Pam said that Justin loves him. Bruce then tried to attack Pam, but Cooper restrained him and had security called.\n\nNaomi brought in Sheldon to talk to Justin, who said he didn't want to talk about it. He blamed himself for his mom getting arrested. Sheldon said that being fat was his protection. He didn't know how to stop. Bruce came in and apologized for not seeing what Pam was doing to him. Justin said it was okay, but Sheldon told him not to bury his feelings, to tell his father how he really feels. Justin asked how he didn't see it, why he didn't protect him. Bruce said he loves Justin and he failed. He hoped that someday, Justin would forgive him. They hugged.\n\n==Relationships==\n===Romantic===\nHe is married to [[Pam Tanner]]. When he learned she'd been molesting their son, he tried to attack her and had to be restrained.\n\n===Familial===\nWhen he learned his son had been molested, he apologized to him for not seeing it and asked Justin to forgive him.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP4x10-12.jpg\nPP4x10-14.jpg\nPP4x10-18.jpg\nPP4x10-20.jpg\n</gallery>\n\n{{DEFAULTSORT:Tanner, Bruce}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]"}]}}}}