{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"85311": {"pageid": 85311, "ns": 0, "title": "Bryan (The Road You Didn't Take)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S195x17Bryan.png\n|name = Bryan\n|status = Alive\n|marital = [[Jane (The Road You Didn't Take)|Jane]] ''(ex-wife)''\n|children = [[Matt (The Road You Didn't Take)|Matt]]\n|only appearance = [[The Road You Didn't Take]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Ben Bodé]]\n}}\n\n'''Bryan''' is the father of [[Matt (The Road You Didn't Take)|Matt]].\n\n==History==\nBryan's son, Matt, came out to his parents as transgender and told them his new name was Matt. Bryan immediately accepted him and tried to help him, while his mother, Jane, refused to and continuously deadnamed and misgendered him. His parents ultimately divorced over his mother's refusal to accept him and his father was granted sole custody of him. His father took him and moved to Seattle with him, but his mother tracked his phone and came to Seattle with her new husband, where she tried to take Matt back with her. She and Bryan argued over it and a neighbor overheard and called the police to report a domestic disturbance. Crisis One responded and Vic and Theo, along with social worker [[Clarke Wright]], found Bryan and Jane outside yelling at each other. Jane told them that Bryan had kidnapped their child from her house in Florida in the middle of the night and she'd tracked her child's phone to find them. Suddenly, Matt appeared from inside the house and told his mother that his name was Matt. Things heated up when Jane's new husband, [[Randall]], arrived and Matt begged them not to make him go with his mom and Randall. Meanwhile, Clarke and [[Officer Marinis]] established that Bryan had recently been granted sole custody of Matt, meaning he didn't have to go with his mother. Matt went to talk to his dad, but as he did so, his mom grabbed him and forced him into Randall's truck. Then Randall climbed in and attempted to drive away. Vic, Clarke, Theo, and Officer Marinis immediately stepped in to stop him. Matt was returned to his father and Jane and Randall were arrested. Jane told Matt to tell them it was all a mistake, but he just said that he was sad that his mother wouldn't get to know the man he was becoming. Theo suggested that Bryan consider relocating and changing their phones so Jane couldn't find them again, because he knew that she was unlikely to change her mind. They also offered the station's support going forward and Clarke gave them brochures for other resources they could access.\n\n==Relationships==\n===Romantic===\nHe was married to [[Jane (The Road You Didn't Take)|Jane]] until they divorced over her refusal to accept their son after he came out as transgender.\n\n===Familial===\nHe has a son, Matt, whom he supported after Matt came out as trans.\n\n==Notes and Trivia==\n*He and his son live at 778 Mulberry Drive.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS195x17-1.jpg\nS195x17-3.jpg\nS195x17-5.jpg\nS195x17-10.jpg\nS195x17-29.jpg\n</gallery>\n\n{{DISPLAYTITLE:Bryan}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}