{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"86785": {"pageid": 86785, "ns": 0, "title": "Cadet Davila", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Other Characters Infobox\n|image = S196x06CadetDavila.png\n|name = Cadet Davila\n|status = Alive\n|only appearance = [[Everybody Says Don't]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 6 (Station 19)|6]]\n|portrayed by = [[Brianna Reed]]\n}}\n\n'''Cadet Davila''' was one of the camper at Vic's fire camp for girls.\n\n==History==\nVic set up a fire camp for girls to learn about firefighting and practice skills necessary for firefighters to know. They started with a line-up and had each girl introduce herself by her last name, following the firefighters' lead. Then they started learning to use the hoses and fire extinguishers. When a lightning storm got too close to the station, they were forced to move the camp indoors, where they practiced CPR, which they found boring until Ross told them a story of how she used CPR to save a colleague's life while she was serving. They were learning to use chainsaws when [[Enzo Lim]] came up to the barn door. His whole family had been struck by lighting and he'd loaded them into the back of his car and driven them to the station. Vic, Ross, and Jack jumped in to start CPR on them, but they needed additional hands, so they called over some of the girls to help them. They were able to save all three of the family members.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS196x06-1.jpg\nS196x06-10.jpg\nS196x06-11.jpg\n</gallery>\n\n{{DEFAULTSORT:Davila, Cadet}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S6 Characters]]"}]}}}}