{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"76718": {"pageid": 76718, "ns": 0, "title": "Cal", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = S193x04Cal.png\n|name = Cal\n|status = Alive\n|siblings = *[[Jack Gibson]]\n*[[Lila (House Where Nobody Lives)|Lila]]\n|parents = *[[Marco]] †\n*Samantha †\n|only appearance = [[House Where Nobody Lives]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 3 (Station 19)|3]]\n|portrayed by = [[Bodhi Del Rosario]]\n}}\n\n'''Cal''' is Jack's brother, from whom he was separated after their parents died in a house fire.\n\n==History==\n===House Fire===\nIn June 2002, Cal was living in a house with his parents and two siblings, [[Lila (House Where Nobody Lives)|Lila]] and [[Jack Gibson]]. One day, for their parents' anniversary, the kids decided they wanted to make a cake, but they didn't know how to work the oven. Their dad, Marco, found them and lost his temper when he saw Lila with her head in the oven. After he calmed down, he apologized and said parents lose their tempers sometimes, but that didn't mean they'd send the kids away, as Jack suspected might happen. Marco then told them the oven was faulty and they'd buy a cake instead. Then he helped them clean up the kitchen.\n\nLater that night, Jack woke up and saw a fire in the house. He woke up Lila and covered her with a blanket to get her out of the house. Once he got her outside, he ran back inside to find Cal and their parents. He found Cal and carried him outside. When he tried to go back in for their parents, Lila stopped him. Soon afterward, the windows of the house blew out. Shortly afterward, the kids were told that Marco and Samantha had died and each of them was taken by a different social worker. ''(\"[[House Where Nobody Lives]]\")''\n\n===Jack Finding Him===\nJack found him as an adult. He was living in Utah, but didn't remember Jack at all. ''(\"[[Everybody's Got Something to Hide Except Me and My Monkey]]\")''\n\n==Relationships==\n===Familial===\nHe lived with [[Marco]] and Samantha, plus [[Lila (House Where Nobody Lives)|Lila]] and [[Jack Gibson]] until Marco and Samantha died in a house fire. The three children were then separated.\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S3 Characters]]"}]}}}}