{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49841": {"pageid": 49841, "ns": 0, "title": "Carl", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP108Carl.png\n|name = Carl\n|status = Alive\n|alias = Trunk\n|diagnosis = *Anxiety\n*Foreign body in anal cavity\n*Polyembolokoilamania\n|doctors = [[Violet Turner]]\n|treatment = *Talk therapy\n*Extraction\n|only appearance = [[In Which Cooper Finds a Port in His Storm]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 1 (Private Practice)|1]]\n|portrayed by = [[Josh Randall]]\n}}\n'''Carl''' is one of Violet's patients who also flirted with Addison.\n\n==History==\nCarl met Addison while they were both waiting in line to order coffee. He let her cut in line after figuring out she was impatient. After getting his coffee, he went upstairs for a session with Violet. He had anxiety and talked about how he was dealing with it. He told her about meeting Addison and exchanging business cards with her. He said he believed he was ready to try dating again.\n\nHe later called Addison and set up a date that night. On the date, he confessed that he was seeing Violet and believed she'd made him a better man. Their date was then interrupted when Addison got a safe surrender call.\n\nThe next day, Carl came to the practice to bring flowers for Addison. She was sleeping, so he left them with Violet and also said that he felt like he was ready to quit therapy. Violet encouraged him to keep at it, but he was insistent.\n\nViolet later got a call that Carl was in the hospital. She arrived and was told that they were able to extract the body non-surgically. The ER intern then asked if she knew whose shoe it was that Carl had put in his anus. Violet talked to him and he said he didn't mean to steal Addison's shoe. Violet said that this is why he needed to continue therapy. He agreed and asked Violet to talk to Addison. She's great, but he can't trust himself around her shoes.\n\n==Relationships==\n===Romantic===\nHe briefly dated Addison. However, because of his anxiety and his compulsion to stick shoes in his anus, he asked Violet to break things off with her for him.\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S1 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (ER)]]"}]}}}}