{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"85424": {"pageid": 85424, "ns": 0, "title": "Carl Swaminathan", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S195x18CarlSwaminathan.png\n|name = Carl Swaminathan\n|status = Alive\n|children = Sienna\n|job = Truck Driver\n|workplace = Sunderset Logistics\n|only appearance = [[Crawl Out Through the Fallout]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Kurt Yaeger]]\n}}\n\n'''Carl Swaminathan''' is a truck driver who crashed while carrying radioactive materials.\n\n==History==\nCarl was transporting containers of cesium-137 when he crashed and a container of the radioactive material spilled out onto the road. A school bus carrying children on a field trip was also involved in the crash. When station 19 firefighters arrived, Carl warned them not to approach the scene, explaining what he was carrying. He also said his leg was trapped in the truck. While he worked to free himself, the firefighters got to work marking the borders of the safe area as they waited for HAZMAT to arrive to take care of the cesium. Once he was freed, Carl said that he'd be sitting there the whole time, meaning he far exceeded the maximum exposure time for cesium. He didn't claim himself to be a hero, but said that he was happy to shorten his life a bit to make sure all the children and firefighters got to live longer ones. It's what he would want someone to do for his daughter if she were there. So he cleaned up the spilled cesium, then carried the container a safe distance away, so they could begin evacuating the bus. While they worked, HAZMAT arrived and began tending to Carl. He was taken to [[Seattle Presbyterian Hospital]], where they said he was stable, but had third-degree burns to his hands and radiation sickness.\n\n==Relationships==\n===Familial===\nHe has an eleven year old daughter named Sienna who wants to be a scientist.\n\n==Career==\nHe is a truck driver for Sounderset Logistics. As part of his job, he transports hazardous materials.\n\n{{DEFAULTSORT:Swaminathan, Carl}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}