{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"68689": {"pageid": 68689, "ns": 0, "title": "Carla", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S191x08Carla.png\n|name = Carla\n|status = Alive\n|children = Lulu\n|only appearance = [[Every Second Counts]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 1 (Station 19)|1]]\n|portrayed by = [[Annie Tedesco]]\n}}\n'''Carla''' is a woman who was injured when a party bus she was on crashed.\n\n==History==\n[[Susan]], [[Mary (Every Second Counts)|Mary]], and Carla rented a party bus with their friends for a Mom's Day Out. Their driver was overtired and drove the wrong way up an off-ramp and crashed. The women were all ejected from the bus. Mary had an injury to her leg, while Susan was impaled on a piece of the bus and Carla was trapped under the bus. The driver was dead on arrival. Station 19, on their way to the hospital with another patient, stopped to help. They cut the bar that was impaling Susan and then lifted the bus off Carla to free her. They set up a nearby triage, where they treated Mary and the other six women. Mary had an open fracture to her leg and they struggled, but eventually stopped the bleeding. Once Carla was pulled out from under the bus, she crashed, but they were able to resuscitate her. All the women were then taken to the hospital.\n\n==Relationships==\n===Familial===\nShe promised her daughter, Lulu, she'd turn her room into Hogwarts for her birthday.\n\n===Friendships===\nShe is close friends with [[Mary (Every Second Counts)|Mary]] and [[Susan]]. She and Susan are said to be like oil and vinegar, with Mary being the glue that holds them together.\n\n==Notes and Trivia==\n*Her friends say she's late to everything.\n\n==Episode Stills==\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS191x08-25.jpg\nS191x08-30.jpg\nS191x08-33.jpg\nS191x08-35.jpg\nS191x08-38.jpg\nS191x08-40.jpg\nS191x08-43.jpg\n</gallery>\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S1 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}