{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49971": {"pageid": 49971, "ns": 0, "title": "Carley", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP210Carley.png\n|name = Carley\n|status = Alive\n|diagnosis = *Fractured ribs\n*Punctured lung\n*Tension pneumothorax\n*Contusions\n|doctors = *[[Addison Forbes Montgomery]]\n*[[Sam Bennett]]\n|treatment = *Annual wellness exam\n*Aspiration\n|parents = Parents\n|job = Prostitute\n|only appearance = [[Worlds Apart]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Ginny Weirick]]\n}}\n\n'''Carley''' is a patient who was putting herself through college working as a call girl.\n\n==History==\nCarley came into the practice for an annual wellness exam. She was relieved when Addison said she was healthy, because she'd had a greater than usual number of sexual partners. She admitted that she was saving for medical school and she made a lot of money with that work, which she said was easy. She also mentioned that a few of the other girls doing the same thing thought they might have picked something up at a party they went to and asked if they could come see Addison to get tested for STDs. Addison was reluctant, but agreed and gave Carley her personal cell phone number.\n\nThat night, Carley called Addison from her hotel room. When Addison arrived with Sam, she found Carley seriously beaten on the bed. Sam called an ambulance while Addison examined her. She had some broken ribs, one of which punctured her lung. Addison relieved the pressure so she could breathe. Carley was worried that her parents would find out what she'd been doing, so Addison advised her to give the hospital a fake name and pay cash, so they couldn't deny her care.\n\nAddison later visited Carley in the hospital and said that this was the life she'd chosen for herself and she couldn't be Carley's doctor anymore because of that choice.\n\n==Career==\nCarley worked as a call girl to save money for medical school.\n\n==Notes and Trivia==\n*She wants to go to medical school.\n*She was in room 201 at the Grand Camden Hotel when she was attacked.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP2x10-1.jpg\nPP2x10-4.jpg\nPP2x10-9.jpg\nPP2x10-10.jpg\n</gallery>\n\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (Trauma)]]\n[[Category:Patients (ER)]]"}]}}}}