{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52484": {"pageid": 52484, "ns": 0, "title": "Carl Davis", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP5x21CarlDavis.png\n|name = Carl Davis\n|status = Alive\n|marital = Wife †\n|children = [[Troy Davis]] †\n|only appearance = [[Drifting Back]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Private Practice)|5]]\n|portrayed by = [[John M. Jackson]]\n}}\n\n'''Carl Davis''' is the father of [[Troy Davis]].\n\n==History==\nCarl's son, Troy, who had a history of cardiomyopathy, came into the ER unable to breathe. When they said they needed to put him on a ventilator so he could keep breathing, his partner, Roger, said that Troy didn't want that and just to let him go. However, before they could comply, Carl came in and asked them to keep Roger away from Troy. Carl hadn't seen Roger Troy in five years because he didn't accept his son's relationship with Roger, whom he insisted was simply Troy's roommate. Carl decided he wanted them to do whatever possible to keep Troy alive, including putting him on a ventilator. They hadn't filled out the paperwork making Roger his medical proxy because they thought they had more time, so when Carl said Roger had to leave, he had no choice.\n\nDespite being ordered to stay away, Roger decided to sneak in after Carl left and sit by Troy's bedside to hold his hand and talk to him.\n\nCarl was told that Troy's cardiac function was still declining despite the ventilator. Sam said that they could do more to help him, but it would only prolong the inevitable and Troy was going to die. He asked Carl why he was doing all this, despite knowing what Troy wanted and how much he loved Roger. Carl talked about Troy's childhood and how close they were. He believed Roger had manipulated Troy. Sam said that he believed Roger really loved Troy and didn't want to lose him, so he must be honoring Troy's wishes. Carl still decided to have Sam continue extraordinary care.\n\nRoger brought to the hospital printed pages from Troy's computer journal saying he didn't want to be hooked up to machines. However, Pete said it wasn't a legal document and they couldn't honor it.\n\nDespite this, Pete allowed Roger to go into Troy's hospital room to say goodbye before turning off the machines. Roger stayed by his side, holding him while he took his last breaths and telling him how he wanted more time with him and he loved him.\n\nCarl attacked Pete when he learned Troy had died, saying Pete had killed him. Pete said that Troy was gone and forced Carl to face the fact that his son wasn't coming back. Carl wondered what he had done.\n\n==Relationships==\n===Romantic===\nHis wife died when their son was young.\n\n===Familial===\nHe was close with his son, Troy, due to the early death of Troy's mother. They remained close until Troy told his father he was gay. They remained estranged until Troy's death.\n\n{{DEFAULTSORT:Davis, Carl}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]"}]}}}}