{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50720": {"pageid": 50720, "ns": 0, "title": "Carl (Second Choices)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP320Carl.png\n|name = Carl\n|status = Alive\n|diagnosis = Heart blockage\n|doctors = *[[Amelia Shepherd]]\n*[[Sam Bennett]]\n|treatment = Bypass surgery\n|marital = [[Lucia]] ''(wife)''\n|children = Expecting\n|workplace = US Army\n|only appearance = [[Second Choices]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Aaron Ashmore]]\n}}\n\n'''Carl''' is a soldier who had a heart blockage that threatened to take him out of active duty.\n\n==History==\nCarl came into the practice with his wife, Lucia, who was pregnant. He had passed out on the toilet and hit his head, so Addison referred him to Amelia to get checked out. He was on leave for three weeks so he could be home when the baby was born. He admitted that sometimes, he got dizzy. His EKG showed that there might be a problem with his heart.\n\nLucia confessed that she wanted them to find something wrong, something that would keep him out of the Army because she was worried about him dying.\n\nSam reviewed Carl's cardiac CTs and found a serious blockage in his artery. He believed Carl was a candidate for a stent, but Addison suggested drug therapy instead, so that he could get discharged.\n\nSam brought Lucia and Carl in to talk to them about their options. Lucia believed the surgery was too risky, but Carl said that he has guys who depend on him to stay alive. Lucia said that she and the baby depend on him too. Carl said he still wanted the surgery, because he was a soldier and wanted to go back.\n\nAs he went into surgery, he said that he knew he should be there for his wife and child, but he felt a responsibility to go back to service.\n\nIn surgery, Sam said that his vessels were more clogged than he thought. The stent might not hold. He used bypass instead, which would permanently take him out of the Army.\n\nAfter the surgery, Sam told Carl he wouldn't be able to return to active duty. Carl was upset because that's not what he wanted.\n\n==Relationships==\n===Romantic===\nHe is married to [[Lucia]].\n\n===Familial===\nHe and his wife are expecting their first child.\n\n==Career==\nHe is a member of the US Army.\n\n{{DISPLAYTITLE:Carl}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Cardio)]]\n[[Category:Patients (Neuro)]]"}]}}}}