{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51222": {"pageid": 51222, "ns": 0, "title": "Casey", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x18-20.jpg\n|name = Casey\n|status = Alive\n|diagnosis = *Pregnancy\n*Placental abruption\n|doctors = *[[Sheldon Wallace]]\n*[[Violet Turner]]\n|treatment = *Talk therapy\n*C-section delivery\n|children = Ben\n|parents = [[Terri (The Hardest Part)|Terri]]\n|only appearance = [[The Hardest Part]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Vanessa Marano]]\n}}\n'''Casey''' is one of three girls who made a pact to get pregnant together in high school.\n\n==History==\nCasey's mother, Terri, [[Pam (The Hardest Part)|Pam]], and [[Ricky]] were in talk therapy with Sheldon and Violet because their three daughters, Casey, [[Lisa (The Hardest Part)|Lisa]], and [[Jamie]] had made a pact to get pregnant together in high school.\n\nThe three daughters also came in to have talk therapy together, to try to explain why they'd done it. Casey said she didn't think she should worry about good grades or college when all she wanted was to be a mom, Jamie said it was instant status, and Lisa said babies love you no matter what. There's a lot going on at her house, so her mother can't give them all attention all the time.\n\nRicky came in late to their joint session. She'd told Jamie she needed to pick up her brother, but she came back with Violet's book, saying Violet wasn't the right therapist for their daughters. She took Jamie and left.\n\nSheldon and Violet took Casey and Lisa to tour the hospital. Casey and Lisa by that point had read Violet's book and made several comments about it. Violet started to fight back, but Casey started having serious abdominal pain and bleeding. She was rushed in for an emergency c-section. Lisa watched as Casey's baby was delivered and said it wasn't what she expected and left.\n\nCasey held her baby after his birth. Lisa had not come back. Jamie called and said she was giving her baby up for adoption. She felt her friends had abandoned the pact. Casey said her mom had only come by to criticize her and yell. She wondered how she'd do it on her own because she was totally alone. Sheldon told her she wasn't alone, she had Ben. She said she was scared and Sheldon said they could work on that.\n\n==Relationships==\n===Familial===\nHer mother tried to force her to have an abortion. After her son was born, her mother showed up only to criticize and yell at her.\n\n===Friendships===\nShe and her friends Jamie and Lisa made a pact to get pregnant together. However, after Casey's baby was born, Jamie and Lisa both backed out of the original plan.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP4x18-16.jpg\nPP4x18-30.jpg\n</gallery>\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (MFM)]]"}]}}}}