{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"84013": {"pageid": 84013, "ns": 0, "title": "Cathi", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = 18x07-28.jpg\n|name = Cathi\n|status = Alive\n|job = Actor\n|only appearance = [[Today Was a Fairytale]]\n|seasons = '''[[Grey's Anatomy|GA]]:''' [[Season 18 (Grey's Anatomy)|18]]\n|portrayed by = [[Kahyun Kim]]\n}}\n\n'''Cathi''' is an actor whose production was interrupted by an accident.\n\n==History==\nCathi was acting in a fairytale theater production of Rapunzel when the actor playing the prince, [[Jeremy (Today Was a Fairytale)|Jeremy]], fell while climbing the prop hair and injured himself. Cathi called into the audience for help and Jo and Link responded. Cathi told them Jeremy had a heart condition and retrieved a nearby AED for them. She continued to assist them, even taking over chest compressions, until they were able to restore sinus rhythm with the epinephrine from some EpiPens collected from the audience. Cathi came to the hospital, where she asked Jo to get an update for her as they wouldn't tell Cathi anything. Jo was able to find out that he was in surgery. After his surgery was over, Teddy and Link told her Jeremy would make a full recovery, though he'd need a pacemaker.\n\n==Relationships==\n===Friendships===\nShe and [[Jeremy (Today Was a Fairytale)|Jeremy]] are close friends. She describes them as family.\n\n==Career==\nShe is an actor with a traveling fairytale theatre production of Rapunzel in which she plays the witch. She and [[Jeremy (Today Was a Fairytale)|Jeremy]] had been doing it for six years.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\n18x07-26.jpg\n18x07-28.jpg\n</gallery>\n\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S18 Characters]]"}]}}}}