{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"2194": {"pageid": 2194, "ns": 0, "title": "Charlotte King", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = PP6x04-11.jpg\n|name = Charlotte King\n|status = Alive\n|alias = *canyouhandleme441\n*Charlie\n*Char\n*Cruella\n*Herr Charlotte\n*Satan\n*The Wicked Witch of St. Ambrose\n*Big Bad Bitch Charlotte\n|title = M.D.\n|marital = *[[Billy Douglas]] ''(ex-husband)''\n*[[Cooper Freedman]] ''(husband)''\n|children = *[[Mason Warner]] ''(stepson)''\n*[[Georgia King-Freedman]]\n*[[Caroline King-Freedman]]\n*[[Rachel King-Freedman]]\n|siblings = *[[Duke King]]\n*[[Landry King]]\n|parents = *[[\"Big Daddy\" King]] †\n*[[Augusta King]]\n|other family = *Buster Hodges ''(uncle)''\n*[[Lawrence Freedman]] ''(father-in-law)''\n*[[Myra Freedman]] ''(mother-in-law)''\n*Andy Freedman † ''(brother-in-law)''\n|job = *[[Chief of Staff]]\n*[[Sexology|Sexologist]]\n*[[Attending]] [[Urology|Urologist]]\n|workplace = '''Current'''<br>[[St. Ambrose Hospital]]<br>[[Seaside Health and Wellness]]\n'''Former'''<br>[[Oceanside Wellness Group]]<br>[[Pacific Wellcare Center]]\n|first appearance = [[In Which We Meet Addison, a Nice Girl From Somewhere Else]]\n|last appearance = [[In Which We Say Goodbye]]\n|count = 110\n|seasons = '''[[Private Practice|PP]]:''' [[Season 1 (Private Practice)|1]], [[Season 2 (Private Practice)|2]], [[Season 3 (Private Practice)|3]], [[Season 4 (Private Practice)|4]], [[Season 5 (Private Practice)|5]], and [[Season 6 (Private Practice)|6]]\n|portrayed by = [[KaDee Strickland]]\n}}\n{{Quote|Here's some free advice. Kindergarten's over. Training wheels are off. Nobody's gonna catch you if you fall. If you don't like your life, you do something about it. You reach down, you pull one foot out of the mud, then the other. You walk away from it. You can't walk, you crawl. You do something. Join a gym. Join a club. Join a cult. Do something, anything. What you don't do is whine to me about it.|[[Charlotte King]]}}\n\n'''Charlotte King''' is the [[Chief of Staff]] and [[Attending|attending]] [[Urology|urologist]] at [[St. Ambrose Hospital]]; additionally, she is a [[Sexology|sexologist]] at [[Seaside Health and Wellness]]. She is married to [[Cooper Freedman]] with whom she has four kids: [[Mason Warner]], and [[Georgia King-Freedman|Georgia]], [[Caroline King-Freedman|Caroline]], and [[Rachel King-Freedman]].\n\n==History==\n===Early Life===\nShe is from Monroeville, Alabama.\n\nGrowing up, she was told, by her father, how sweet she was for taking care of her younger brothers.\n\nWhen she was fifteen, she had to shoot her horse Marjorie after it sprained its ankle. Marjorie was her last pet and when she thought she might have been pregnant, she thought about naming the baby Marjorie.\n\nShe always wanted to make her father, Big Daddy, proud, so she became a doctor.\n\n===Marriage to Billy===\nCharlotte met [[Billy Douglas]], with whom she eventually married. At one point, she came home from the hospital after work and found him in bed with another woman. Charlotte lost her self control and dragged the woman off her husband and jumped Billy, yelling at him. The woman then grabbed a vase and smashed it on Charlotte's head, knocking her out. Billy called 911, but left before the paramedics arrived. Charlotte couldn't forgive him for what happened, ending the marriage<ref>[[If I Hadn't Forgotten...]], 5x06 (PP)</ref>.\n\n===Drug Addiction===\nFollowing the attack, Charlotte became addicted to the pain medication. She tried to get her colleague, who treated her after the attack, to write her another prescription, but he was aware of the dangers of addiction. She tried to convince him saying she'd know when to stop as a doctor, but he only offered to write her a prescription for pills with a lighter effect. She declined and left.\n\nSome time later, drugged after a shift, Charlotte was driving her car through a storm. She began to fall asleep at the wheel and deviated from her lane. She didn't notice the car approaching in the opposite direction, causing the other driver to have to get out of the way, slipping and crashing into a pole. The crash brought Charlotte back to her senses. She pulled over and went to help the woman, but the woman had flown through her windshield. Charlotte called 911, but the woman didn't make it. The truth about the accident was never uncovered, as the woman was deemed a careless driver for not wearing a seat belt and Charlotte never told the truth.\n\n===Starting to Date Cooper===\nCooper and Charlotte first started dating after meeting on a sex site. They didn't expect the person they'd agreed to meet to be each other, but they agreed to give it a shot. Their relationship started out with just being \"Friends with Benefits,\" but Cooper wanted it to be more. Charlotte wasn't open to that until she realized that she was falling in love with Cooper. The two were on and off after Charlotte admitted to having sex with [[Archer Montgomery]]. Cooper forgave her, but then they got into another argument when Cooper found out Charlotte was the new owner of the competing clinic right below Oceanside Wellness. They eventually made up.\n\n===Building a New Practice===\nAfter telling Cooper that she had become more of an administrative position at St. Ambrose and less of a doctor, she took a job interview. She had been recruited to run the [[Pacific Wellcare Center]] on the newly leased fourth floor of the building that also housed [[Oceanside Wellness Group]]. Charlotte kept this from Cooper, but was found out by Violet. Violet agreed to keep the secret so that Charlotte had the chance to come clean about it to Cooper. After giving her several chances, Charlotte did not tell Cooper and so Violet confronted Cooper. Cooper became very angry that Charlotte was running an opposing medical practice in his building and they broke up.\n\n===Joining the Practice===\nAfter William White fired Charlotte from her position at Pacific Wellcare Center, she approached Sam for a position at Oceanside Wellness Group and explained why she was a good hire for the practice. Sam and Addison had a conversation about it, and eventually decided to hire her. She moved into Pete's old office and practiced as a [[Sexology|sexologist]].\n\n===Rape===\nIn [[St. Ambrose Hospital]] as [[Chief of Staff]], she told a noisy patient to wait his turn. However, that man had mental problems. He thought that women had to respect him and because Charlotte was mean to him, he assaulted her later that day. Getting ready to go home, Charlotte left her office in the hospital. When she turned around after having closed the door, the man knocked her head against the door and dragged her back into her office.<ref>[[All in the Family]], 4x06 (PP)</ref>\n\nShe tried to resist and scratched the assaulter, which only enraged him more. He continued punching her eventually raped her in her own office. Shortly after, she left her office, bruised and bleeding. She hobbled to the nearest supply closet to get some bandages, but Pete Wilder, who was working in the ER that night, noticed her. He followed her and caught her when she fell down. He carried her into a room in the hospital.\n\nCharlotte chose not to tell anyone that she was raped and even hurt badly, she continued bossing everyone at the hospital around. She only allowed nurse Sheila in her room, not any of the \"nosy bitchy ones\" and the doctors from the practice. However, Addison didn't buy the story that the assaulter took her wallet and she asked everyone to leave the room. When they were alone in the room, Charlotte came clean to Addison. She told her that she was raped. Addison did a pelvic exam and tried to pursue Charlotte to report the assault, but Charlotte refused. However, Addison secretly did a rape kit and kept it in the hospital under the name of Jane Doe, thinking Charlotte might want the assaulter's DNA later.<ref>[[Did You Hear What Happened to Charlotte King?]], 4x07 (PP)</ref>\n\nSome time later, Charlotte returned to work, but she still hadn't fully recovered yet. Upon entering her office, she started getting flashbacks of the assault and she went to the practice instead. Her colleagues there tried to act normal around her, but they all failed to do so. Sheldon was the only one who actually left her alone like she wanted them to. Pete came into her office to check on her wounds, reminding Charlotte of the rape and she almost started crying in front of him. Violet offered to help her too, but Charlotte refused, saying it was impossible for Violet to know what she was going through. She also completely shut out Addison, because Addison saw her at her most fragile point. Amelia offered her donuts and said she was going to meetings for addicts. She also talked to her about craving to pills after something terrible happened, but Charlotte denied she was craving for pills.\n\nAddison eventually told Sam that Charlotte was raped. On his turn, he asked Violet to talk to Charlotte without actually saying that she was raped. However, Violet suspected something and talked to Pete, who suspected the same. When talking with Violet in his office about the night Charlotte was assaulted, Sheldon said he was in the police office talking to a rapist. Seeing the way Violet reacted to the word \"rapist\", he asked her if Charlotte was raped. Violet said she also suspected that Charlotte was raped.\n\nCooper told Charlotte he simply couldn't leave her alone after what happened. This seemed to help her deal with it a little bit better, as she dared to enter her office again shortly after, without having flashbacks. Violet later came to Charlotte's office, and she started talking about the time she was raped herself, leaving Charlotte devastated. She went to Amelia's office and asked her to go to a meeting with her, admitting she was craving pills. Meanwhile, Addison made calls to have the pelvic washings from Charlotte processed.<ref>[[What Happens Next]], 4x08 (PP)</ref>\n\n===Amelia's Slip and Meeting Mason===\nWhen Erica Warner showed up at the practice claiming that Cooper was the father of her son, Cooper was delighted and immediately believed her. Charlotte was more cautious. At first, she approached Erica and paid her money to leave Cooper alone. Erica took the money, but only to give it back to Cooper as that was not what she was after. She wanted to disappear from his life, but Cooper convinced her he had nothing to do with it. Charlotte later realized that she crossed a line, but she only did so to protect her family. She did a paternity test behind Cooper's back, which revealed that Mason was indeed his son.\n\nErica then allowed Cooper to come visit his son, but didn't allow Charlotte be near him, so Charlotte kept her distance. Over time, Erica came to realize that Charlotte had meant no harm and she noticed that Mason had grown to like Charlotte, and vice versa. She then allowed Mason to spend the night at Cooper and Charlotte's, and Mason and Erica progressively became part of their family.\n\n===Erica's Brain Tumor and Becoming a Mother===\n===Pregnancy and Childbirth===\nCharlotte was frustrated when she discovered she was pregnant. While she had happily accepted being Mason's mother, she was not interested in having more kids. She then became horrified upon finding out that she was expecting triplets. While abortion was not an option for her because of her faith, she did hope for a miscarriage in the early stages of the pregnancy. That didn't happen and the family began to prepare for the three new additions.\nAddison had to sew up Charlotte's cervix after she had one of the babies prematurely at only twenty-six weeks.\n\n==Personality==\nGenerally, the character has served as somewhat of a foil to the other doctors at [[Oceanside Wellness Group]], often impeding their progress in helping patients through somewhat unorthodox methods by applying and enforcing legal, medical and ethical implications. However, while being treated for insomnia, Charlotte revealed that she has trouble connecting with others because signs of affection were discouraged in her family. She later became less obstructive and the relationship with [[Cooper Freedman|Cooper]] somewhat humanized her..\n\n==Relationships==\n===Romantic===\n====[[Billy Douglas]]====\nAt Oceanside Wellness, Charlotte told a patient that she married her first love and they had a fairy tale-like relationship. However, she caught him in their bed having sex with another woman. She couldn't forgive him for that, and they broke up.\n\nBefore Charlotte married Cooper, she talked with Billy about their marriage. It turned out Billy was gay and cheated on her because he wanted to know if he'd feel different with another woman, but he said he didn't.\n\n====[[Cooper Freedman]]====\nMuch later, she started up a relationship with Cooper Freedman after meeting through an internet dating service. They stayed together for a while, but after they broke up, she began to feel sick which made Cooper think that she was pregnant. After he convinces Charlotte that she might be pregnant, she takes a pregnancy test and while they are waiting for the results, they begin to think of names and when they see that the test came back negative, Charlotte tries to get back together with Cooper, but he refuses.\n\nFollowing the death of her father, Cooper goes with her and comforts her and they eventually get back together, but Charlotte dislikes Cooper living with Violet and they argue over that. Charlotte creates another roadblock in their relationship when she sleeps with [[Archer Montgomery]] and is caught by [[Addison Forbes Montgomery|Addison]], but Cooper sees this as a sign of her pushing him away, and he forgives her. Eventually, Charlotte begins to bond with Violet over Cooper and her pregnancy, but eventually they part ways when she reveals that she slept with [[Archer Montgomery]] and Violet tells her, professionally and personally, that it's not okay that she did that. Charlotte and Cooper stay together and eventually have a [[Something Old, Something New|Vegas wedding]].\n\nHer relationship with Cooper took kind of a blow when she found out that Cooper has a son and Charlotte tried to pay Mason's mother to leave them alone, but they eventually reconciled. Charlotte developed motherly feeling for Mason when it became clear that his mother would die.\n\nCharlotte became pregnant with triplets which both she and Cooper refer to as the 'Cooplets'. Charlotte went into premature labor and [[Life Support|delivered the first triplet]], whom they later named Georgia. Two months later, [[Full Release|she delivered the last two triplets]]. Because she named Georgia, Mason named the second baby Caroline, and Cooper chose Rachel for the third.\n\n====[[Sheldon Wallace]]====\nCharlotte and Sheldon started sleeping together after Charlotte and Cooper broke up. She stated to [[Amelia Shepherd|Amelia]] that the rumors about Sheldon's penis are true. She used sex with Sheldon to cover up the pain of her and Cooper's break up. Sheldon eventually realized this and broke it off with Charlotte, advising her to pursue Cooper since she was still in love with him. Sheldon and Charlotte remained friends and he gave her advice on how to be friends with Cooper and how to eventually get him back. Sheldon stopped the elevator with Addison in it to tell her that he loved Charlotte. He couldn't stop thinking about her and kept going to her office to borrow postage stamps even though he paid his bills online.<ref>[[In the Name of Love]], 3x22 (PP)</ref>\n\n====[[Archer Montgomery]]====\nCharlotte had a sexual affair with Archer in his office at [[Pacific Wellcare Center]]. Charlotte did this to hurt Cooper, because she was afraid of their growing relationship and wanted it to blow up in her face.\n\n===Friendships===\n====[[Amelia Shepherd]]====\n====[[Naomi Bennett]]====\n\n==Career==\nDr. King is a graduate of [[Johns Hopkins Medical School]] and is the [[Chief of Staff]] at [[St. Ambrose Hospital]] in [[Santa Monica]].\n\nShe also opened a rival practice, [[Pacific Wellcare Center|Pacific Wellcare]] located on the fourth floor of the same building as the Oceanside Wellness Group.<ref>[[Know When to Fold]], 2x09 (PP)</ref> The owner of the practice, [[William White]], fired Charlotte as director of Pacific Wellcare and hired Naomi to replace her. His reasoning was that good leaders have a heart, and not only capable of attracting and hiring quality doctors.<ref>[[Yours, Mine & Ours]], 2x22 (PP)</ref>\n\nFollowing the revelation that [[Cooper Freedman|Cooper]] is broke and that the remaining staff at the [[Oceanside Wellness Group]] are looking to buy Naomi's share of the business, Charlotte gives [[Addison Forbes Montgomery|Addison]] and [[Sam Bennett|Sam]] a check for Cooper's share, as well as a blank check for her to buy into the practice.<ref>[[Pushing the Limits]], 3x04 (PP)</ref> After much debate between Addison and Sam, including Charlotte confronting Sam, Sam and Addison decided to hire Charlotte as a new member of staff at Oceanside Wellness.<ref>[[Strange Bedfellows]], 3x05 (PP)</ref>\n\nCharlotte moved into Pete's old office after his move to the rival practice, offering sexology as her specialty. Charlotte had had that idea for a long period of time. She hired a web designer to build her a website that allows her to offer advice, as well as provide consultations by email and book appointments to see her.\n\n==Notes and Trivia==\n*There is an inconsistency in where Charlotte graduated from medical school. In Private Practice promotional material, it claims she is a Yale graduate, whereas Cooper claims she is a Johns Hopkins graduate. It's possible that she attended Yale for medical school and completed her residency at [[Johns Hopkins Hospital]].<ref>[[Homeward Bound]], 2x12 (PP)</ref>\n*Charlotte has neonatal rounds at [[St. Ambrose Hospital]], which she has asked [[Addison Forbes Montgomery|Addison]] to cover for her when she returned home to see her father.<ref>[[Homeward Bound]], 2x12 (PP)</ref> Since [[Chief of Staff]] is a bureaucratic and administrative role, it is assumed that these rounds are part of her duties as a [[Urology|urologist]] at St. Ambrose, indicating that Charlotte practices pediatric urology.\n*Charlotte is the only character of the original main characters of ''Private Practice'' to never appear in a ''[[Grey's Anatomy]]'' episode. She has, however, visited [[Seattle Grace Mercy West Hospital]].<ref>[[You Break My Heart]], 5x15 (PP)</ref>\n*Charlotte was revealed to be a [[Surgery|surgeon]] in \"[[Strange Bedfellows]]\", specializing in [[Urology|urology]], electing sexology as a new specialty to practice at Oceanside Wellness.\n*[[Pete Wilder]] was her work husband. He brought her coffee and waited for her so they could get lunch together.\n**After Pete died, Violet gave his stethoscope to Charlotte.\n*Charlotte loves fried chicken.\n*Her least favorite meal of the day is breakfast.<ref>[[Life Support]], 6x08 (PP)</ref>\n*Charlotte has a slight fear of needles.\n*She likes to read, her favorite book being \"''[http://en.wikipedia.org/wiki/To_Kill_a_Mocking_Bird To Kill a Mocking Bird]''\". It was written by Harper Lee, who is from the same town as Charlotte, Monroeville.\n*\"[[In Which Sam Gets Taken for a Ride]]\" is the only ''[[Private Practice]]'' episode in which Charlotte doesn't appear.\n*[[Mason Warner|Mason]] calls her Mama.\n*She is in NA and allergic to local anesthetic.<ref>[[Did You Hear What Happened to Charlotte King?]], 4x07 (PP)</ref>\n*She loves to drink martinis, which is why she knows how to make extremely good martinis.\n*The password for her computer at St. Ambrose was \"Big Daddy\". Although unconfirmed, it's assumed that she changed it after Cooper used it break into her computer.\n*She sometimes refers to her children as \"Rugrats\".\n*She's allergic to cats.\n*She snores.<ref>[[In Which Charlotte Goes Down the Rabbit Hole]], 1x06 (PP)</ref>\n\n==Gallery==\n<gallery widths=\"150\" position=\"center\" orientation=\"landscape\" bordersize=\"none\" spacing=\"small\" hideaddbutton=\"true\">\nPP106CharlotteKing.png\nPP218CharlotteKing.png\nPP4x16CharlotteKing.png\nPP6x09CharlotteKing.png\n</gallery>\n\n{{GalleryLink}}\n\n==Notable Episodes==\nThese episodes are Charlotte-centric or are otherwise very informative about her life.\n*[[In Which Charlotte Goes Down the Rabbit Hole]]\n*[[Homeward Bound]]\n*[[Did You Hear What Happened to Charlotte King?]]\n*[[What Happens Next]]\n*[[Can't Find My Way Back Home]]\n*[[Blind Love]]\n*[[Something Old, Something New]]\n*[[...To Change the Things I Can]]\n*[[Aftershock]]\n*[[Georgia on My Mind]]\n*[[Full Release]]\n\n==Memorable Quotes==\n:'''[[Cooper Freedman|Cooper]]:''' Sure thing, Charlie.\n:'''Charlotte:''' You call me that again... You will be hobbling down that aisle! <ref>[[What We Have Here...]], 4x19 (PP)</ref>\n----\n: '''Charlotte:''' I don't like people. It's rare that someone comes along I can even tolerate.<ref>[[Two Steps Back]], 4x15 (PP)</ref>\n----\n:'''[[Pete Wilder|Pete]]:''' People need connection to stay healthy, positive connection with another human.\n:'''Charlotte:''' I don't--I don't need your pity positivity. I don't know what Violet told you, but I connect. Okay?\n:'''[[Pete Wilder|Pete]]:''' Yeah, when?\n:'''Charlotte:''' None of your business--\n:'''[[Pete Wilder|Pete]]:''' Business. Right. Maybe I'm not the guy to help you. Maybe you need someone--\n:'''Charlotte:''' Who I can't irritate? Find that man for me and I'll marry him. My family didn't believe in displays.\n:'''[[Pete Wilder|Pete]]:''' Of affection?\n:'''Charlotte:''' My mother, there was the occasional sloppy kind that followed cocktails.\n:'''[[Pete Wilder|Pete]]:''' And since then?\n:'''Charlotte:''' Who has time for that kind of thing?\n:'''[[Pete Wilder|Pete]]:''' I'm sorry, Charlotte. Do you want to try again?\n:'''Charlotte:''' Why not? My hair's already shot.<ref>[[In Which Charlotte Goes Down the Rabbit Hole]], 1x06 (PP)</ref>\n==Appearances==\n{{Charlotte King Appearances}}\n{{Scrollbox}}\n\n[[fr:Charlotte King]]\n[[de:Charlotte King]]\n\n{{DEFAULTSORT:King, Charlotte}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S1 Characters]]\n[[Category:PP S2 Characters]]\n[[Category:PP S3 Characters]]\n[[Category:PP S4 Characters]]\n[[Category:PP S5 Characters]]\n[[Category:PP S6 Characters]]\n[[Category:Doctors]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (MFM)]]\n[[Category:Patients (CAM)]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (Trauma)]]\n[[Category:Patients (Ortho)]]\n[[Category:Patients (General)]]\n[[Category:Patients (ID)]]"}]}}}}