{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"78487": {"pageid": 78487, "ns": 0, "title": "Charlie Irwin", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Firefighter Infobox\n|image = S193x12CharlieIrwin.png\n|name = Charlie Irwin\n|status = Alive\n|job = Firefighter\n|workplace = '''Former'''<br>\n[[Seattle Fire Department]]\n|first appearance = [[I'll Be Seeing You]]\n|last appearance = [[Nothing Seems the Same]]\n|count = 2\n|seasons = '''[[Station 19|S19]]:''' [[Season 3 (Station 19)|3]] and [[Season 4 (Station 19)|4]]\n|portrayed by = [[Reginald Veljohnson]]\n}}\n\n'''Charlie Irwin''' is a retired firefighter who worked with Pruitt.\n\n==History==\n===Pruitt's Death===\nCharlie, [[Captain Lawrence]], and [[Snuffy Souza]] came to Station 19 with Pruitt to tell stories to the current team and play cards. When part of the team was called out to free people trapped in a storage unit, they grabbed the radio and listened to see how well trained the team was. They discussed every call any of them made, as the call progressed from trapped civilians to a fire. When they heard over the radio that several firefighters became trapped in the storage facility and were running out of air, Pruitt abruptly got up and left. They continued to listen to the radio and heard that Pruitt was going up to ventilate the roof, knowing that once he did, he would fall into the fire. Lawrence told Irwin to prepare to sound the 20 bells. Irwin pointed out that Pruitt was retired, but Lawrence countered that dying ventilating a roof sure sounds like firefighting. Irwin sounded the bells.\n\n===Pruitt's Funeral===\nCharlie attended Pruitt's funeral, which was streamed online due to safety regulations concerning the coronavirus pandemic. ''(\"[[Nothing Seems the Same]]\")''\n\n==Career==\nHe was a firefighter with the Seattle Fire Department. He worked with Pruitt when Pruitt was a rookie. At some point in his career, he did a water rescue during a hurricane and ended up doing CPR on a kitten.\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nS193x12CharlieIrwin.png|[[I'll Be Seeing You]]\nS194x01CharlieIrwin.png|[[Nothing Seems the Same]]\n</gallery>\n\n==Appearances==\n{{Charlie Irwin Appearances}}\n\n{{DEFAULTSORT:Irwin, Charlie}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S3 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:Firefighters]]"}]}}}}