{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49874": {"pageid": 49874, "ns": 0, "title": "Charlie Jensen", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP202CharlieJesnsen.png\n|name = Charlie Jensen\n|status = Alive\n|marital = Wife †\n|children = [[Kirk Jensen]] †\n|only appearance = [[Equal and Opposite]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Tom Amandes]]\n}}\n\n'''Charlie Jensen''' is the father of [[Kirk Jensen]].\n\n==History==\nCharlie came into the practice with his son, Kirk, who had a terminal lung virus. He hadn't been very compliant with his meds. At the practice, Kirk stopped breathing, so he was taken to the hospital and intubated. When he woke up, he pulled the tube out of his throat and said he didn't want to be intubated. He knew the tracheotomy was next and didn't want that. He asked Sam to let him die.\n\nCharlie later called Sam to the hospital to ask him to put the tube back into Kirk's throat. Sam did so under pressure from Charlie. In order to keep Kirk from pulling the tube out again, they restrained him.\n\nSam later went back to the hospital and told Charlie that he wouldn't want to force someone he loved to live a life they couldn't deal with. Charlie agreed to let Sam remove the tube and he stayed with Kirk as he died.\n\n==Relationships==\n===Romantic===\nHe was married until his wife died.\n\n===Familial===\nHis son, Kirk, had a terminal illness. He was in denial about Kirk's imminent death and tried to insist that Sam prolong Kirk's life as much as possible, even when Kirk said that he wanted to die.\n\n==Career==\nHe runs a company. He made a deal with the practice to get all his employees executive physicals.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP2x02-7.jpg\nPP2x02-13.jpg\nPP2x02-17.jpg\n</gallery>\n\n{{DEFAULTSORT:Jensen, Charlie}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]"}]}}}}