{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"84677": {"pageid": 84677, "ns": 0, "title": "Charlotte Marsh", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = CharlotteMarshIB.png\n|name = Charlotte Marsh\n|status = Alive\n|parents = Erica Marsh\n|grandparents = *Grandmother\n*Grandfather\n|other family = [[Nick Marsh]] ''(uncle)''\n|only appearance = [[The Makings of You]]\n|seasons = '''[[Grey's Anatomy|GA]]:''' [[Season 18 (Grey's Anatomy)|18]]\n|portrayed by = [[Anna Grace Barlow]]\n}}\n\n'''Charlotte Marsh''' is the niece of [[Nick Marsh]], who raised her.\n\n==History==\nCharlotte came to her uncle's cabin with her boyfriend, [[Silver]], and found her uncle on the couch making out with [[Meredith Grey]]. They all had a meal together and Silver revealed that they were planning to go to Costa Rica in two weeks. Charlotte then had to tell Nick she was leaving school. This upset Nick, who was insistent that Charlotte finish school. They argued over it.\n\nCharlotte went to Meredith and asked her to talk to Nick. Meredith said that Charlotte reminded her of herself, only braver. Charlotte insisted she wasn't rebelling. She just wanted some change. and to figure out how she wanted to live her life. Meredith encouraged Charlotte to talk to Nick herself.\n\nNick tried to persuade Charlotte to stay in school so she wouldn't end up like her mother. Charlotte said that she wasn't her mother and she just needed to figure some things out. Charlotte reminded him of how responsible she already was because of how good a job he'd done raising her. She promised him she'd go back to school, but she needed to go on this trip first.\n\nAt the end of the night, Charlotte and Silver left after Charlotte promised to come back the next weekend and give Nick all the information about her trip so he'd know where she was.\n\n==Relationships==\n===Romantic===\nShe is dating [[Silver]]. They met in the woods when Charlotte was participating in one of his micro-dosing sessions and said they felt like they had known each other for lifetimes.\n\n===Familial===\nShe was raised by her uncle, [[Nick Marsh]], after her mother left her.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\n18x12-3.jpg\n</gallery>\n\n[[de:Charlotte Marsh]]\n\n{{DEFAULTSORT:Marsh, Charlotte}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S18 Characters]]"}]}}}}