{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"68337": {"pageid": 68337, "ns": 0, "title": "Charlotte Dearborn", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Firefighter Infobox\n|image = S191x06-24.jpg\n|name = Charlotte Dearborn\n|status = Alive\n|alias = Wednesday\n|title= Lieutenant\n|job = Fire Lieutenant\n|workplace = [[Seattle Fire Department|SFD]] Station 12\n|first appearance = [[Stronger Together]]\n|last appearance = [[Not Your Hero]]\n|count = 2\n|seasons = '''[[Station 19|S19]]:''' [[Season 1 (Station 19)|1]]\n|portrayed by = [[Jee Young Han]]\n}}\n'''Charlotte Dearborn''' is a fire lieutenant who was up against Jack and Andy for the Captain position.\n\n==History==\n===The Incinerator===\nCharlotte was one of the high scorers among the applicants for Captain. When she went for her practical test, she was grouped with Andy, Jack, and [[Cole Edmonds]] and each of them took a turn acting as captain as they went into a fire, put it out, and rescued a 200-pound dummy. Cole went first and immediately put the two women back to cover himself and Jack. He spoke derogatorily to both of them. When the time came to retrieve the dummy, he had himself and Jack go in, instead of sending one of the smaller women through a tighter area. Charlotte was not amused by his attitude.\n\nCharlotte's turn was next. Charlotte sent Andy past the fire, over Andy and Jack's protest that it was against policy. Charlotte then ran through some fire herself. Andy found the dummy, but ended up trapped behind the fire. The others arrived and put out the flames. Once they were out with the dummy, Charlotte was told she broke a record. When Andy called her out on her dangerous methods, Charlotte said Andy wouldn't get the best from her team by coddling them.\n\nDuring Jack's turn, they quickly extinguished the fire and then began the search for the dummy. They did two whole sweeps of the building, but didn't find the dummy, so Jack made the decision to leave without it. After exiting, he learned that there was no dummy and that was part of his test.\n\nAndy went last and due to additional smoke coverage, she had the team crawl, staying close together and constantly talking to keep track of each others. The ceiling started creaking as they crawled and gave way over Cole, knocking him out. They dug him out and called in a mayday. They were told to get out, but Andy sent the others out with Cole and decided to continue the search for the dummy herself. Jack stayed behind with her and the two of them got the dummy while Charlotte went out with Cole. ''(\"[[Stronger Together]]\")''\n\n===Skyscraper Fire===\nCharlotte had her final interview for the captain position with Chief Ripley. As she exited the room, she was called to respond to the fire at a skyscraper in downtown Seattle. She was asked if she wanted to tap out because she'd been there for hours, but she declined and went back to the fire with station 19. She jumped through a fire to close a fire door, but was hit by a falling vent. Andy jumped through after her and used an extinguishing sphere to put out the flames and allow the others to come with her and pull the vent off Charlotte. Charlotte wanted to continue, but she was injured, so Andy took her down to triage for treatment. ''(\"[[Not Your Hero]]\")''\n\n==Relationships==\n===Romantic===\nShe had a one-night stand with [[Maya Bishop]] as part of the latter's self-care routine. ''(\"[[Not Your Hero]]\")''\n\n==Career==\nShe is a fire lieutenant at [[Seattle Fire Department]] Station 12. She was a candidate for the Captain position at [[SFD Station 19|Station 19]] but that position ultimately went to [[Robert Sullivan]].\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nS191x06CharlotteDearborn.png|[[Stronger Together]]\nS191x10CharlotteDearborn.png|[[Not Your Hero]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS191x06-1.jpg\nS191x06-2.jpg\nS191x06-3.jpg\nS191x06-4.jpg\nS191x06-5.jpg\nS191x06-11.jpg\nS191x06-12.jpg\nS191x06-14.jpg\nS191x06-15.jpg\nS191x06-17.jpg\nS191x06-18.jpg\nS191x06-19.jpg\nS191x06-23.jpg\nS191x06-24.jpg\nS191x06-25.jpg\nS191x06-27.jpg\nS191x06-30.jpg\nS191x06-31.jpg\nS191x06-32.jpg\nS191x06-33.jpg\nS191x06-34.jpg\nS191x06-35.jpg\n</gallery>\n\n==Appearances==\n{{Charlotte Dearborn Appearances}}\n\n[[es:Charlotte Dearborn]]\n\n{{DEFAULTSORT:Dearborn, Charlotte}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S1 Characters]]\n[[Category:Firefighters]]"}]}}}}