{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52831": {"pageid": 52831, "ns": 0, "title": "Charles", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Other Characters Infobox\n|image = PP6x12-15.jpg\n|name = Charles\n|status = Alive\n|job = Owner\n|workplace = Skylight Books\n|only appearance = [[Full Release]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 6 (Private Practice)|6]]\n|portrayed by = [[Faran Tahir]]\n}}\n'''Charles''' owns a bookstore Violet went to.\n\n==History==\nWhen the remaining two triplets were being born, Violet went to a bookstore to buy a present. She selected some books and then asked Charles to use them to make a gift basket. He recognized her as the author of Beautiful Scars and asked her to sign his copy of the book. He told her she had a light in her eyes and was beautiful. He asked her about her husband and was told he had died. Violet then left quickly and said she'd come back later to pick up the books.\n\nWhen Violet returned, she picked up the basket, which he'd filled out with extra books. He said he felt bad for making Violet feel sad. He invited her out to get coffee, but she said she couldn't go out with him. It wasn't him. She was trying to get okay with being her by herself. He then proposed that they could be friends. As she went to leave, she told him she was writing another book, something she'd just decided with his help. He wished her good luck.\n\n==Relationships==\n===Romantic===\nWhile Violet was buying books at his bookstore, Charles flirted with her and she flirted back. When she returned, he asked her out, but she declined.\n\n==Career==\nHe owns Skylight Books.\n\n==Notes and Trivia==\n*He'd read Violet's book five times.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP6x12-1.jpg\nPP6x12-2.jpg\nPP6x12-15.jpg\nPP6x12-20.jpg\n</gallery>\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S6 Characters]]"}]}}}}