{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"81473": {"pageid": 81473, "ns": 0, "title": "Charlie (Station 19)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S194x09Charlie.png\n|name = Charlie\n|alias = Lebowski\n|status = Alive\n|first appearance = [[Make No Mistake, He's Mine]]\n|last appearance = [[No One is Alone]]\n|count = 2\n|seasons = '''[[Station 19|S19]]:''' [[Season 4 (Station 19)|4]]\n|portrayed by = [[Zach Villa]]\n}}\n\n'''Charlie''' is a man who repeatedly overdosed.\n\n==History==\nCharlie was driving and doing drugs. He ended up passed out with his foot depressing the brake. He was discovered when the aid car from 19 drove by with another patient. They stopped and Travis stayed behind to treat him. He was unable to rouse Charlie by banging on the windows, so he broke one of the windows and climbed in. When he still wasn't able to rouse Charlie, he administered naloxone, which woke Charlie up and caused him to lift his foot off the brake, allowing the car to roll forward onto Theo Ruiz's foot. When Charlie heard the screaming, he pressed the brake, causing the car to stop on top of Theo's foot. After a moment, he learned what he'd done and freed Theo's foot. He was then loaded in to the aid car from station 15 and taken to the hospital. ''(\"[[Make No Mistake, He's Mine]]\")''\n\nThree days later, Charlie overdosed again. Travis and Vic revived him with naloxone in his apartment and then took him to the hospital, where they learned it was his third overdose within a month. His friend, [[Libby]], said he was about to quit drugs and go to rehab. After Charlie was taken to the hospital, Libby herself overdosed. They revived her and took her to the hospital, but she quickly left, overdosed again, and died in the park, slumped against a tree. Charlie was heartbroken when he checked himself out of the hospital and learned that Libby had died. He got and used drugs himself, but didn't overdose. Travis and Vic took him to the hospital again. On the way, he talked to Libby over the broken phone and told her he needed to stop using drugs. ''(\"[[No One is Alone]]\")''\n\n==Relationships==\n===Friendships===\nHe and [[Libby]] were friends from seventh grade until she died. ''(\"[[No One is Alone]]\")''\n\n==Notes and Trivia==\n*He lived at 2020 East Yesler Way.\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nS194x08Charlie.png|[[Make No Mistake, He's Mine]]\nS194x09Charlie.png|[[No One is Alone]]\n</gallery>\n\n==Appearances==\n{{Charlie Appearances}}\n\n{{DISPLAYTITLE:Charlie}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}