{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"86228": {"pageid": 86228, "ns": 0, "title": "Chase Sams", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = 19x02ChaseSams.png\n|name = Chase Sams\n|status = Alive\n|diagnosis = *Meningicoccus\n*Septic shock\n*DIC\n*Bilateral pleural effusions\n|doctors = *[[Meredith Grey]]\n*[[Richard Webber]]\n*[[Teddy Altman]]\n*[[Atticus Lincoln]]\n*[[Simone Griffith]]\n*[[Jules Millin]]\n*[[Mika Yasuda]]\n*[[Lucas Adams]]\n*[[Benson Kwan]]\n|treatment = *High-flow oxygen\n*Pressors\n*Below the knee amputation\n|parents = *Mother\n*Other parent\n|only appearance = [[Wasn't Expecting That]]\n|seasons = '''[[Grey's Anatomy|GA]]:''' [[Season 19 (Grey's Anatomy)|19]]\n|portrayed by = [[Nolan Gould]]\n}}\n\n'''Chase Sams''' is a college student who thought he had food poisoning and ended up in the ICU.\n\n==History==\nChase and his college roommate came into the ER with what they believed was food poisoning they got from eating leftover fried rice. They both vomited several times while they waited to be seen by a doctor. [[Simone Griffith]] and [[Jules Millin]] examined them and then planned to start IV fluids to combat the dehydration from the vomiting, but Chase started to struggle to breathe. They examined him further and found a rash on his abdomen. They paged Richard and Meredith, who examined him even more closely and found that the rash was also on his arms and legs. Meredith ordered a chest x-ray and then said to admit him to the ICU on high-flow oxygen. In the ICU, he became completely unresponsive and the rash continued to spread. Meredith intubated him and put him on pressers, which stabilized him, but he started bleeding around his central line. At this point, Meredith challenged the interns to work together to diagnose him. Meanwhile, Link examined his leg and found that the tissue was dead, so it would have to be amputated below his knee. While was in surgery, Simone realized he had meningococcus.  He had some unexpected bleeding in surgery, but they were able to get it under control and his friend was told he'd be okay.\n\n==Relationships==\n===Familial===\nHis parents are divorced. His mother got on a flight to Seattle when she learned he was in the hospital.\n\n===Friendships===\nHe is close friends with his roommate. His roommate was an only child with social anxiety who didn't want a roommate, but Chase helped him come out of his shell and meet new people.\n\n==Notes and Trivia==\n*He plays Barn Finders.\n*He was 19 at the time of his hospitalization.\n*He's from Massachusetts.\n*He's a history major, loves sports documentaries, and hates coffee.\n*He once had syphilis.\n\n{{DEFAULTSORT:Sams, Chase}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S19 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Cardio)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (General)]]\n[[Category:Patients (Ortho)]]"}]}}}}