{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"15251": {"pageid": 15251, "ns": 0, "title": "Christopher Shepherd", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PP522BabyShepherd.png\n|name = Christopher Shepherd\n|status = Deceased\n|alias = Unicorn Baby\n|siblings= [[Scout Derek Shepherd Lincoln]] ''(half-brother)''\n|parents = *[[Amelia Shepherd]]\n*[[Ryan Kerrigan]] †\n|grandparents = *[[Carolyn Shepherd]]\n*[[Mr. Shepherd]] †\n|other family = *[[Derek Shepherd]] † ''(uncle)''\n*[[Nancy Shepherd]] ''(aunt)''\n*[[Meredith Grey]] ''(aunt)''\n*[[Kathleen Shepherd]] ''(aunt)''\n*[[Liz Shepherd]] ''(aunt)''\n*[[Zola Grey Shepherd]] ''(cousin)''\n*[[Derek Bailey Shepherd]] ''(cousin)''\n*[[Ellis Shepherd]] ''(cousin)''\n*[[Lucas Adams]] ''(cousin)''\n*13 additional cousins\n|only appearance = [[Gone, Baby, Gone]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Private Practice)|5]]\n}}\n{{Quote|My life has turned into a horror show and all I can do is stand back and watch it play out. My baby has no brain. No brain. I'm a damn neurosurgeon and my baby has no brain. I'd say God has a sense of humor but there is no God. No God would do this.|'''[[Amelia Shepherd|Amelia]]''' describing her feelings over her pregnancy.}}\n\n'''Christopher Shepherd''' was the child of [[Ryan Kerrigan]] and [[Amelia Shepherd]].\n\n==History==\n===Conception and Diagnosis===\nChristopher Shepherd was conceived by [[Amelia Shepherd]] and [[Ryan Kerrigan]] while they were on drugs. Amelia didn't know she was pregnant, as she thought the symptoms were withdrawal symptoms. However, it became clear when she took a pregnancy test. ''(\"[[Andromeda]]\")''\n\nAt first, Amelia refused to have an ultrasound, but she later agreed to let Addison do it. While doing it, Addison revealed to Amelia the baby was a boy, but she suddenly turned the screen away because the baby turned out to be anencephalic (he had no brain). Amelia then fired Addison as her OB and denied herself and her baby prenatal care. However, when [[Jake Reilly|Jake]] brought up that prenatal care was important for both the baby and the mother, she hired him as her doctor.\n\nUpon dealing with a brain dead patient, Amelia decided to donate her baby's organs to save multiple other babies all over the country. ''(\"[[And Then There Was One]]\")''\n\n===Birth===\nWhen Amelia went into labor, she first told Jake. She was then taken to [[St. Ambrose Hospital]]. A transplant team was composed because of Amelia's wish to donate the baby's organs, but Sam, the only cardiothoracic surgeon in the hospital who was allowed to harvest organs from babies, initially refused to do it. He refused because it was murder in his opinion, as the baby could not be legally declared brain dead because of a functioning brain stem. However, if they'd waited for the baby to die first, the organs wouldn't have been viable anymore, which was why the harvesting had to take place not long after birth. [[Amelia Shepherd|Amelia]] first didn't want to see her baby, but once he was born, she wanted to see her son. She referred to him as the \"most beautiful baby in the world.\"\n\nThe lawyers of the hospital also didn't agree with Amelia's plan. However, seeing Amelia in the hospital room, Charlotte said they would do the surgery. A conversation with Addison and Charlotte's actions also encouraged Sam to take place in the transplant team. His organs were harvested and transported for use. ''(\"[[Gone, Baby, Gone]]\")''\n\n==Notes and Trivia==\n*He lived for 43 minutes.<ref>[[All I Could Do Was Cry]], 11x11</ref>\n*His mother told him he wouldn't be alone after he died because his father was waiting for him.<ref>[[Gone, Baby, Gone]], 5x22 (PP)</ref>\n*He was referred to as [[Amelia Shepherd|Amelia's]] \"Unicorn Baby\" because when she was 12, she loved unicorns because they are magical and can do good things because her child would travel the country and do great things and her baby was the magic in other families' lives.\n*His kidneys went to San Diego and Sacramento. Another abdominal organ, presumably his liver, went to Boston. His heart went to Chicago.\n*He was mentioned twice by his mother to [[Owen Hunt]] during the 11th season of Grey's Anatomy. The first time after [[April Kepner]] and [[Jackson Avery]] lost their son to osteogenesis imperfecta type II, and after [[Derek Shepherd|Derek's]] death when she said all the men she'd ever loved died.\n*In season 15 of Grey's Anatomy Amelia said that losing him was one of the reasons she and Owen broke up. She was afraid that having another baby would lessen his memory.\n*He was also mentioned by Amelia when she found out that she was pregnant with [[Scout Derek Shepherd Lincoln]] and she explained her situation to Link.<ref>[[Back in the Saddle]], 16x02</ref>\n\n{{Scrollbox}}\n\n[[de:Christopher Shepherd]]\n\n{{DEFAULTSORT:Shepherd, Christopher}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]\n[[Category:Deceased Characters]]\n[[Category:Patients]]\n[[Category:Patients (Neonatal)]]\n[[Category:Patients (Transplant)]]"}]}}}}