{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"71067": {"pageid": 71067, "ns": 0, "title": "Clark", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S192x06Clark.png\n|name = Clark\n|status = Alive\n|children = Son\n|only appearance = [[Last Day on Earth]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 2 (Station 19)|2]]\n|portrayed by = [[Troy Winbush]]\n}}\n\n'''Clark''' is a man who fell in a canyon while hiking.\n\n==History==\nClark was hiking alone and fell. Despite being injured, he had to crawl a distance in order to get a phone signal to call for help. When Andy and Maya arrived, they saw no sign of him, so they had his phone call patched to their radios and asked him to describe what he could see around him. That wasn't helpful, but they heard music. He was listening to a playlist his son made him to calm himself down. They asked him to turn it up and then followed the sound of the music to find him. They set up their equipment so they could go up and down with him. Then they assessed his injuries. They believed they needed air evacuation, so Maya tried to call for it, but had no signal. So they started to tend to his injuries in the valley. They splinted his leg and then put him on a stretcher and hauled him up and out. Once they were out, they were able to get medevac to take him to the hospital.\n\n==Relationships==\n===Familial===\nHe didn't want to worry his son, who was taking his SATs that morning, so he didn't call him.\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S2 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}