{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"85309": {"pageid": 85309, "ns": 0, "title": "Clarke Wright", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Other Characters Infobox\n|image = S195x17ClarkeWright.png\n|name = Clarke Wright\n|status = Alive\n|job = Social Worker\n|workplace = [[Seattle Fire Department#Crisis One|Crisis One]]\n|first appearance = [[The Road You Didn't Take]]\n|count = 3\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]] and [[Season 6 (Station 19)|6]]\n|portrayed by = [[Ritesh Rajan]]\n}}\n\n'''Clarke Wright''' is a social worker and new member of Crisis One.\n\n==History==\n===Custody Dispute===\nClarke met Theo and Vic at 778 Mulberry Drive and informed them that a neighbor had called in a domestic dispute. They found [[Jane (The Road You Didn't Take)|Jane]] and [[Bryan (The Road You Didn't Take)|Bryan]] arguing over their child. Jane told them Bryan had come to her house in Florida and taken their child in the middle of the night. She'd tracked their child's phone to find them. Suddenly, the child appeared and said his name is [[Matt (The Road You Didn't Take)|Matt]], contrary to what Jane had said. Bryan told them that Matt had come out to them a few years prior and while Bryan accepted him and helped him, Jane refused and continued to deadname him, which led to their divorce. Then [[Randall]], Jane's new husband, arrived and Matt begged them not to make him go back. Clarke investigated and found that Bryan had recently been granted full custody of Matt. However, when Matt went to talk to his dad, Jane and Bryan grabbed him and forced him into Randall's truck and prepared to drive away. Clarke, along with Vic, Theo, and Officer Marinis, stopped them from leaving. Jane and Randall were arrested and Matt was returned to his father. Jane tried to get Matt to tell them it was all a mistake, but Matt just said he was sad his mother wouldn't get to know the man he was becoming. Clarke then gave Matt and Bryan informational brochures for resources they could access. ''(\"[[The Road You Didn't Take]]\")''\n\n===Dixons===\nClarke later accompanied Ben and Maya when they went to the Dixons home after a neighbor called to complain about them fighting. When they learned that Dixon had left, Clarke stood guard outside in case he returned while Ben and Maya talked to Kitty. When he did return, he forced his way inside and insisted everything was okay. Kitty and Dixon fought some more, leading to Kitty throwing a vase at her husband's head, cutting his forehead. Despite this, they both insisted they were fine, so Clarke wrote up the incident report and the three of them left. ''(\"[[Dancing With Our Hands Tied]]\")''\n\n===Raphael===\nClarke responded to a parking structure when mall staff called Crisis One to report [[Raphael]] on the roof, drinking and acting erratically. Andy and Clarke tried to talk to him and convince him to come down, but they were unable to get him safe until they learned he was needed at another scene to save eight workers at his battery plant who were trapped. Hearing that his people were in trouble startled him and he moved too suddenly, slipping off the edge. Sullivan, who was in a harness, dove and caught him. Clarke then helped Andy lower them to the next floor, where Andy pulled them to safety. ''(\"[[Pick Up The Pieces]]\")''\n\n==Career==\nClarke is a social worker and he's also a volunteer member of Crisis One.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS195x17-1.jpg\nS195x17-2.jpg\nS195x17-7.jpg\nS195x17-8.jpg\nS195x17-10.jpg\nS195x17-28.jpg\nS195x17-29.jpg\n</gallery>\n\n==Appearances==\n{{Clarke Wright Apperances}}\n\n{{DEFAULTSORT:Wright, Clarke}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 S6 Characters]]"}]}}}}