{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50321": {"pageid": 50321, "ns": 0, "title": "Cody", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP311Cody.png\n|name = Cody\n|status = Alive\n|diagnosis = *Broken arm\n*Staph infection\n|doctors = [[Cooper Freedman]]\n|treatment = *Casting\n*Antibiotics\n|siblings = Maddy †\n|parents = *[[Andrea (Another Second Chance)|Andrea]]\n*Father †\n|only appearance = [[Another Second Chance]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Nathan Gamble]]\n}}\n'''Cody''' is a patient of Cooper's whose mother is a hoarder.\n\n==History==\nCooper did a house call to Cody's house when Cody called him because the skin under his cast was itching. Cooper was shocked to find that Cody's mom was a hoarder and had things piled everywhere in their house. Cooper removed his cast and talked to Cody about his mother's hoarding. Cooper watched her put the cast he'd cut off into her bag. He told her that Cody needed to go the hospital because he had a skin infection.\n\nCody had a staph infection, so he was admitted to the hospital for treatment. He called in Violet to work with Andrea on the hoarding. She talked to Violet about the thing she kept and why and admitted that things were easier when his father was alive. His father had died three years prior.\n\nCooper said that Violet had three days and then he was calling DCFS. Violet went to Andrea's house and they worked more on addressing her hoarding. Violet then went to Cody and asked if he had someone else he could stay with, so that they could work on cleaning up his house. He said that he takes care of his mom and they can't be apart because it would be like when his dad and sister died. They ran off the road in Latigo Canyon while she was with him for the week. Cody hadn't gone because he was sick.\n\nWhen Cooper found out that Andrea had taken Cody home, he called DCFS. Violet talked to Andrea, saying that if they showed they were making progress, DCFS would work with them to keep Cody in her home. Violet took a bag and held it so that Andrea could start filling it. She said she couldn't. Violet told her it wasn't filling the void. What happened was unthinkable. Violet started asking extremely difficult questions and Andrea confessed that she believed it was her fault. She then started throwing things out of the house as Cody and Violet watched.\n\n[[Ellie Farraday]], a social worker, arrived as Andrea started to cry about what she'd lost.\n\n==Relationships==\n===Familial===\nHis dad and sister died three years prior, which started a downward spiral into hoarding in his mother.\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Peds)]]\n[[Category:Patients (Ortho)]]"}]}}}}