{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"68338": {"pageid": 68338, "ns": 0, "title": "Cole Edmonds", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Firefighter Infobox\n|image = S191x06-9.jpg\n|name = Cole Edmonds\n|status = Alive\n|title = Lieutenant\n|job = Fire Lieutenant\n|workplace = [[Seattle Fire Department|SFD]] Station 7\n|only appearance = [[Stronger Together]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 1 (Station 19)|1]]\n|portrayed by = [[Brad Beyer]]\n}}\n\n'''Cole Edmonds''' is a fire lieutenant who was up against Andy and Jack for Captain.\n\n==History==\nCole was one of the high scorers among the applicants for Captain. When he went for his practical test, he was grouped with Andy, Jack, and [[Charlotte Dearborn]] and each of them took a turn acting as captain as they went into a fire, put it out, and rescued a 200-pound dummy. Cole went first and immediately put the two women back to cover himself and Jack. He spoke derogatorily to both of them. When the time came to retrieve the dummy, he had himself and Jack go in, instead of sending one of the smaller women through a tighter area.\n\nCharlotte's turn was next. Charlotte sent Andy past the fire, over Andy and Jack's protest that it was against policy. Charlotte then ran through some fire herself. Andy found the dummy, but ended up trapped behind the fire. The others arrived and put out the flames.\n\nDuring Jack's turn, they quickly extinguished the fire and then began the search for the dummy. They did two whole sweeps of the building, but didn't find the dummy, so Jack made the decision to leave without it. After exiting, he learned that there was no dummy and that was part of his test.\n\nAndy went last and due to additional smoke coverage, she had the team crawl, staying close together and constantly talking to keep track of each others. The ceiling started creaking as they crawled and gave way over Cole, knocking him out. They dug him out and called in a mayday. They were told to get out, but Andy sent the others out with Cole and decided to continue the search for the dummy herself. Jack stayed behind with her and the two of them got the dummy while Charlotte went out with Cole.\n\n==Career==\nHe is a fire lieutenant at [[Seattle Fire Department]] Station 7.\n\n==Gallery==\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS191x06-3.jpg\nS191x06-5.jpg\nS191x06-6.jpg\nS191x06-9.jpg\nS191x06-10.jpg\nS191x06-11.jpg\nS191x06-12.jpg\nS191x06-14.jpg\nS191x06-15.jpg\nS191x06-18.jpg\nS191x06-19.jpg\nS191x06-30.jpg\nS191x06-31.jpg\nS191x06-32.jpg\nS191x06-33.jpg\nS191x06-34.jpg\nS191x06-35.jpg\n</gallery>\n\n{{DEFAULTSORT:Edmonds, Cole}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S1 Characters]]\n[[Category:Firefighters]]"}]}}}}
