{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"81478": {"pageid": 81478, "ns": 0, "title": "Condola Vargas", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Other Characters Infobox\n|image = S194x08-11.jpg\n|name = Condola Vargas\n|status = Alive\n|alias = Dola\n|job = Litigator\n|first appearance = [[Make No Mistake, He's Mine]]\n|last appearance = [[Forever and Ever, Amen]]\n|count = 3\n|seasons = '''[[Station 19|S19]]:''' [[Season 4 (Station 19)|4]]\n|portrayed by = [[Khalilah Joi]]\n}}\n\n'''Condola Vargas''' is a lawyer who is helping Dean fight the police.\n\n==History==\nAfter being falsely arrested after saving [[Jada Williams|Jada]] and [[Shanice]], Dean decided he was going to fight the police department so no one else would ever have to go through what he went through and what Jada and Shanice and their mothers did. He first called his sister and then Condola, an ex-girlfriend, to get her help. She came to Dean's place and she asked him what he wanted. When he said justice, she said that didn't mean anything and he needed to think about specifically what he wanted.\n\nLater, he called her with Ben, Sullivan, and Vic around him and said he wanted to make sure the officers were punished for what they'd done and that nothing like that would ever happen again. Dola told him that deciding that was the easy part and now the hard work would begin. ''(\"[[Make No Mistake, He's Mine]]\")''\n\nDola made it clear to Dean that the lawsuit would ruffle feathers within the fire department, which he knew and accepted. ''(\"[[I Guess I'm Floating]]\")''\n\nWhen the police department offered a settlement, Dola encouraged Dean to take it, saying it's what Joyce wanted and the purpose of the lawsuit was to give Joyce a voice. After some consideration, Dean agreed to take the settlement, recognizing that the money and the public apology would help Joyce. ''(\"[[Forever and Ever, Amen]]\")''\n\n==Relationships==\n===Romantic===\nShe once dated [[Dean Miller]]. It didn't end well, but they have established a friendly relationship. ''(\"[[Make No Mistake, He's Mine]]\")'' When she was finished helping him sue the police department, she kissed him, hoping to rekindle their romance, he told her he was in love with someone else and she correctly guessed that that someone was Vic. She thanked him for being honest with her. ''(\"[[Forever and Ever, Amen]]\")''\n\n===Friendships===\nShe and [[Yemi Miller]] went to law school together.\n\n==Career==\nShe is a litigator who graduated from Yale Law summa cum laude. She spent three years working at the Washington State Attorney General's Office.\n\n==Notes and Trivia==\n*She was first in her class at Yale.\n*She was the editor of the Yale Law Review.\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nS194x08CondolaVargas.png|[[Make No Mistake, He's Mine]]\nS194x13CondolaVargas.png|[[I Guess I'm Floating]]\nS194x16CondolaVargas.png|[[Forever and Ever, Amen]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS194x08-9.jpg\nS194x08-10.jpg\nS194x08-11.jpg\n</gallery>\n\n==Appearances==\n{{Condola Vargas Appearances}}\n\n{{DEFAULTSORT:Vargas, Condola}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S4 Characters]]"}]}}}}
