{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"84919": {"pageid": 84919, "ns": 0, "title": "Detective Berarducci", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Police Officer Infobox\n|image = S195x15-13.jpg\n|name = Detective Berarducci\n|status = Alive\n|title = Detective\n|job = Homicide Detective\n|workplace = Seattle Metropolitan Police Department\n|only appearance = [[When the Party's Over]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Steven Culp]]\n}}\n\n'''Officer Berarducci''' is a homicide detective who investigated Andy's involvement in the death of [[Jeremy Benanti]].\n\n==History==\nWhen [[Jeremy Benanti]] died as a result of Andy punching him in response to him assaulting her, Detective Berarducci and his partner, [[Detective Chen]], came to the station to question Andy. Andy spoke to them, telling them that she had hit Jeremy because he assaulted her first. Then she ran to the station, where she sent Maya, Vic, and Sullivan to treat Jeremy. Their questioning became more aggressive to the point where Andy said any additional questions could be directed at her lawyer. They told Beckett they needed to interview Maya, Vic, and Sullivan, but Beckett told them if they wanted to interview any members of his team, they needed to put a former request in through the department and until then, they needed to leave his station.\n\nThe next morning, Chen and Berarducci returned to the station and arrested Andy.\n\n==Career==\nHe is a homicide detective for the Seattle Metropolitan Police Department.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS195x15-11.jpg\nS195x15-12.jpg\nS195x15-13.jpg\nS195x15-14.jpg\n</gallery>\n\n{{DEFAULTSORT:Berarducci, Detective}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:Police Officers]]"}]}}}}