{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"78135": {"pageid": 78135, "ns": 0, "title": "Diane Lewis", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Firefighter Infobox\n|image = S195x04-14.jpg\n|name = Diane Lewis\n|status = Alive\n|alias = DeeDee\n|title = Ph.D.\n|marital = Ex-husband\n|children = Three children\n|job = '''Current'''\n*Psychologist\n**Trauma Specialist\n**Grief Counselor\n'''Former'''\n*Smokejumper\n|workplace = '''Current''' <br>[[Seattle Fire Department]]\n'''Former''' <br>Unknown SFD Station\n|first appearance = [[Something About What Happens When We Talk]]\n|last appearance = \n|count = 6\n|seasons = '''[[Station 19|S19]]:''' [[Season 3 (Station 19)|3]], [[Season 4 (Station 19)|4]], and [[Season 5 (Station 19)|5]]\n|portrayed by = [[Tracie Thoms]]\n}}\n'''Diane Lewis''' is a psychologist who works for the [[Seattle Fire Department]]. \n\n==History==\n===Rape===\nHer family owns and runs an Irish Pub. She worked there as a teen until she was raped in the backroom at the age of 17, after which she didn't want to go back there.\n\n===Accident===\nDiane had a bad drop out of a helicopter, which left her with a shattered leg. Her team was then forced to rescue her, which cost them the ability to save a family's house and their dog, Aldo. While she waited to be rescued, she could hear Aldo barking and said that based on the way he was barking at the end, she knew it wasn't the smoke that got him. She heard the barking persistently after that, until someone came to her bedside and made her start talking and the barking started to get quieter. Since her leg never fully recovered, she learned how to counsel people who had been through a trauma like she had.\n\n===Counseling Station 19===\nDiane came to station 19 after the death of [[Rigo Vasquez]]. The team was disinterested in talking to her, but they were all forced to. She first spoke to Jack, who was struggling because he believed he'd caused Rigo's death. She asked Jack to think about why he continued to sleep with Eva after learning she was Rigo's wife. He talked about his childhood and a call from last Christmas, where he put out a woman's tree and realized that she didn't have any family or friend around. She had only the tree, which burned down. When Jack started crying, she encouraged him not to wipe away the tears, but to let them all out. He later asked her again why she thought he broke the code and she told him that trauma was the pattern he learned to live in. due to his childhood. She reminded him that his family at the station was still alive, and said he needs to name and heal the trauma or he'd end up reliving it. She then told him that that's not why Rigo died. Rigo died because he didn't follow orders. She also gave him her card in case he needed to reach out more.\n\nNext, she spoke to Andy, who was angry at Jack for breaking the code, Maya for putting him in the field with Rigo, and Sullivan for promoting Maya over her. She then talked about her history of dancing, particularly salsa, and then admitted that she was in love with Sullivan and felt electric when she was around him. Diane told her that love isn't electric. It's when it's combined with rule-breaking that it feels like that. When Diane asked if she and Rigo were friends, she said she barely knew Rigo.\n\nDiane went next to Travis, who asked to be allowed to continue making food for Eva while they talked. She allowed it even though it was a public space, but when he expressed frustration that Emmett was closeting himself to please his father, she told him he was allowed to discuss his private business in the public space, but not anyone else's. Travis then switched to code to express how Emmett did what his father wanted instead of what was best for himself, including becoming a firefighter in the first place. Diane pointed out how brave he was to be an openly gay firefighter himself how he might be the only one. When he told her a story about saving a woman while he was on a date and dressed as Dr. Frank N. Furter, she further applauded his bravery, though he brushed it off. She asked who gave him so much shame to carry that he had to pretend that his bravery was just other people being cowards. Travis started to cry and claimed it was about Rigo's death.\n\nShe next spoke to Ben and they talked about changing careers in the middle of their lives. She shared her experience being married to a firefighter to get him to understand his wife better. He expressed that he felt he was wicked, which is why God had Bailey have a miscarriage, because Bailey is righteous. Diane asked him about the angriest he'd ever been and he shared the story of being pulled over by a cop and forced to lie facedown on the ground. He admitted to plotting a few revenge fantasies, but then just reported the behavior to the Chief of Police and City Council, and also donated money to the ACLU. Diane told him he wasn't wicked, he was righteous.\n\nDiane then went to talk to Dean, but found him in the gym with Vic. He asked to talk in there, saying he could say anything in front of Vic. Diane allowed it because her gut told her he had something to say that he wanted Vic to hear and wouldn't say it if she weren't there. He talked about Pru and how his parents cut him off, both financially and emotionally. He was raised to have a lot of pride for being Nigerian, but now is failing to meet his parents' expectations in multiple ways. He then addressed Vic, saying he believed she sabotaged her relationship with Jackson because she felt guilty for moving on so fast after Ripley, and that she should make things right with him. Vic then told Diane that her best friend in high school was a 90-year-old man who lived in her grandmother's assisted-living facility. Long after her grandmother didn't recognize her anymore, she visited him and they would talk and play games. After he died, she cried for a while then made a new best friend. And she didn't feel guilty because making a new best friend saved her from the unbreakable pain of losing him. She was upset for Dean for thinking she sabotaged her relationship with Jackson due to guilt. After Vic left the room, Diane told Dean she knew he was in love with Vic and cautioned him to be careful not to tell her too soon because he could blow the whole thing.\n\nFinally, Diane went to Maya, who asked how they were doing as a house. Maya admitted that she was beating herself up over the decision to put them in the field together, but Diane said that wasn't her team's narrative. They didn't blame her. She then told Diane about Eyes Forward, which was drilled into her very young, to keep looking at the goal. It made her start to think of death as an escape, a time when she could finally sleep in and rest and love in peace. Diane told her she could learn to do all those things in life instead of waiting for death to free her. ''(\"[[Something About What Happens When We Talk]]\")''\n\n===Andy's Dream===\nAfter Pruitt's death, Andy had a dream which included Dr. Lewis telling her that she didn't need Pruitt anymore because she wasn't a baby. ''(\"[[Dream a Little Dream of Me]]\")''\n\n===Return to Station 19===\nFollowing the death of George Floyd and the start of the protests in Seattle, Maya asked Diane to come back to the station to talk to her team if any of them wanted. Diane waited in Maya's office for anyone to come in and talk. The first person to come in was Ben, who talked to her about how he taught his sons to interact with police and how it made him feel like a hypocrite. He also talked about feeling powerless against cops.\n\nWhen Maya stepped into the office to see if anyone had come to speak to Diane, Diane said only one. And Maya. She told Maya to sit down. She understood that Maya was grieving as well and dealing with everything changing. Maya talked about being taught about racism in school as if it were something in the past only to grow up and find out that wasn't true. Diane shared a similar experience learning about Native genocide. Maya shared a memory of her friends silently supporting her when her father made her run until she collapsed. Her first instinct was to do that for the Black members of her team, but she knew that wasn't enough because she had the power as an adult to stand up to injustice.\n\nDiane stepped out of the office when she saw Travis at the front desk. She asked if he wanted to talk and he told her he was going to let the Black firefighters go first. When she pointed out there wasn't a line and said she knew that it was a particularly difficult time for Asian Americans as well, he told her the story of his mother having someone spit on her at the grocery store the same day George Floyd died. He also wondered why Asian Americans were being attacked all over the country and no one was talking about it except Asian Americans.\n\nNext she spoke to Andy, who felt guilty for not having seen how difficult life is for Black Americans until she married a Black man. She faced racism as a child, but less so because she passed as white. Diane said a lot of people were waking up to this at the same time and felt the same guilty she felt. She grew up with firefighters and police. She had trouble resolving the police brutality with the cops she'd known growing up.\n\nVic came to talk to Diane next, asking how one becomes a therapist, wanting a possible backup plan if she got injured or threw a brick through police station like she wanted to. Diane explained the process and Vic said she was about eight credits shy of a bachelor's degree, because she dropped out after the theatre burned down and her favorite teacher didn't make it out. Vic shared a story of her grandmother attending protests and boycotting and how they're still having the same battle.\n\nJack told Diane he was worried about talking to people about it and getting the words wrong. He knew he wasn't racist. Diane told him that's kind of the slogan of racists. She told him about the privilege he had for being white even having grown up on the street. He said he knew that, as he and some other kids had banded together to stay safe on the streets and while running from cops, he never worried that he'd be killed if the cop caught him while some of his friends did. She talked to him about how prison is legal slavery and how he'd committed crimes himself, but never spent time in jail or prison.\n\nWhen Dean came into the office, he said nothing, but started to cry. Diane cried as well. After a few moments, he thanked her and left.\n\nAt the end of the day, Diane approached Sullivan as he cleaned the ladder truck in the barn. He said this death was different. This wasn't a split-second decision. This was the murder of an unarmed, defenseless, compliant Black man in the middle of the street in broad daylight. White people are finally started to understand the terror Black people feel. Nothing could prevent the same thing from happening to him. ''(\"[[Get Up, Stand Up (Station 19)|Get Up, Stand Up]]\")''\n\n===Conflict Resolution Training===\nIn order to expand Crisis One to the entire SFD, Dean arranged for Diane to train them all in conflict resolution and how to deal with a variety of scenarios they might see. For the first scenario, she asked Andy and Sullivan to play a married couple with a domestic dispute. She was unaware they were separated. She played the responder in the scenario. When Sullivan had to leave to respond to a call, Theo took his place and the scenario continued. Vic swapped in as the responder, but this ended with her and Theo flirting. Dean suggested he pick the pairings to avoid interpersonal relationships, which Diane agreed to. Next, he had Jack and Maddox play co-workers, the latter of whom had locked himself in the conference room. Dean played the responder. When Maddox got very hammy, Dean accused him of not taking it seriously, so Diane called for them to take a break. For another scenario, Aquino was having a crisis and Ben played the responder and was able to talk him through it. They continued their training and at the end of the day, Diane felt they were prepared to work with the program. She had also arranged trainings with stations 88, 7, and 42. As she went to leave, she found Andy looking at her father's memorial. She talked to Andy about her marriage to Sullivan, saying that Andy had described their relationship as electric. People don't usually go from electric to divorced. ''(\"[[100% or Nothing]]\")''\n\nShe continued to help train the other fire stations in Seattle with Vic's help as Dean pulled back to look into other options for his career. She also reported to the brass of the Department that Andy was the lone woman at station 23, which led to the addition of [[Deja Duval]] to the station. ''(\"[[Things We Lost in the Fire (Station 19)|Things We Lost in the Fire]]\")''\n\n===Thanksgiving===\nOn Thanksgiving, Diane came into the station with a pie. She was surprised to see Vic at the desk. She had stepped in to help run Crisis One while Vic was recovering and assured Vic the program wouldn't die with Dean. When Diane pushed, Vic admitted that she felt like she wanted to crawl in a hole and let it swallow her. She felt like she couldn't because people expected her to bounce back like before. And she didn't want them to think that this death hurt more than Lucas's. Diane explained how her body might be dealing with this death differently. She believed Vic was punishing herself for not being in love with Dean, but also said Vic shouldn't. ''(\"[[Little Girl Blue]]\")''\n\n===Treating Ben===\nWhen Ben disobeyed a direct order at a scene, putting the victim and his team in danger, he was ordered to have three sessions with Diane before he could return to active duty. He cancelled on her twice, making excuses both times. Diane came to the 10K N Turnouts fundraiser, where she told Ben she couldn't clear him until she talked to him. ''(\"[[Searching for the Ghost]]\")''\n\n==Relationships==\n===Romantic===\nShe was married to another firefighter. She says she hated it because she was constantly worried about him while he was fighting fires.\n\n===Familial===\nShe has three children, one 15 year old and two preteens.\n\n===Professional===\nShe and [[Sean Beckett]] knew each other when they were at the fire academy. ''(\"[[100% or Nothing]]\")''\n\n==Career==\nShe was a woodland firefighter for the [[Seattle Fire Department|Seattle Fire Department]], specializing in smokejumping. During her firefighting tenure, she had a bad drop from a helicopter shattered her leg, and she decided to make a change. After learning to counsel people who had been through trauma, just like she'd been counseled after her accident, she earned her doctorate, and began counseling SFD firefighters. ''(\"[[Something About What Happens When We Talk]]\")''\n\nIn addition to being a grief counselor and trauma specialist for the department, she is also certified in crisis intervention training, which she lends to the newly created Crisis One program. ''(\"[[100% or Nothing]]\")''\n\n==Notes and Trivia==\n*She worked as a bartender for most of her 20s.\n*She likes silence.<ref>[[Something About What Happens When We Talk]], 3x10 (S19)</ref>\n*[[Jack Gibson|Jack]] sees her twice a month.<ref>[[Get Up, Stand Up (Station 19)|Get Up, Stand Up]], 4x12 (S19)</ref>\n*Her kids are of a driving age, which is terrifying according to [[Sean Beckett|Captain Beckett]]. <ref>[[100% or Nothing]], 5x04 (S19)</ref>\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" crop=\"true\" position=\"center\" hideaddbutton=\"true\">\nS193x10DianeLewis.png|[[Something About What Happens When We Talk]]\nS193x13DianeLewis.png|[[Dream a Little Dream of Me]]\nS194x12DianeLewis.png|[[Get Up, Stand Up (Station 19)|Get Up, Stand Up]]\nS195x04DianeLewis.png|[[100% or Nothing]]\nS195x06DianeLewis.png|[[Little Girl Blue]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS193x10-11.jpg\nS193x10-12.jpg\nS193x10-13.jpg\nS193x10-14.jpg\nS193x10-15.jpg\nS194x12-1.jpg\nS194x12-3.jpg\nS194x12-4.jpg\nS194x12-5.jpg\nS194x12-6.jpg\nS194x12-10.jpg\nS194x12-12.jpg\nS194x12-13.jpg\nS195x04-5.jpg\nS195x04-10.jpg\nS195x04-12.jpg\nS195x04-14.jpg\nS195x04-16.jpg\nS195x04-17.jpg\nS195x04-18.jpg\n</gallery>\n\n==Appearances==\n{{Diane Lewis Appearances}}\n{{Scrollbox}}\n\n{{DEFAULTSORT:Lewis, Diane}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S3 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:Firefighters]]\n[[Category:Doctors]]"}]}}}}