{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"85558": {"pageid": 85558, "ns": 0, "title": "Diana Cortez", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = 18x16DianaCortez.png\n|name = Diana Cortez\n|diagnosis = Syncope\n|doctors = *[[Teddy Altman]]\n*[[Jordan Wright (Character)|Jordan Wright]]\n|status = Alive\n|only appearance = [[Should I Stay or Should I Go]]\n|seasons = '''[[Grey's Anatomy|GA]]:''' [[Season 18 (Grey's Anatomy)|18]]\n|portrayed by = [[Brenda Banda]]\n}}\n\n'''Diana Cortez''' is [[Colin Renfield|Colin Renfield's]] co-worker, who brought him to the hospital after his arm was traumatically amputated.\n\n==History==\nDiana and Colin were worked when Colin's arm was cut off by a conveyer belt. Diana brought Colin to the hospital, where she handed him off to the doctors before fainting. The doctors examined her and determined she'd had a vasovagal respond to the sight of Colin's blood. She told them that she'd seen the accident happening and it just kept playing over and over in her head. While talking about it, she fainted again, so they put her feet up.\n\nLater, when she was taken to the ICU to see Colin, Diana said that she'd noticed something was wrong with the conveyer belt, but didn't tell anyone and wasn't paying attention when he turned it on. Diana stayed at the hospital until Colin's wife arrived and the two of them visited him together.\n\n==Career==\nShe works at an e-tail fulfillment center.\n\n{{DEFAULTSORT:Cortez, Diana}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S18 Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]"}]}}}}