{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"75952": {"pageid": 75952, "ns": 0, "title": "Don", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S193x01Don.png\n|name = Don\n|status = Alive\n|marital = [[Joan (I Know This Bar)|Joan]] † ''(wife)''\n|only appearance = [[I Know This Bar]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 3 (Station 19)|3]]\n|portrayed by = [[Bill Doyle]]\n}}\n\n'''Don''' is a man who was trapped in a car that had driven into [[Emerald City Bar]].\n\n==History==\nDon and his wife, Joan, were driving home when Don suddenly grabbed his arm in pain. He'd had two prior heart attacks, so his wife was immediately worried that he was dying. She started driving him to the hospital in a panic, but swerved to miss someone who was in the road and ended up driving into [[Emerald City Bar]]. With help from [[Ben Warren]], who was inside the bar, she was able to determine that he was still alive, though he was unconscious. Ben coached her through some chest compressions and then had her apply the pads from a LifePak so he could defibrillate. Don regained consciousness after being defibrillated and they were able to break out the back window and pull Don out of the car and get him to the hospital, where he had heart surgery. While he was taken to the hospital, Joan was still trapped in the car by a jammed seatbelt. She pulled out some crafting scissors from her purse, which impaled her in the neck when the car lurched forward. Travis applied pressure to her neck and tried to slow the bleeding, but he was unable to save her and she died on scene. Travis and Vic then went to their home, where Travis fed their dog.\n\n==Relationships==\n===Romantic===\nHe was married to [[Joan (I Know This Bar)|Joan]] until her death.\n\n==Notes and Trivia==\n*He and Joan have a dog named Cleo.\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S3 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}