{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"4181": {"pageid": 4181, "ns": 0, "title": "Donna Keating", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP221DonnaKeating.png\n|name = Donna Keating\n|status = Alive\n|diagnosis = *UTI\n*Chlamydia\n|doctors = [[Sam Bennett]]\n|treatment = *Sulfadiazine\n*Doxycycline\n|marital = Bill Keating ''(ex-husband)''\n|job = Teacher\n|only appearance = [[What You Do for Love]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Melinda Page Hamilton]]\n}}\n'''Donna Keating''' was a patient of [[Sam Bennett|Sam]] who had a [[Medical Glossary#U|UTI]] and contracted chlamydia.\n\n==History==\nDonna came into the practice suspecting she had a UTI. Sam ran the tests, which showed she had a UTI and also chlamydia. He gave her prescriptions for both of them and asked how she might have gotten it. She said her husband had been cheating for a while. She said she needed to be away from Bill.\n\nShe later came into the ER with one of her students, [[Bobby Douglas]], who was having a severe allergic reaction. She said she'd found him. She admitted that she'd given him both her medicines because she'd had sexual contact with him. She talked to Sam about it. She said she'd just found out about her husband's affair and the women were younger and it made her feel old. Bobby was transferred into her class and they made excuses to spend time together outside of class. She claimed she loved Bobby. They gave her an ultimatum, saying they'd call the cops if she didn't end things immediately.\n\nDonna came to the hospital and Cooper told her to leave. When Bobby's parents came in, she made an excuse and left quickly, but not before his parents figured out what had happened.\n\nThe police showed up at the hospital and arrested Donna for statutory rape. Bill bailed her out of jail and left her. Donna continued to receive texts from Bobby, saying he loved her and wanted to be with her still. Sam advised her that if she loved him, she needed to let him go.\n\nShe went to see Bobby with his parents' permission. She told him she needed him because she was in a bad place, but didn't love him. He believed she was lying, but she insisted she wasn't and left.\n\n==Relationships==\n===Romantic===\n====Bill Keating====\nDonna married Bill Keating. Unfortunately, he had been cheating on her with very young women, and that made her feel old, so she had an affair with her 17 year old student [[Bobby Douglas]], whom she claimed to love. She was later arrested for statutory rape. Bill posted bail as his final gift for her and walked out.\n\n====[[Bobby Douglas]]====\nWhen she started to feel old because her husband was cheating on her with younger women, she started a sexual relationship with Bobby, one of her students. When she got Chlamydia and gave it to him, she shared her medication with him, which caused an allergic reaction. This caused the truth to come out and Donna was arrested for statutory rape. She later told Bobby that she didn't love him and left him.\n\n==Career==\nDonna is a senior class teacher. She seems to be a very supportive teacher and always tells her students, \"Stay focused on the problem and the answer will be clear.\"\n\n{{DEFAULTSORT:Keating, Donna}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (General)]]"}]}}}}