{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51769": {"pageid": 51769, "ns": 0, "title": "Doug Iverson", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP5x07DougIverson.png\n|name = Doug Iverson\n|status = Alive\n|marital = Shannon Iverson † ''(wife)''\n|only appearance = [[Don't Stop 'Till You Get Enough]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Private Practice)|5]]\n|portrayed by = [[T.J. Ramini]]\n}}\n'''Doug Iverson''' is the husband of Shannon Iverson.\n\n==History==\nDoug's wife, Shannon, came into the ER after a car accident in which she sustained a head injury. She was 16 weeks pregnant following fertility treatments. She had no signs of brain activity, but the fetal heart rate was strong. Doug had left Shannon a year prior, but Jake tried to track him down so they could consult with him on what to do.\n\nDoug agreed to fly in from London, but they struggled to keep Shannon stable on life support while they waited. When Doug arrived at the hospital, he was informed of the situation. After thinking about the situation, Doug decided to allow them to donate Shannon's organs.\n\n==Relationships==\n===Romantic===\nHe is married to Shannon Iverson. However, they'd been separated for a year when she was in an accident.\n\n===Familial===\nHe and his wife used fertility treatments for four years. After Doug left, Shannon continued to try to get pregnant on her own.\n\n==Notes and Trivia==\n*Shannon's lungs went to a non-smoking dad who got cancer anyway. Her liver was split between a woman at St. Ambrose and a soldier in Fresno. Her heart went to [[Leanne Schaffer]].\n\n{{DEFAULTSORT:Iverson, Doug}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]"}]}}}}