{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49753": {"pageid": 49753, "ns": 0, "title": "Doug Adams", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP103DougAdams.png\n|name = Doug Adams\n|status = Alive\n|alias = Mr. Midlife Crisis\n|doctors = [[Violet Turner]]\n|treatment = Talk therapy\n|marital = [[Karen Adams]] † ''(wife)''\n|first appearance = [[In Which Addison Finds the Magic]]\n|last appearance = [[Crime and Punishment]]\n|count = 2\n|seasons = '''[[Private Practice|PP]]:''' [[Season 1 (Private Practice)|1]] and [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Andy Milder]]\n}}\n\n'''Doug Adams''' is a patient who spent three years in therapy getting up the courage to leave his wife.\n\n==History==\n===Karen's Diagnosis===\nAfter 36 months of seeing Violet, Doug felt that he was prepared to ask his wife for a divorce, something he'd wanted for a while. After a successful session, he went home and asked her for one, but she became angry at him and dragged him back down to the practice, where she confronted Violet. During the confrontation, she had a serious nosebleed, so Sam took her into a room and tried to cauterize the bleed while Doug went to talk to Violet again. Doug was resolute in his decision, but when he went to tell Karen he was leaving, he found that the bleeding had worsened. When Karen was then diagnosed with Wegener's disease, he decided to stay with her, even after learning that she had known about it for six months and hadn't told him. ''(\"[[In Which Addison Finds the Magic]]\")''\n\n===Karen's Death===\nDoug called Violet one night and asked her to come to his house. She arrived and Doug led her upstairs, where his wife's body was. He told Violet he'd killed her, but claimed it was a mercy killing and that she had asked him to do it. After speaking to [[Kevin Nelson]] about the case, Violet went back to the jail and talked to Doug again. When she pressed him, he admitted that she had been abusive to him and that's why he killed her. ''(\"[[Crime and Punishment]]\")''\n\n==Relationships==\n===Romantic===\nDoug was married to [[Karen Adams]] for 19 years, but wanted to leave her. He spent months in therapy trying to get to the point where he felt confident in his choice, but when he went to Karen, her nose started bleeding seriously. He decided to stay with her after she was diagnosed with Wegener's disease. ''(\"[[In Which Addison Finds the Magic]]\")''\n\nLater, Doug killed her. He first claimed it was a mercy killing, but later said that she had been highly abusive to him, calling him an idiot and throwing things at him, so he murdered her. ''(\"[[Crime and Punishment]]\")''\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPP103DougAdams.png|[[In Which Addison Finds the Magic]]\nPP208DougAdams.png|[[Crime and Punishment]]\n</gallery>\n\n==Appearances==\n{{Doug Adams Appearances}}\n\n{{DEFAULTSORT:Adams, Doug}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S1 Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Psych)]]"}]}}}}