{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50925": {"pageid": 50925, "ns": 0, "title": "Dr. Gibson", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = PP4x03Dr.Gibson.png\n|name = Dr. Gibson\n|status = Alive\n|alias = Gibby\n|title = M.D.\n|job = Doctor\n|only appearance = [[Playing God]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[James Remar]]\n}}\n\n'''Dr. Gibson''' is a friend of Pete's who treated patients outside of medical facilities.\n\n==History==\nGibby, an old friend of Pete's, had dinner with Pete and Violet. They told stories about working together overseas. He'd been running a clinic in LA for six months and Violet was surprised she hadn't met him before. While they were eating, [[Suchin]] and [[Kwan]] came to the door. Kwan had severe abdominal pain. Violet wanted to call an ambulance, but Gibby instead said to take him into a back room where he had a makeshift OR set up in his house. He operated and removed Kwan's appendix.\n\nThe next day, Pete brought supplies into Gibby's clinic, saying he saw that he was running low. He said that he could make some calls and get Gibby a partnership with a surgical center. Gibby said that most of his patients wouldn't go for that.\n\nPete started volunteering his time at Gibby's clinic.\n\nWhen [[Alex (Playing God)|Alex]] came in with his girlfriend, who had been shot, Pete found out that Gibby was taking money from gangs in order to fund his clinic. When it became clear that Gibby couldn't treat the girlfriend properly in his house, Pete called an ambulance, which came and took her to the hospital.\n\nGibby got upset with Pete for calling an ambulance, but Pete said that if he heard about Gibby treating another patient, he'd personally call the police and get him shut down.\n\n==Relationships==\n===Friendships===\nHe and Pete worked together with Doctors Without Borders. They were friends during that time, but after Pete discovered that Gibby had set up a makeshift OR in his house, he said that he couldn't be okay with that.\n\n==Career==\nHe is a doctor.\n\n{{DEFAULTSORT:Gibson, Dr.}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Doctors]]"}]}}}}