{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52376": {"pageid": 52376, "ns": 0, "title": "Dr. Whitehouse", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = PP5x19-5.jpg\n|name = Dr. Whitehouse\n|status = Alive\n|job = Couples counselor\n|only appearance = [[And Then There Was One]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Private Practice)|5]]\n|portrayed by = [[Brian George]]\n}}\n\n'''Dr. Whitehouse''' was Pete and Violet's marriage counselor.\n\n==History==\nPete and Violet decided to start working on their marriage with the aid of a couples counselor. They chose Dr. Whitehouse after two other therapists weren't a good fit. He started their session by asking them what initially drew each of them to the other.\n\nIn another session, they argued about the case of [[Drea Spencer]] and how they disagreed over things. Whitehouse watched them argue and Pete said he looked smug. Whitehouse said that he was just hopeful for them. The fighting was ugly, but it was better than just being polite because being polite wouldn't give their marriage a chance.\n\nWhitehouse suggested unpacking everything that had been revealed in their last session. Pete said that he thought the problem they were having was that they disagreed about how to get to a good place. He wanted to just laugh and play and love each other instead of unpacking all their issues. He kissed her and left the office.\n\n==Career==\nHe is a therapist who does couples counseling.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP5x19-5.jpg\nPP5x19-6.jpg\nPP5x19-10.jpg\nPP5x19-11.jpg\nPP5x19-12.jpg\n</gallery>\n\n{{DEFAULTSORT:Whitehouse, Dr.}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]\n[[Category:Doctors]]"}]}}}}