{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50151": {"pageid": 50151, "ns": 0, "title": "Duncan", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Other Characters Infobox\n|image = PP222Duncan.png\n|name = Duncan\n|title = J.D.\n|status = Alive\n|job = Lawyer\n|first appearance = [[Do the Right Thing]]\n|last appearance = [[Yours, Mine & Ours]]\n|count = 2\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[D.B. Woodside]]\n}}\n\n'''Duncan''' is a lawyer and friend of [[Sam Bennett]].\n\n==History==\n===Harold Allen's Trial===\nDuncan came into the practice to pick up Sam for court. Sam was his expert witness in the case against [[Harold Allen]], his client, a doctor who was being charged with malpractice regarding the death of one of his patients. When Sam did poorly on the stand, Duncan wanted to put him back on there to give them a chance at winning the case. In order to prepare himself, Sam reviewed and memorized all the medicine in the case. When he did so, Sam discovered that the patient had received morphine for a surgery two years prior, which was overkill unless the patient was allergic to aspirin, which Martin Weiser was. He noticed that it wasn't flagged on the chart, but there was a blank page where that information would have been. He figured out that Harold Allen hadn't been able to revive him because he'd given him aspirin and he was allergic. He hid it because he was worried he'd lose everything over that mistake. After Sam testified about it, Duncan asked why he hadn't told him. Sam said that he needed to tell the truth and telling him would have put Duncan in a bad position. ''(\"[[Do the Right Thing]]\")''\n\n===Embryo Switch===\nWhen [[Amelia Sawyer]] and [[Zoe Salter]] ended up pregnant after their embryos were switched prior to implantation, they called in Duncan to start damage-control to protect the practice's image. He said they needed to offer to cover all medical expenses, plus a large settlement to each family in exchange for them agreeing not to pursue additional claims and confidentiality. He also believed they needed to fire Dell to show that someone was paying for the mistake. Instead of doing that, Naomi offered to quit as she was offered the job running [[Pacific Wellcare Center]]. ''(\"[[Yours, Mine & Ours]]\")''\n\n==Relationships==\n===Romantic===\nAfter [[Harold Allen|Harold Allen's]] hearing, Duncan went on a date with [[Naomi Bennett]]. ''(\"[[Do the Right Thing]]\")''\n\n===Friendships===\nHe and [[Sam Bennett]] are good friends. Sam acted as an expert witness at Duncan's request.\n\n==Career==\nHe is a lawyer. He represented [[Harold Allen]] when he was sued for malpractice.\n\nHe specializes in medical malpractice. ''(\"[[Yours, Mine & Ours]]\")''\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPP220Duncan.png|[[Do the Right Thing]]\nPP222Duncan.png|[[Yours, Mine & Ours]]\n</gallery>\n\n==Appearances==\n{{Duncan Appearances}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]"}]}}}}