{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49734": {"pageid": 49734, "ns": 0, "title": "Duncan Stinson", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP1x02-12.jpg\n|name = Duncan Stinson\n|status = Alive\n|marital = [[Melinda Stinson]] ''(wife)''\n|children = [[Emily Stinson]]\n|only appearance = [[In Which Sam Receives an Unexpected Visitor]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 1 (Private Practice)|1]]\n|portrayed by = [[Dorian Harewood]]\n}}\n\n'''Duncan Stinson''' is the father of [[Emily Stinson]], whom he switched with [[Sarah O'Brien]] when they were two days old.\n\n==History==\nMelinda and Duncan were called into the practice when it was discovered that their baby had been switched with [[Beth O'Brien|Beth]] and [[Greg O'Brien|Greg O'Brien's]] baby when they were infants. Duncan in particular was upset when they learned that their daughter had an incurable genetic disorder, because they'd spent thousands of dollars on fertility treatments to get pregnant.\n\nAfter looking through staff schedules and visitor logs, the doctors determined that Duncan had been the one to switch the girls after Emily had a seizure when she was two days old and he was arrested. Melinda was upset at him for having given away her baby. She'd had a c-section with complications, meaning she was unaware of anything being wrong with the baby after she was born. After Duncan's arrest, the girls were switched back.\n\n==Relationships==\n===Romantic===\nHe is married to [[Melinda Stinson]]. However, after learning that he'd switched their baby with another one in the nursery, Melinda said he wasn't her husband anymore, indicating that she'd be pursuing divorce.\n\n===Familial===\nMelinda and Duncan wanted a baby, but were unable to conceive on their own, so they enlisted the help of [[Naomi Bennett]], who helped them conceive. When their baby was two days old, she had a seizure, so Duncan switched the two girls. Melinda unknowingly raised the O'Briens' baby for nine months until the switch was discovered and the girls were switched back.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP1x02-7.jpg\nPP1x02-12.jpg\nPP1x02-21.jpg\nPP1x02-24.jpg\nPP1x02-25.jpg\n</gallery>\n\n{{DEFAULTSORT:Stinson, Duncan}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S1 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Genetics)]]"}]}}}}