{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"74280": {"pageid": 74280, "ns": 0, "title": "Dylan (Into the Wildfire)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Firefighter Infobox\n|image = S192x17Dylan.png\n|name = Dylan\n|status = Alive\n|job = Firefighter\n|workplace = California Department of Forestry and Fire Protection\n|only appearance = [[Into the Wildfire]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 2 (Station 19)|2]]\n|portrayed by = [[Nyle DiMarco]]\n}}\n\n'''Dylan''' is a firefighter in Los Angeles who helped get the team free after they became trapped.\n\n==History==\nDylan was working at the command center during a large Los Angeles wildfire. He was treating a patient when Travis came in and stepped in to help. Travis was impressed by him always knowing what Travis was going to do next and didn't notice until after the patient was stable that Dylan is deaf. When the rest of station 19 lost radio communication and was trapped in the neighborhood where they were working, Dylan told Travis he knows a side road that they could take. He described where it was and with help from Ryan, they got a call through to station 19 and they were able to find the road and drive out to safety.\n\nOnce the team was reunited at the command center, Jack spoke to Dylan in sign language, which surprised Travis. He let them know the attraction was mutual between them and then left them alone. Once he was gone, the two of them shared a kiss.\n\n==Relationships==\n===Romantic===\nHe was attracted to Travis. After working with him all day, the two shared a kiss.\n\n==Career==\nHe is a firefighter with California Department of Forestry and Fire Protection.\n\n{{DISPLAYTITLE:Dylan}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S2 Characters]]\n[[Category:Firefighters]]"}]}}}}