{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"77961": {"pageid": 77961, "ns": 0, "title": "Earl Davis", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S193x09-8.jpg\n|name = Earl Davis\n|status = Alive\n|children = [[Missy Davis]]\n|job = Police Officer\n|only appearance = [[Poor Wandering One]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 3 (Station 19)|3]]\n|portrayed by = [[Garrett Morris]]\n}}\n\n'''Earl Davis''' is a man with dementia who was dropped off at the fire station.\n\n==History==\nEarl came into the fire station looking for the Chief. Vic quickly figured out that he was confused and seemed to have some kind of dementia. She pretended Dean was the Chief and they led Earl to the lounge, where they figured out his name, but couldn't get enough information from him to contact his family. Vic called all the senior homes in the area, but none of them knew him. She then convinced Dean to play piano, hoping the music would help Earl remember. Dean started to play and Earl started to sing along, just as his daughter arrived. However, he lost his balance and became agitated, which led him to smack Vic on the cheek. His daughter, Missy, then came in and comforted him. She told Vic she just wanted a little break, a cup of coffee by herself, which is why she dropped him off. She promised not to do it again, but Vic knew she couldn't promise that and asked her just to give them a heads up next time.\n\n==Relationships==\n===Familial===\nHis daughter, Missy, is his primary caregiver.\n\n==Career==\nHe used to be a police officer.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS193x09-1.jpg\nS193x09-2.jpg\nS193x09-3.jpg\nS193x09-6.jpg\nS193x09-7.jpg\nS193x09-8.jpg\nS193x09-9.jpg\nS193x09-10.jpg\nS193x09-34.jpg\nS193x09-35.jpg\nS193x09-36.jpg\nS193x09-37.jpg\nS193x09-38.jpg\nS193x09-39.jpg\nS193x09-40.jpg\nS193x09-41.jpg\nS193x09-42.jpg\nS193x09-44.jpg\n</gallery>\n\n{{DEFAULTSORT:Davis, Earl}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S3 Characters]]\n[[Category:S19 Rescuees]]\n[[Category:Police Officers]]"}]}}}}