{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52496": {"pageid": 52496, "ns": 0, "title": "Ed Diamanti", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP6x01EdDiamanti.png\n|name = Ed Diamanti\n|status = Alive\n|diagnosis = *Alcoholism\n*Cardiac episode\n|doctors = *[[Violet Turner]]\n*[[Sam Bennett]]\n|treatment = *Talk therapy\n*Catheterization\n|marital = Wife †\n|children = [[Debra Diamanti]]\n|grandchildren = Max Diamanti\n|only appearance = [[Aftershock]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 6 (Private Practice)|6]]\n|portrayed by = [[Alex Rocco]]\n}}\n\n'''Ed Diamanti''' is an alcoholic man who wanted to reunite with his estranged daughter.\n\n==History==\nEd was a recovering alcoholic who was seeing Violet. He invited his daughter, Debra, to one of his sessions to try to make amends with her. She showed up at the session visibly pregnant, to his surprise. Ed told her he'd been sober for six months and needed to talk to her. She talked bout their history and about how he just left. He said that she'd told him to leave which is why he went. He thought it would be better for her if he left, but she said that after he left, her mother was broken. She told him she wasn't sorry just as her water broke in the office.\n\nAddison examined her at the practice and then had her moved to the hospital, where she said Debra's regular OB would meet her. Ed worried about going to the hospital to be with Debra, saying she didn't want him around. Violet encouraged him to go anyway.\n\nAt the hospital, Jake took over Debra's care because her OB was held up at another hospital. She labored alone because when Ed came to the hospital, he had a cardiac episode and had to be rushed in for a catheterization to open his closed artery. During his procedure, he talked about all the events that had lined up to save his life.\n\nAfter her baby was born, Amelia talked to Debra and brought her and the baby to see Ed, who apologized to her. She introduced him to his grandson, Max.\n\n==Relationships==\n===Romantic===\nHe was married, but he left his wife and daughter.\n\n===Familial===\nHe hadn't seen Debra in 23 years when he got sober and invited her to one of his therapy sessions to try to make amends. When he had a cardiac episode while she was giving birth, Debra decided to start working on their relationship.\n\n{{DEFAULTSORT:Diamanti, Ed}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S6 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Cardio)]]\n[[Category:Patients (Psych)]]"}]}}}}