{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"80890": {"pageid": 80890, "ns": 0, "title": "Eddie (Don't Look Back in Anger)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S194x04Eddie.png\n|name = Eddie\n|status = Alive\n|marital = [[Gina (Don't Look Back in Anger)|Gina]] ''(wife)''\n|children = Three children\n|parents = Father\n|other family = Mother-in-law\n|only appearance = [[Don't Look Back in Anger]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 4 (Station 19)|4]]\n|portrayed by = [[Ryan Dorsey]]\n}}\n\n'''Eddie''' is a man who was hit in the head with a baseball his wife hit with a bat.\n\n==History==\nEddie and his wife, Gina, got into a fight. During the fight, Gina used a baseball bat to hit a baseball at Eddie and it hit him in the face. One of their neighbors called for help. Travis and Vic arrived to find Gina still swinging the bat around in the front yard, heavily pregnant and hitting beer cans. Vic called for backup. While they waited, Gina continued to swing the bat and sing. When the backup arrived, Maya sent Vic and Ben inside to find and treat Eddie while Travis guarded the door to keep Gina out. When Gina threw her phone at Travis and injured his nose, they called for police backup.\n\nInside, Eddie had a needle hanging from his face as well as the laceration from the baseball. He also appeared intoxicated and they noted the presence of drug paraphernalia in the house. \n\nOutside, Gina had a contraction, but refused Maya's suggestion to get in the aid car and let them help. She instead ran into her garage, so Travis and Maya followed her to keep her out of the house. Andy reported that PD was familiar with the couple and wasn't in a rush to get there due to prior interactions with them. Gina continued to have contractions, but denied being in labor, saying it was her third. Then her water broke, but she continued to refuse to go to the hospital with them. When Maya realized she was pushing, she told her to stop, but was forced to reach down when she realized the baby was coming out. She caught the baby. They then got Gina onto a gurney and handed her her baby.\n\nBen got Eddie calmed down enough to start treating his facial laceration, but when he heard her cry out in labor, he got agitated again and accused them of keeping them from his wife. He said he wanted to be there for Gina because he wanted to be a good dad. When Gina called for him from the garage, he shoved Ben and ran toward her.\n\nOutside in the garage, they prepared to take Gina to the hospital, when Eddie came in. Vic restrained him, but he pushed her off, injuring her. While Gina was taken to the hospital, Eddie was arrested.\n\n==Relationships==\n===Romantic===\nHe is married to [[Gina (Don't Look Back in Anger)|Gina]], with whom he has three children, including a newborn.\n\n===Familial===\nHe and his wife have three children. The older two are in the custody of his wife's mother.\n\nHe didn't have a good father as a child.\n\n{{DISPLAYTITLE:Eddie}}\n\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}