{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"85423": {"pageid": 85423, "ns": 0, "title": "Edgar", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S195x18Edgar.png\n|name = Edgar\n|status = Alive\n|parents = *Mother\n*Father\n|only appearance = [[Crawl Out Through the Fallout]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Aiden Arnold]]\n}}\n\n'''Edgar''' is a child who was on a field trip when they were in an accident.\n\n==History==\nEdgar and his classmates were on their way to a field trip when they were in an accident involving a truck carrying radioactive materials. The bus driver was rendered unconscious by the crash and the other chaperone was also injured. When firefighters arrived on the scene, Edgar and the other kids called out for help, but because of the radioactive materials, they were unable to get close enough to the bus to get anyone out. Finally, Edgar was able to push out an emergency window enough to ask why they weren't helping. They explained that there was radioactive material in the street, so they needed to close the window immediately. Edgar did so and then ushered the kids to the other side of the bus. The driver of the truck that had been carrying the cesium [[Carl Swaminathan]], then decided he would clean up the cesium himself and move it a safe distance away. Once that was done, they began lifting the children out to safety. Freed from the bus, Edgar talked to Jack about his experience and said he couldn't wait to tell his parents. Once everyone was free, they were cleaned up by HAZMAT. When Edgar spotted his mom approaching, he ran to hug her.\n\n==Relationships==\n===Familial===\nHe was eager to tell his parents about what had happened.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS195x18-29.jpg\nS195x18-30.jpg\nS195x18-31.jpg\n</gallery>\n\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}