{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"86014": {"pageid": 86014, "ns": 0, "title": "Eduardo", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S196x01Eduardo.png\n|name = Eduardo\n|status = Alive\n|only appearance = [[Twist and Shout]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 6 (Station 19)|6]]\n|portrayed by = [[Antonio Leon]]\n}}\n\n'''Eduardo''' is a man who was in a car accident and then a tornado.\n\n==History==\nEduardo was driving when he ran a stop sign, causing a car accident with [[Hallie]] and [[Wes (Twist and Shout)|Wes]]. He got out and argued with Wes over whose fault the accident was while Hallie remained trapped in her car. Station 19 arrived on the scene and Beckett sent Eduardo and Wes to the aid car to get checked out. Before they could, it started to rain, forcing them into the aid car. However, when they saw a tornado nearby, they pulled Eduardo and Wes out of the aid car and prepared to shelter in place. When the tornado had passed, Eduardo said he thought he'd been hit by something and they saw that he had a piece of metal in his side. They told him they would take him to the hospital and they'd remove it there. As they worked, he admitted to them that the accident had been his fault. They assured him that while the accident was his fault, no one saw the tornado coming and he wasn't at fault for that.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS196x01-1.jpg\nS196x01-2.jpg\nS196x01-3.jpg\n</gallery>\n\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S6 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}