{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50126": {"pageid": 50126, "ns": 0, "title": "Eleanor (Wait and See)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP217Eleanor.png\n|name = Eleanor\n|status = Alive\n|diagnosis = Marital conflict\n|doctors = *[[Violet Turner]]\n*[[Sheldon Wallace]]\n|treatment = Couples group counseling\n|marital = [[Paul (Wait and See)|Paul]] ''(husband, separated)''\n|only appearance = [[Wait and See]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Alexandra Lydon]]\n}}\n\n'''Eleanor''' is a member of the couples support group run by Violet and Sheldon.\n\n==History==\nThree couples ([[Sasha (Wait and See)|Sasha]] and [[Ryan (Wait and See)|Ryan]], Eleanor and [[Paul (Wait and See)|Paul]], and [[Greg (Wait and See)|Greg]] and [[Carol (Wait and See)|Carol]]) were in a therapy group together. At the group, Eleanor said her husband, Paul, didn't want to have sex anymore. He defended that he was tired when he got home from work.\n\nAfter Violet caught Eleanor in the stairwell with Ryan, she and Sheldon called the two of them in privately. They talked about how the affair had come to be. They said it was easy and the communication was there unlike with their spouses. Sheldon suggested that they go home, talk to their spouses, and work on their marriages. Eleanor insisted that they wanted to be together and they should tell their spouses so they could start a new life together.\n\nAfter Ryan started to work on things with his wife and they talked about it in group, Eleanor admitted to having an affair, though she didn't say with whom. Paul was outraged and asked if it was someone he knows. Eleanor said she made a mistake, but Paul said he didn't care. He decided he was done and left the room.\n\n==Relationships==\n===Romantic===\n====[[Paul (Wait and See)|Paul]]====\nEleanor is married to [[Paul (Wait and See)|Paul]]. Their relationship was strained because Paul never wanted to have sex after he came home from work. He ultimately left her after she admitted to having an affair.\n\n====[[Ryan (Wait and See)|Ryan]]====\nShe had an affair with Ryan while still married to Paul. They were attracted to each other because they were able to communicate with each other unlike with their spouses.\n\n{{DISPLAYTITLE:Eleanor}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Psych)]]"}]}}}}