{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50939": {"pageid": 50939, "ns": 0, "title": "Elena Stone", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x04ElenaStone.png\n|name = Elena Stone\n|status = Alive\n|diagnosis = *Pregnancy\n*Chronic pain\n*Chiari Malformation\n|doctors = *[[Pete Wilder]]\n*[[Addison Forbes Montgomery]]\n*[[Amelia Shepherd]]\n|treatment = Posterior fossa decompression\n|marital = [[Steven Stone]] ''(husband)''\n|children = Expecting\n|only appearance = [[A Better Place to Be]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Mei Melancon]]\n}}\n\n'''Elena Stone''' is a pregnant woman who had chronic pain.\n\n==History==\nElena was 22 weeks pregnant and came into the ER in severe pain. Pete called in Addison, who did an ultrasound. She'd had chronic pain for the last five years, but no one had been able to find any cause. The baby was fine, but Addison believed the pregnancy was exasperating her condition. Pete believed she had fibromyalgia. They couldn't use meds because it was dangerous for the baby and they didn't have time for alternative methods to work.\n\nHer pain worsened and she asked for something to help with the pain. She was told she couldn't have anything because anything strong enough to help would hurt the baby. She asked about delivering the baby, but she hadn't yet reached viability. She said that if they couldn't help, she couldn't continue the pregnancy.\n\nElena's husband, Steven, begged them not to let her terminate. She didn't want a kid in the first place, but he pushed her and now he can't touch her because of the pain, so he'd never felt the baby kick, but he was excited about the baby.\n\nWhen Amelia overheard Pete and Addison discussing her case, she told them to run an MRI. The MRI showed a chiari malformation. It put pressure on her brain, causing her pain. Amelia said she could operate. Pete opposed surgery, suggesting alternative methods.\n\nThey went to the Stones with their plans and Elena decided she wanted the surgery after Addison said she recommended it.\n\nThey operated and Elena and the baby were both stable afterward. When she woke up, she had a headache, but was otherwise pain-free. Steven was able to feel the baby kick for the first time.\n\n==Relationships==\n===Romantic===\nShe is married to [[Steven Stone]]. He says that when he met her, he fell hard and fast. He also said that at some point, the thing that drew him to her was gone, possibly as a result of her disease.\n\n==Notes and Trivia==\n*She was 33 years old at the time of her pregnancy.\n\n{{DEFAULTSORT:Stone, Elena}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (Neuro)]]\n[[Category:Patients (ER)]]"}]}}}}