{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"19622": {"pageid": 19622, "ns": 0, "title": "Elena Debray", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP208ElenaDebray.png\n|name = Elena Debray\n|status = Deceased\n|diagnosis = Coma\n|doctors = [[Addison Forbes Montgomery]]\n|treatment = *Terbutaline\n*Life Support\n*C-Section delivery\n|children = Daughter\n|parents = *[[Jennifer Debray]]\n*[[Ronald Debray]]\n|only appearance = [[Crime and Punishment]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n}}\n'''Elena Debray''' was a patient of [[Addison Forbes Montgomery]].\n\n==History==\n===Car Accident===\nElena found out she was pregnant the day before the accident that left her in a coma. For the next eight months, she was on life support as the fetus gestated. Her boyfriend, Shawn, wanted Addison to allow her body to labor and deliver vaginally, but she recommended against it. Charlotte had St. Ambrose's legal team investigate and they found out that Shawn and Elena were never married, meaning that her parents still had legal authority to make medical decisions for her in her stead. They instructed Addison to perform the c-section. However, before she could do so, Shawn petitioned the court as guardian of the fetus and stopped the process. Ultimately, a judge stepped in and convinced Shawn to withdraw his protest rather than being ruled against. Addison performed the c-section and successfully delivered their daughter. Unfortunately, Addison was unable to save Elena and she died during the surgery. Addison handed the baby over to Shawn, who brought her back into the OR to see Elena before her body was taken away.\n\n==Relationships==\n===Romantic===\nShe was dating [[Shawn]] before her car accident. They planned to get married after she found out she was pregnant.\n\n===Familial===\nElena has a daughter who was born during the same surgery Elena died from.\n\n==Notes and Trivia==\n*Her daughter has her eyes, according to her parents.\n\n{{DEFAULTSORT:Debray, Elena}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Deceased Characters]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (MFM)]]"}]}}}}