{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"78739": {"pageid": 78739, "ns": 0, "title": "Elena Herrera", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = S195x16-42.jpg\n|name = Elena Herrera\n|status = Alive\n|marital = [[Pruitt Herrera]] † ''(ex-husband)''\n|children = *Miscarriage †\n*[[Andy Herrera]]\n|parents = Margarita\n|siblings = [[Sandra Alvarez]]\n|other family = *[[Robert Sullivan]] ''(son-in-law)''\n*[[Johnny Alvarez]] ''(brother-in-law)''\n*[[Michelle Alvarez]] ''(niece)''\n|first appearance = [[Dream a Little Dream of Me]]\n|last appearance = \n|count = 6\n|seasons = '''[[Station 19|S19]]:''' [[Season 3 (Station 19)|3]], [[Season 4 (Station 19)|4]], [[Season 5 (Station 19)|5]], and [[Season 6 (Station 19)|6]]\n|portrayed by = *[[Tracy \"Teemaree\" Jacobsen]] ''([[Dream a Little Dream of Me|S19 3x13]])''\n*[[Patricia De León]]\n}}\n'''Elena Herrera''' is the mother of [[Andy Herrera]] and the ex-wife of the now-deceased [[Pruitt Herrera]].\n\n==History==\n===Fire Academy===\nLike her husband and daughter, Elena attended the fire academy. However, unlike them, she didn't complete her training as she became pregnant with Andy. ''(\"[[Something About What Happens When We Talk]]\")''\n\n[[File:S193x15HerreraFamilyPhoto.png|thumb|left|A family photo of the Herreras.]]\nElena and Pruitt raised their daughter Andy together while their marriage was falling apart, resulting in frequent fights and disappointment.\n\n===Andy's Training===\nWhen Andy came home from school with a skinned knee because a boy in her class was harassing her, Elena snapped at Johnny for telling her that the boy had harassed her because he liked her. She then told Andy that if he harassed her again, Elena wanted Andy to hit him. She then had Andy start training with [[Snuffy Souza]], an MMA fighter, over Pruitt's objections. Andy continued this training through high school. ''(\"[[When the Party's Over]]\")''\n\n===Illness and \"Death\"===\nWhen Andy was nine, Elena got sick and \"died\". A week before her \"death,\" she picked Andy up from school and said they needed a fun day. They had ice cream and went to the park. Then they sat down and Elena said she'd always be there for Andy if she could, but if she couldn't, Pruitt would be and Andy had to look after him. Andy promised her mother she would. ''(\"[[Let It Burn]]\")''\n\n===Andy's Dream===\nAfter Pruitt died, Andy had trouble sleeping and took medicine to help. The medicine gave her weird dreams. In one of them, she saw Elena and called out to her. ''(\"[[Dream a Little Dream of Me]]\")''\n\n===Reuniting with Andy===\nAndy began looking into the circumstances surrounding her mother's death while sorting through Pruitt's things. She contacted Elena's sister, Sandra, looking for information. Sandra finally called Andy back and set up a meeting with her. Andy showed up to that meeting and was surprised to learn that Elena was alive after all. ''(\"[[Louder Than a Bomb]]\")''\n\nAndy quickly started having a panic attack at the realization. When she had calmed down somewhat, Sandra begged her to hear her mother out. Instead, she ran outside and started hyperventilating again. Sandra expressed regret for not having told Andy sooner. She encouraged Andy to listen to Elena. Elena explained that she had never planned to be a mother. Everyone told her she would change her mind when Andy was born. She loved Andy, but she resented her and she became depressed. She felt like a failure and wanted to die. She went to New York where her cousins lived and was a firefighter for two years before being injured out. She was devastated without Andy, but felt free. On 9/11, while he was in New York, Pruitt went to her cousins' house and demanded to see her. He tried to bring her back with him, but she refused. When Andy heard about this, she left, telling Elena to have Sandra call her, as she'd tried to maintain a relationship with Andy while Elena hadn't. Elena later virtually attended Pruitt's funeral. ''(\"[[Nothing Seems the Same]]\")''\n\n===Visiting Andy===\nWhen Elena learned that Andy had killed [[Jeremy Benanti]], the man who assaulted her, she came to Seattle to see her. She went first to the fire station, where Vic and Sullivan promised to call Andy and tell her Elena was there. While they were out on a call, Elena called Sandra, who gave her Andy's address, then went to Andy's apartment, where she told Andy she'd been raped at the fire academy, but never reported it, which was why she was so insistent that Andy learn to defend herself. Andy thanked her. Then they talked about how much things in the department had changed and how much Andy was benefiting from those changes. Elena then turned on some music and the two of them danced together. ''(\"[[Death and the Maiden]]\")''\n\n===Helping Andy===\nElena, through a video call, helped Andy pick out an outfit for a date. She also praised Andy for dating outside the firehouse. She advised Andy to find a guy who could light up her whole person. ''(\"[[Pick Up The Pieces]]\")''\n\n==Relationships==\n===Romantic===\nShe was married to [[Pruitt Herrera]]. They met at the fire academy, where they were both cadets. While he completed his training, she dropped out while she was pregnant with Andy. ''(\"[[Something About What Happens When We Talk]]\")''\n\n===Familial===\nShe has one daughter. Before Andy, she also had a miscarriage. ''(\"[[Let's All Go to the Bar]]\")''\n\n==Career==\nAfter leaving Pruitt and Andy, she became a firefighter in New York. She worked there for two years before being injured out. ''(\"[[Nothing Seems the Same]]\")''\n\n==Notes and Trivia==\n*She used to make up stories to tell Andy before bed.<ref>[[I'll Be Seeing You]], 3x12 (S19)</ref>\n*She was credited as Latina Woman for her [[Dream a Little Dream of Me|first appearance]].\n*Her sister describes her as a dreamer, passionate, and impulsive, traits Andy inherited from her.<ref>[[Wild World]], 4x02 (S19)</ref>\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nS193x13ElenaHerrera.png|[[Dream a Little Dream of Me]]\nS193x16ElenaHerrera.png|[[Louder Than a Bomb]]\nS194x01ElenaHerrera.png|[[Nothing Seems the Same]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS193x13-47.jpg\nS193x13-49.jpg\nS193x13-51.jpg\nS193x13-52.jpg\nS193x16-42.jpg\nS193x16-43.jpg\nS193x16-45.jpg\nS195x16-35.jpg\nS195x16-36.jpg\nS195x16-37.jpg\nS195x16-38.jpg\nS195x16-39.jpg\nS195x16-40.jpg\nS195x16-41.jpg\nS195x16-42.jpg\n</gallery>\n\n==Appearances==\n{{Elena Herrera Appearances}}\n{{Scrollbox}}\n\n[[de:Elena Herrera]]\n[[es:Elena Herrera]]\n\n{{DEFAULTSORT:Herrera, Elena}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S3 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 S6 Characters]]\n[[Category:Firefighters]]"}]}}}}