{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"86599": {"pageid": 86599, "ns": 0, "title": "Eli Stern", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Other Characters Infobox\n|image = S196x06-18.jpg\n|name = Eli Stern\n|status = Alive\n|other family = [[London]] ''(niece)''\n|job = Campaign Manager\n|first appearance = [[Demons]]\n|last appearance = \n|count = 3\n|seasons = '''[[Station 19|S19]]:''' [[Season 6 (Station 19)|6]]\n|portrayed by = [[Rob Heaps]]\n}}\n\n'''Eli Stern''' is a campaign manager who is running [[Travis Montgomery|Travis's]] mayoral campaign.\n\n==History==\nEli came into the station with a box of store-bought treats. He tried to offer them to Andy for the Halloween open house, but she firmly told him they couldn't accept edible treats from strangers, even store-bought ones. He then told her the real reason he was there. He was following the mayoral race and wanted to be Travis's campaign manager. Andy told him he already had a campaign manager, but he wanted to meet Travis and pitch his case. Travis came in at that point and Eli gave him his card after telling him how he could help his campaign.\n\nEli went for a walk and ate, then came back to the station, where he talked his way into helping [[Carina DeLuca|Carina]] and [[Andy Herrera|Andy]] decorate. As they decorated, he tried to talk Andy into putting a good word in for him with Travis, but she stayed firm that she wouldn't.\n\nEli came back again for the Halloween open house, bringing his niece, [[London]]. She was dressed as Peter Pan while he was dressed as the city of London, wearing a Big Ben costume. He asked Andy if she'd put in a good word for him with Travis. When she said she hadn't, he went over to talk to Travis on his own. ''(\"[[Demons]]\")''\n\nEli returned a few days later after Dixon released an attack ad about Travis's arrest. He told Travis he needed to spin it and showed Vic and Travis how he would spin it. Vic stepped down as Travis's campaign manager and told him to hire Eli. Eli and Travis the had a meeting to talk strategy. Eli told Travis he needed to give back what Dixon had given to him. Andy came in while they were talking and the two of them bickered. Andy didn't trust his intentions. ''(\"[[Pick Up The Pieces]]\")''\n\nEli came to the station to try to persuade Travis to let him leak the Crisis One call with the Dixons. Travis was adamant that he didn't want to despite Eli's insistence that it could change the narrative on Dixon. He also took pictures of Travis as he got ready to go on a call. When Travis showed up to the meeting after it was over, he started to give a speech only to learn that the people in the room were just the clean up crew. Travis kicked a chair in frustration, which Eli said just made it look like he actually had anger issues. Desperate, Travis agreed to let Eli leak the Dixon story. ''(\"[[Everybody Says Don't]]\")''\n\n==Relationships==\n===Romantic===\nHe once dated a girl who went to art school. ''(\"[[Demons]]\")''\n\n===Familial===\nHe is very close with his niece, [[London]]. When she said he needed to go as her, meaning the city London, he put on a Big Ben costume and took her to the Station 19 Halloween open house. ''(\"[[Demons]]\")''\n\n==Career==\nHe works as a campaign manager.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS196x04-5.jpg\nS196x04-6.jpg\nS196x04-7.jpg\nS196x04-8.jpg\nS196x06-18.jpg\nS196x06-19.jpg\n</gallery>\n\n==Appearances==\n{{Eli Stern Appearances}}\n\n{{DEFAULTSORT:Stern, Eli}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S6 Characters]]"}]}}}}