{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"32844": {"pageid": 32844, "ns": 0, "title": "Eli Wilson", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Other Characters Infobox\n|image = PP6x07-4.jpg\n|name = Eli Wilson\n|status = Alive\n|title = PhD\n|marital = Ex-wife\n|job = Human Sexuality Professor\n|only appearance = [[The World According to Jake]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 6 (Private Practice)|6]]\n|portrayed by = [[Christopher Cousins]]\n}}\n\n'''Eli Wilson''' is a professor and boyfriend of [[Angela Reilly]].\n\n==History==\nEli met Angela Reilly at the college he teaches at. A while after they started dating, the couple bumped into Angela's dad, Jake, and his girlfriend, Addison, at the movie theatre.\n\nEli introduced himself as Eli Wilson, PhD. It was clear, however, that Jake did not approve, creating an awkward silence before Angela excused them and they left.\n\nLater in the week, Eli and Angela went to Addison's house for dinner with Jake and Addison. Jake made the situation very uncomfortable after he kept implying that Eli was too old for Angela. Jake excused himself from the table, and Eli followed him to the patio.\n\nEli told Jake that he has never dated a student before, and Angela is different from other students. This angered Jake more and he told Eli to break off his relationship with Angela or else. And Jake assured him he didn't want to know what \"or else\" was. ''(\"[[The World According to Jake]]\")''\n\nEli was set to teach in Rome for a semester, and he invited Angela to come along with him. She happily accepted.\n\n==Relationships==\n===Romantic===\nEli is currently dating Angela Reilly, much to her father's disapproval, as he is 30 years older than she is. Jake once threatened him. ''(\"[[The World According to Jake]]\")''\n\nEli invited Angela to go to Rome with him for a semester. She accepted. ''(\"[[In Which We Say Goodbye]]\")''\n\n==Career==\nEli is a professor of human sexuality at the college that Angela Reilly attends. He went to teach in Rome for a semester.\n\n==Notes and Trivia==\n*He's a basketball fan. He likes the Lakers. ''(\"[[The World According to Jake]]\")''\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP6x07-10.jpg\nPP6x07-5.jpg\nPP6x07-4.jpg\nPP6x07-2.jpg\n</gallery>\n\n{{DEFAULTSORT:Wilson, Eli}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S6 Characters]]"}]}}}}