{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50995": {"pageid": 50995, "ns": 0, "title": "Elisa", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x08Elisa.png\n|name = Elisa\n|status = Alive\n|diagnosis = *Lymphoma\n*Tumor\n|doctors = *[[Pete Wilder]]\n*[[Cooper Freedman]]\n|treatment = *Chemotherapy\n*Surgery\n|siblings = *[[Carlos]]\n*Pilar\n|parents = *[[Diego]]\n*Alice †\n|only appearance = [[What Happens Next]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Elijah DeJesus]]\n}}\n'''Elisa''' is a patient who had cancer and wanted to refuse treatment.\n\n==History==\nElisa came into the ER with fluid around her heart. Pete used needle aspiration to drain the fluid, which helped her feel better. Her father was worried that her cancer was back. Cooper believed that the lymphoma tissue had invaded her pericardium. Her father said she couldn't take more chemo because it was so hard on her before. He wanted to forgo western medicine in favor of using a shaman.\n\nThe shaman came to their house and did a healing ritual, observed by Cooper and Pete, who brought a quartz, saying that the medicine men he'd worked with said it was a powerful healer. During the ritual, Elisa lost her pulse. They started CPR and called an ambulance.\n\nAt the hospital, she had surgery to make a hole in her pericardium to drain the fluid. Cooper wanted to keep her for observation until they could start chemo. Her father insisted that he just wanted to take her home. Cooper called for a judge to force them to get chemotherapy for Elisa.\n\nWhen Elisa woke up, she said she felt better and wanted to go home. She'd heard about Cooper bringing in a judge and said she didn't want chemo. Pete asked if she believed the shaman would heal her.\n\nWhen [[R.L. Hansen|the judge]] arrived, Diego explained his point of view. The judge then asked Elisa what she wanted. Elisa said that if she had to have more chemo, it would destroy her family. They were living in a trailer park because her treatment had bankrupted them. She admitted that she didn't believe what her father believed, but she wasn't afraid of dying. The judge ordered that she undergo chemotherapy.\n\nThe shaman came to the hospital to do a healing ritual there before her chemo.\n\n==Relationships==\n===Familial===\nShe was worried about how her family would make it if she had chemotherapy. She said that her brother and sister shouldn't have to grow up with every resource dedicated to Elisa's treatment.\n\n==Notes and Trivia==\n*She was 14 at the time of her recurrence.\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Oncology)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Peds)]]"}]}}}}