{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"34810": {"pageid": 34810, "ns": 0, "title": "Elise Wilson", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP5x18EliseWilson.png\n|name = Elise Wilson\n|status = Alive\n|diagnosis = *Postpartum depression\n*Psychotic episode\n*Eclamptic seizure\n|doctors = *[[Addison Forbes Montgomery]]\n*[[Jake Reilly]]\n*[[Sheldon Wallace]]\n|treatment = *Therapy\n*Medication\n|marital = [[Kurt Wilson]]\n|children = *Josie Wilson †\n*Max Wilson †\n*Daughter\n|only appearance = [[It Was Inevitable]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Grey's Anatomy)|5]]\n|portrayed by = [[Enid Graham]]\n}}\n\n'''Elise Wilson''' is the wife of Kurt Wilson. She murdered her first two children and had a third, who is in the care of Kurt.\n\n==History==\nElise was in jail. Sheldon came to speak with her as her doctor. She said that, like every other day, she felt like she was a monster because she'd murdered her two children. She was pregnant with her third when it happened.\n\nElise's husband, Kurt, was upset to learn that Sheldon was going to testify on her behalf. Jake said he'd called Sheldon in for a consult because Elise was on suicide watch. Kurt said that Elise had murdered their two children and should rot in jail.\n\nSheldon believed Elise had a psychotic break due to undiagnosed postpartum depression. Jake felt guilty because he'd helped Elise and Kurt conceive their second and third children. He noticed something was off with Elise during the second try, but he didn't step back.\n\nElise told Sheldon the story of what happened that day. Kurt was out on a business trip. Max was sick and Josie was upset that Elise couldn't give her the attention that she wanted. Both of them couldn't stop crying and they would wake up over and over again in the middle of the night. Elise was exhausted. So, she told them they were going to the park, got them dressed, and put them in their car seats. She said to them that she was going to get their snacks and went inside, leaving her two children in the running car to suffocate. Elise was sent to jail for that.\n\nSheldon explained to her that she'd had a psychotic break and he wanted her to understand that and wanted to help everyone else understand that. Elise said she didn't deserve it because she'd killed her children. While they are talking, Elise suddenly collapsed.\n\nAddison told Elise she'd had an eclamptic seizure. The baby was stable, but as soon as Elise was stable, Addison said she'd induce labor so Elise could give birth. She'd have a few moments with the baby before she'd be handed over to Kurt. Once she recovered, she'd be sent back to the jail.\n\nAddison delivered her baby at [[St. Ambrose Hospital]], where Kurt was waiting to whisk the baby away. Elise initially refused to look at her, but when Addison held her up by Elise's face, she apologized to the baby, but refused to name her and she was taken to Kurt.\n\nKurt held his daughter and then took her back into Elise's room so Elise could see her.\n\n==Relationships==\n===Romantic===\nShe is married to [[Kurt Wilson]].\n\n===Familial===\nHer daughter, Josie, was four when she died. She had red hair and freckles. Max was two and still in diapers.\n\n{{DEFAULTSORT:Wilson, Elise}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (Psych)]]"}]}}}}