{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51511": {"pageid": 51511, "ns": 0, "title": "Ellen Weston", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Other Characters Infobox\n|image = PP5x02EllenWeston.png\n|name = Ellen Weston\n|status = Alive\n|marital = [[Robert Weston]] ''(husband)''\n|children = *[[Matt Weston]]\n*Kip Weston †\n|only appearance = [[Breaking the Rules]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Private Practice)|5]]\n|portrayed by = [[Mary Chris Wall]]\n}}\n'''Ellen Weston''' is the mother of Kip Weston, whose cord blood was given to [[Kerri Gilbert]].\n\n==History==\nEllen and her husband, Robert, banked their kids' cord blood when they were born. Kip died in a car accident when he was six, but they kept his blood in case their other son, Matt, ever needed it. When [[Kerri Gilbert]] needed a cord blood transfusion, Cooper found that Kip was a match and approached the Westons about using Kip's blood. They wanted to continue to keep the blood for Matt, but Cooper said that since he was a teenager, it was unlikely he'd need it. He said they had the chance to spare another family the pain they'd gone through of losing a child.\n\nWhen Robert found out that Cooper had forged his signature and used the blood anyway, Robert threatened to sue the hospital and told Cooper he'd stolen the only thing they had left of Kip.\n\nIn order to avoid a lawsuit, Charlotte called the Westons in and talked to them about the new protocols they'd put in place to avoid a similar situation happened in the future. She walked them out just as [[Greg Gilbert]] was nearby. When he figured out who they were, he thanked them and hugged them. He offered to give them the chance to meet her, which they took.\n\n==Relationships==\n===Romantic===\nShe is married to [[Robert Weston]].\n\n===Familial===\nHer son, Kip, died in a car accident when he was six.\n\n{{DEFAULTSORT:Weston, Ellen}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]"}]}}}}