{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"74242": {"pageid": 74242, "ns": 0, "title": "Elliot (The Dark Night)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S192x13Elliot.png\n|name = Elliot\n|status = Deceased\n|children = [[Mila]]\n|job = Astronomer\n|only appearance = [[The Dark Night]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 2 (Station 19)|2]]\n|portrayed by = [[Sam Anderson]]\n}}\n\n'''Elliot''' is a man with terminal cancer who was evacuated from a building with a power outage.\n\n==History==\nAfter the power went out in the building where Elliot, who was on life-support, lived, his daughter, Mila, was left to do CPR on him while calling out for help. When station 19 arrived at the building to look for [[Penelope Hayes]], who was missing, she called out for their help and they found her and her father. They hooked up a generator to restore power to his machines and he quickly stabilized and then woke up, but asked why she didn't just let him die. She said he had terminal lung cancer and didn't want to die in a hospital, which is why he had all his machines set up at home. While talking to him, Ben suspected he might want a DNR and suggested it to him as an option, though Mila said he wasn't at that point yet and hadn't asked her to sign one as his power of attorney. Later, when they discovered a gas leak, they had to prepare him to be evacuated, which meant he'd have to be taken to the hospital, which he didn't want. The evacuation was then hastened when a resident lighting a cigarette sparked a fire. Elliot decided that since he didn't want to go to the hospital, he needed Mila to sign the DNR, which she did after he told her he wanted to die outside, watching the stars with her. They took Elliot outside and set out a blanket so he could lie on the ground with Mila. The firefighters also lay in the grass. When Elliot stopped responding, Ben checked on him and saw he had no pulse.\n\n==Relationships==\n===Familial===\nHe was very close to his daughter. He used his astronomy background to teach her about the stars as they lay outside at night.\n\n==Career==\nHe was an astronomer.\n\n==Notes and Trivia==\n*While he was being treated for his cancer, he would make up scenarios for worse ways to die than the one that was killing him.\n*He and his daughter lived in 515.\n\n{{DISPLAYTITLE:Elliot}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S2 Characters]]\n[[Category:Deceased Characters]]\n[[Category:S19 Rescuees]]"}]}}}}