{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51204": {"pageid": 51204, "ns": 0, "title": "Elliott", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x17Elliott.png\n|name = Elliott\n|status = Alive\n|marital = [[Lorraine (A Step Too Far)|Lorraine]] ''(wife, separated)''\n|other family = [[Claudine]] ''(sister-in-law)''\n|only appearance = [[A Step Too Far]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Kenneth Mitchell]]\n}}\n\n'''Elliott''' is the husband of [[Lorraine (A Step Too Far)|Lorraine]].\n\n==History==\nElliott's wife, Lorraine, came to see Pete. He examined her and she was shocked that after so much time, she was cancer-free and pain-free. Her husband and sister were her support group. Her sister, [[Claudine]], was even acting as a surrogate so that Lorraine and Elliott could have a baby. After Lorraine's exam, Claudine had abdominal pain, so Pete called in Addison to check her out.\n\nWhen Addison came to examine her, Pete was shocked to see Claudine and Elliott kissing. Elliott said it wasn't a tawdry affair. Before the cancer, things weren't great between him and Lorraine. Then the cancer happened and he and Claudine teamed up to take care of her. They spent a lot of time together and bonded over their shared experience. The feelings got stronger until they gave into them. Elliott planned to tell Lorraine after the baby was born. They were planning for him to leave Lorraine so they could be together.\n\nAddison said Claudine was in the very early stages of labor. Because her OB was out of town, she asked Addison to deliver the baby. She also refused to tell Lorraine about the affair. Lorraine had always wanted to be a mom, but Claudine didn't want kids. She only wanted to fall in love. It had never happened for her until Elliott.\n\nWhen the baby went into distress, Elliott comforted Claudine before she was taken for an emergency c-section, leading Lorraine to figure out they'd been having an affair. After the baby was delivered, Claudine had a lot of bleeding.\n\nAfter her surgery was completed, Addison told Claudine she'd had to perform a hysterectomy to stop the bleeding, meaning Claudine wouldn't be able to carry more children. Elliott then said they could take the baby and leave together.\n\nPete told Lorraine about their intentions and told Lorraine she needed to fight, to dig deep.\n\nAddison brought the baby to see Claudine, who asked Addison what she'd do in her position. Addison said if she was asking, Claudine could have the baby or Elliott, but not both.\n\nElliott and Claudine prepared to leave the hospital without talking to Lorraine. Lorraine confronted them and said she wanted the baby. Elliott said it wasn't hers and they'd go to court if necessary. Elliott tried to get Claudine to leave, but she said the baby wasn't hers. It was Lorraine's. She asked Lorraine for forgiveness, but Lorraine said she couldn't. They'd never been what they were before, but she could still be a good aunt to Lorraine's baby. Claudine then handed the baby over to Lorraine.\n\n==Relationships==\n===Romantic===\n====[[Lorraine (A Step Too Far)|Lorraine]]====\nElliott was married to Lorraine for eight years. They split when Lorraine learned that Elliott was having an affair with her sister.\n\n====[[Claudine]]====\nWhile they were working together caring for Lorraine, Elliott became close with her sister, Claudine, eventually falling in love with her.\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]"}]}}}}