{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"74089": {"pageid": 74089, "ns": 0, "title": "Ellie (Baby Boom)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S192x11Ellie.png\n|name = Ellie\n|status = Alive\n|parents = *Mother\n*Father\n|only appearance = [[Baby Boom]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 2 (Station 19)|2]]\n|portrayed by = [[Kyla-Drew Simmons]]\n}}\n\n'''Ellie''' is a girl who crashed an RV into station 19 trying to get help for her mother.\n\n==History==\nWhile she was on an RV trip with her mother, Ellie stepped in when her mother had a seizure. However, she drove into the side of station 19, causing significant damage. While some firefighters worked on her mother, Andy took Ellie aside to check her out. When she noticed that Ellie had an insulin pump, she checked her blood sugar, which was in the normal range. Then she took Ellie to a conference room, so they'd be away from where her mother was seizing. When her mother was stable, Ellie said she didn't want to go to the hospital with her, as she felt she ruined everything. She locked herself in the conference room, but then she collapsed, forcing Andy to break a window to get in. They determined that her pump was malfunctioning and her blood sugar was dangerously low, so they gave her glucose, which woke her up. After talking to Ellie about her own struggles growing up, Andy sent her to the hospital to be with her mom.\n\n==Relationships==\n===Familial===\nHer parents are in the process of getting divorced, which is why she and her mother were on the RV trip.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS192x11-3.jpg\nS192x11-10.jpg\n</gallery>\n\n{{DISPLAYTITLE:Ellie}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S2 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}