{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52858": {"pageid": 52858, "ns": 0, "title": "Emily Stinson", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP1x02-18.jpg\n|name = Emily Stinson\n|status = Alive\n|alias = Sarah Stinson\n|diagnosis = *Pelizaeus-Merzbacher disease\n*Failure to Thrive\n|doctors = [[Cooper Freedman]]\n|parents = *[[Duncan Stinson]]\n*[[Melinda Stinson]]\n|only appearance = [[In Which Sam Receives an Unexpected Visitor]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 1 (Private Practice)|1]]\n}}\n\n'''Emily Stinson''' born '''Sarah Stinson''' is a baby who was switched two days after birth with [[Sarah O'Brien]].\n\n==History==\nWhen Emily was born, her parents, Duncan and Melinda, named her Sarah. However, when she was two days old, while Duncan was holding her, she had a seizure. He decided to switch his daughter with [[Sarah O'Brien|Emily O'Brien]], who was in the nursery at the same time.\n\nEmily, now being raised by Greg and Beth O'Brien, continued to have serious neurological symptoms. Cooper decided to run some tests, which showed Pelizaneaus-Merzbacher disease. Greg and Beth were told that her symptoms could be treated, but there was no cure. She wouldn't live much beyond the age of five. Because it was genetic, Beth wanted to know if it was possible her sister might carry it because she was trying to get pregnant. However, the tests revealed that Greg and Beth weren't her biological parents. The doctors told them it was possible it was an innocent mixup, but their baby might also have been switched purposely.\n\nThey went to Charlotte, who found that only one other African-Amercan girl was in the nursery at the same time, but she refused to give them the name until after speaking with the hospital's lawyers. The hospital's lawyers said she needed to release the information to them. It was Duncan and Melinda, whom Naomi had helped conceive.\n\nShe called the Stinsons in and explained the situation to them. They and the O'Briens were told that according to California law, if the blood tests showed that their suspicions were correct, Emily would go live with the Stinsons and Sarah with the O'Briens. The tests confirmed that Emily was the Stinsons' and Sarah was the O'Briens'. Duncan Stinson was angry, saying he wanted his money back, after learning that the other baby in the switch, their baby, was sick. Melinda went to see Violet, saying she could take Sarah and run, but Violet said she wouldn't because Emily was her baby.\n\nAfter reviewing the visitations records at the hospital, the doctors figured out that Duncan had switched the babies intentionally after Emily had a seizure when she was two days old. Duncan confessed that they'd done it because he wanted a healthy child. Melinda was shocked that he'd given her baby away.\n\nThey set up a trade and Melinda gave Sarah to the O'Briens and took Emily with her. Melinda and Beth gave each other tips on their respective babies. When Beth struggled, Melinda encouraged her to look at Sarah and embrace her. Beth slowly looked down at her and said hi. Greg said he thought he couldn't watch Emily die and then found he couldn't watch her leave.\n\n==Relationships==\n===Familial===\nShe was born to Duncan and Melinda Stinson, who named her Sarah. However, her father switched her with [[Sarah O'Brien|Emily O'Brien]] when she was two days old and she started living with the O'Briens. Cooper worried about Greg O'Brien's connection to Emily, thinking he was disconnected from his child. When they were nine months old, the girls were switched back and Melinda started to raise Emily alone after Duncan was arrested for switching the girls.\n\n==Notes and Trivia==\n*She hates needles.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP1x02-8.jpg\nPP1x02-9.JPG\nPP1x02-13.jpg\nPP1x02-14.jpg\nPP1x02-17.jpg\nPP1x02-18.jpg\nPP1x02-22.JPG\nPP1x02-26.JPG\n</gallery>\n\n{{DEFAULTSORT:Stinson, Emily}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S1 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Genetics)]]\n[[Category:Patients (Neuro)]]\n[[Category:Patients (Peds)]]"}]}}}}