{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51021": {"pageid": 51021, "ns": 0, "title": "Emily Wendel", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x10-10.jpg\n|name = Emily Wendel\n|status = Alive\n|diagnosis = *Pregnancy\n*Drug addiction\n*Hypertension\n|doctors = *[[Addison Forbes Montgomery]]\n*[[Pete Wilder]]\n*[[Violet Turner]]\n|treatment = *Labetalol\n*C-section\n|only appearance = [[Just Lose It]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Gaby Hoffmann]]\n}}\n\n'''Emily Wendel''' is a drug addict who had gotten pregnant several times while on drugs.\n\n==History==\nEmily came into the ER, with hypertension and early labor. She came in pregnant every 10 months like clockwork. She had a history of pre-eclampsia and drug use. Each time she came in, they offered her rehab and therapy and long-term birth control options, and when she refused, they offered her $50 and in exchange, she'd sign over the rights to the baby. They prepared to do that again.\n\nAddison examined her and said that belay was breech, so she needed to have a c-section. Emily said that she'd gotten clean and had been clean for the entire pregnancy and she wanted to keep the baby, who was healthy, despite not getting prenatal care. She'd given birth four prior times and each kid was disabled. Three were in foster care and one had died.\n\nWhen Addison came to check on Emily, she said she wanted her tubes tied, but Addison suspected Pete had bribed her. Pete admitted to offering her $250 to agree to have her tubes tied.\n\nAddison did her c-section, but didn't tie Emily's tubes. When they told Emily about it, she said she needed the money, so Addison needed to tie her tubes. Violet offered her $250 for nothing and then asked if she still wanted her tubes tied. Violet then asked if she'd sign over the baby for the $250. Emily said she was healthy, so she was worth $500 and agreed to sell her for $500. Violet left without paying her.\n\nAddison brought the baby to her. She offered her help with the baby or $1000 to sign her rights over. She signed the papers and took the money, refusing even to see the baby.\n\n==Notes and Trivia==\n*She likes Pete.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP4x10-1.jpg\nPP4x10-6.jpg\nPP4x10-10.jpg\nPP4x10-11.jpg\nPP4x10-13.jpg\nPP4x10-15.jpg\nPP4x10-16.jpg\n</gallery>\n\n{{DEFAULTSORT:Wendel, Emily}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Psych)]]"}]}}}}