{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"74154": {"pageid": 74154, "ns": 0, "title": "Emmanuelle", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S192x12Emanuelle.png\n|name = Emmanuelle\n|status = Alive\n|alias = Em\n|marital = [[Josh (Station 19)|Josh]] ''(husband)''\n|children = Blueberry\n|only appearance = [[When It Rains, It Pours!]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 2 (Station 19)|2]]\n|portrayed by = [[Christine Lakin]]\n}}\n\n'''Emmanuelle''' is a woman who was in a car accident while in labor.\n\n==History==\nEmmanuelle was in labor and her husband was driving her to the hospital in a rain storm when their van was struck by lightning and flipped over several times. Luckily, Vic saw the accident happen and quickly pulled over to help. Josh stumbled out of the car with an injured shoulder and dilated pupils, but told Vic he was okay and she should help Emmanuelle, who was pinned in the car. Vic climbed into the car with her and started to coach her through her labor until she stopped getting responses from Josh and found that he was passed out in the road. He quickly woke up and rejoined them at the car. Shortly after, Vic found that Emmanuelle was crowning. She helped Emmanuelle, but they were distracted by the smell of gasoline. Josh looked and saw that a fire had started and gas was leaking. Vic instructed him to take the fire extinguisher and put out the flames. As he did that, Emmanuelle gave birth to their child. Just then, the rest of Station 19 arrived to help. Vic handed off the baby and they rushed to get Emmanuelle freed from the car. Once she was out, they put her and the baby in the ambulance. Josh asked Ben to reduce his shoulder in the field so he could go see them. He did so and the family was reunited before being taken to the hospital.\n\n==Relationships==\n===Romantic===\nShe is married to [[Josh (Station 19)|Josh]]. It was raining the day they met. He'd given up on dating and then he met Emmanuelle by running into her in the flower stand at Pike Place Market. On their fifth date, they had a loud, messy, public fight and that's when he says he knew she was the one.\n\n===Familial===\nShe and her husband have a daughter. They started calling her Blueberry while Emmanuelle was pregnant because they didn't know her sex.\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S2 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}