{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"77408": {"pageid": 77408, "ns": 0, "title": "Emmett Dixon", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Other Characters Infobox\n|image = S193x14-22.jpg\n|name = Emmett Dixon\n|status = Alive\n|parents = *[[Michael Dixon]]\n*[[Kitty Dixon]]\n|marital = [[Alicia]] ''(ex-fiancée)''\n|job = '''Current'''<br>Civilian Assistant\n'''Former'''<br>Contact Tracer<br>Firefighter\n|workplace = '''Current'''<br>Crisis One\n'''Former'''<br>[[Grey Sloan Memorial Hospital]]<br>[[SFD Station 19]]\n|first appearance = [[Satellite of Love]]\n|last appearance = [[Alone in the Dark]]\n|count = 28\n|seasons = '''[[Station 19|S19]]:''' [[Season 3 (Station 19)|3]], [[Season 4 (Station 19)|4]], and [[Season 5 (Station 19)|5]]\n|portrayed by = [[Lachlan Buchanan]]\n}}\n'''Emmett Dixon''' is a former firefighter and son of former corrupt Fire Chief [[Michael Dixon]].\n\n==History==\n===First Day===\nOn the morning of his first day at station 19, he hooked up with Travis, after having slept with him the previous night as well. Travis was surprised to see him when he came into the station later that morning. When the first call came in, he wasn't quick enough getting into his turnouts and into the truck, so he was left behind and got put on desk duty. He was surprised to see [[Joe (Satellite of Love)|Joe]] wandering around the station, eating the food, showering, and sleeping there. He tried to get Joe to leave, saying it would look bad for him if he couldn't get Joe to leave, but Joe listed his own problems, including homelessness and loneliness, and said Emmett's problem wasn't a real problem.\n\nHe ended up going to Sullivan to tell him about Joe and get him to leave, but found Sullivan passed out on his office floor. He saw the fentanyl vial and went to get and administer naloxone. When Sullivan didn't immediately wake up, he called his father's number, but hung up quickly when Sullivan jolted awake. Sullivan then said he had a prescription for that medication and that dizziness was a side-effect. He then told Emmett that the station runs on trust in order to get him not to tell anyone about the overdose. ''(\"[[Satellite of Love]]\")''\n\n===First Call===\nEmmett later went out on a call in which a truck hit some motorcyclists. When they discovered the driver, Maya called him over to have him intubate. With difficulty, he eventually got the tube in. Maya told him he took too long and that'll cause brain damage, but Travis stepped in and said that would be true only if the driver had any chance of survival in the first place, which he didn't. Emmett was upset that Maya had him intubate a dead guy, but Travis said that's how you learn to do intubations in high-pressure situations.\n\nAfter the call was over, Emmett went with other firefighters to get drinks. He was shocked to hear them making jokes about the carnage, but they said that's how they cope and keep doing the work day after day. ''(\"[[Born to Run]]\")''\n\n===Kyle Rexton===\nEmmett went out with the team on a call in which [[Kyle Rexton]] was holding a knife on a shop owner. He and Travis were tasked with securing the perimeter and moving bystanders back to a safe distance. He chafed at this but did it. Then they were sent to clear out the adjacent buildings. After that was done, they were instructed to clear nearby houses. Emmett was upset with being put in danger like that and wondered when they would start saving their own lives. Travis called him out, saying he was used to getting whatever he wanted, but he was failing at this job. His father later tried to force Maya to move him to safety, but she refused, saying it was her team. After the call was over, Emmett shared with Travis that he was an Art History major until his father forced him to go to the Fire Academy. Travis called him out for that, saying people would die unnecessarily, because he's doing a job he's not cut out for. ''(\"[[Poor Wandering One]]\")''\n\n===Lunch with Alicia and Five-Alarm Fire===\nOn their day off, Emmett and his father showed Emmett's girlfriend, [[Alicia]], around the station and had lunch together. When they ran into Travis at the station, they invited him to join them. At lunch, Alicia told how she and Emmett had met in college and then re-met after graduation. She also showed off some of his artwork, which Travis liked. All throughout their lunch, they heard reports of a fire that was worsening as time went on. Chief Dixon was then called away to make an appearance at the fire at the request of the mayor. After he left, Travis retrieved his headphones, but before he could go home and enjoy his day off, the fire was upgraded to five-alarm and he and the whole team was called out. As they got ready to leave, Travis confronted Emmett for stringing Alicia along and said never to speak to him again if he didn't tell her the truth and set her free. Once they were dressed, they went to the scene of the fire, where Chief Dixon told them not to get killed and sent them in to work. ''(\"[[No Days Off]]\")''\n\n===Storage Facility Fire===\nEmmett responded to a call when a band became trapped in a storage facility. They rescued the band, but learned they'd started a fire. Emmett and Travis put out the fire, but discovered it had spread to neighboring units. They exited the building and were sent to the roof to ventilate, but before they could, Travis learned the roof was too unstable for that, so they were sent back inside to find and evacuate people. After everyone was evacuated, they decided to pull out all firefighters. But since they hadn't been able to ventilate, visibility was low and they were unable to find an exit. Emmett started to panic and hyperventilate, so Travis had to calm him down and shared his oxygen tank with him. They remained trapped until Pruitt went on the roof and ventilated, improving visibility and allowing them to get enough air to exit. When they got outside, they learned what had happened. ''(\"[[I'll Be Seeing You]]\")''\n\n===Engagement Party, Trapped Teens, and Coming Out===\nAlicia proposed to Emmett and they became engaged. The rest of the team found out when his father announced it and invited them to his country club to celebrate the engagement. Later that same day, Emmett helped Ben free two teens who were handcuffed to each other. The girl, [[Dara Agate]], then started seizing. After they got her to stop, the learned she had epilepsy, but took off her bracelet when she was with [[Tamil]] because she didn't want him to know it. Remembering that the apartment worked on trust and knowing he didn't want to be the person who kept his life hidden, Emmett decided to come out to the team. They easily accepted him, but told him he should tell Alicia. Vic then convinced Emmett and the others to pose for the calendar she was putting together to raise money to pay for Pruitt's funeral. ''(\"[[Dream a Little Dream of Me]]\")''\n\n===Bowling Alley Fire===\nEmmett went with the rest of the team to respond to a fire at a bowling alley. When they arrived, they were put on Search and Rescue. When Andy radioed out for additional help evacuating some kids, Maya told Emmett and Jack to go in. Emmett froze and said he couldn't. Maya became angry and told him to go to triage and stay out of her sight. When the call was over and they returned to the station, the team fought over who would have to be on garlic duty. Maya overheard their fighting and ordered Emmett to garlic duty or suspension. He chose garlic duty. ''(\"[[The Ghosts That Haunt Me]]\")''\n\n===Work with PRT and Quitting===\nFresh of a 24-hour shift, Maya volunteered Emmett to drive for the PRT, saying he'd spent his whole shift on the desk so he should be well-rested. PRT responded to an MVC, but weren't needed, so they went on to respond to a stabbing in Humboldt Park. They picked up the man who had bene stabbed and moved him into the PRT. As Ben and Jackson prepared to operate, they sent Emmett up to the front to make sure he knew the way to the hospital. When he got into the cab, he was shocked to see [[Melly Wyatt]] climb in beside him and pull out a gun, demanding that he drive. He did so, over Ben and Jackson's objections. He pretended everything was find and he just misunderstood their instructions and was looking for a safe place to stop. Melly finally let him stop the PRT and led him to the back, where he opened it up. She threatened to shoot him if they didn't give her all the painkillers they had. Ben tried to pretend they didn't have any, but she wouldn't back off. Emmett climbed into the PRT to get the drugs, but tripped on his way up, startling Melly, who fired the gun and hit Jackson in the calf. Emmett then retrieved the painkillers when Ben gave him the access code. Once she had the drugs, Melly took off but was hit and killed by a car driving past. Emmett tried to radio the call in, but he was shaking too hard, so Jackson did it. He then rode with them to the hospital to drop off Jackson so his leg could be treated. Later that night, he found Travis at the bar and told him he'd come out to his father and quit his job, saying he wasn't meant to be a firefighter. ''(\"[[Bad Guy]]\")''\n\n===Sullivan's Hearing===\nEmmett returned to the station for Sullivan's hearing to determine if he would be able to continue being a firefighter. He testified to what happened the day Sullivan overdosed, including that he didn't report the overdose at Sullivan's request. ''(\"[[We Are Family]]\")''\n\n===Contact Tracing and Testing===\nEmmett continued his work doing testing and contact tracing for the hospital. When [[Marsha Smith|Marsha]] came into the hospital with likely COVID, he tested both Jack and Marcus for the virus given their contact with Marsha. Owen fast-tracked their results, which Emmett said was wrong, but understandable. ''(\"[[Don't Look Back in Anger]]\")''\n\nEmmett came to the station to test all the firefighters. While he was there, he talked to Travis and Vic about Vic's secret firefighter crush. As Emmett went to leave, he asked if Travis had been dating and Travis said finding his dad on there had soured things significantly. Emmett shared a story with Travis of Alicia finding a picture of some guy's junk on his phone. He passed it off as a guy from school playing a joke on him, and she believed him. It taught him that people are really good at lying to themselves for self-preservation. When Travis's father came to the door, Emmett excused himself and left early in the conversation. ''(\"[[Learning to Fly]]\")''\n\nWhen Marsha was due to be released from the hospital, Jack took the day off so they could pick her up and have a celebratory dinner. However, as they were getting ready to leave, Emmett called Jack and told him not to come as Marsha had taken a turn and wouldn't be released that day. He said Jack hadn't gotten a call because her son was her emergency contact, though he didn't know if her son had even answered the call. ''(\"[[Make No Mistake, He's Mine]]\")''\n\n===Travis and Vic's Fight and Community COVID Testing===\nWhen Travis and Vic fought over her relationship with Theo, Emmett encouraged Travis to give Vic a break, warning him that it would be a lonely life if he didn't try to get over it. ''(\"[[No One is Alone]]\")''\n\nWhen they finally made up, Travis said he was glad to see them back to themselves. Travis in turn said he realized Emmett was right about him needing to move on and said he was ready to do that. Emmett then helped out with with drive-thru testing at the station. ''(\"[[Save Yourself]]\")''\n\nEmmett came to Travis and Vic's place one morning with pastries and warned them that his father was on his way to the station. ''(\"[[Here It Comes Again]]\")''\n\n===Maya and Carina's Wedding===\nEmmett attended Maya and Carina's Wedding at [[Kaminski's]]. After the ceremony, he ran into Travis in the bathroom, where Travis admitted that he had feelings for Emmett that he wasn't prepared to face before, but was ready for now. Emmett said he enjoyed their friendship and wouldn't survive being hurt by Travis a second time. He then went to leave, but quickly turned around and kissed Travis. ''(\"[[Forever and Ever, Amen]]\")''\n\n===Phoenix Fair===\nEmmett came to the Phoenix Fair. At the fair, he planned to ride in the Undies bike race, but chickened out and put his shorts back on. When [[Brad DiMarco]] became injured when a firework went off in his face and the firefighters were forced to transport him to the hospital on foot, Emmett led the way on his bike, clearing the path for them. ''(\"[[Phoenix from the Flame]]\")''\n\n===Crisis One===\nEmmett trained as a civilian to work with the pilot program Dean started to respond to non-violent situations with unarmed responders. On their first day, they got a call to do a wellness check on a mother and daughter who had had 25 hangups with 911 in the last three days. Emmett met Vic and Dean at the apartment, where they were let inside by the landlord. They found [[Alysha]] and [[Ms. Debbie]], a mother and daughter. Debbie had multiple sclerosis and depended on the help of her daughter, who cooked and cleaned and took care of her needs. However, Alysha had started having psychiatric symptoms, which had worsened in the last few days, to the point where she feared for their safety. Emmett used his training to get Alysha to unlock the door, pretending Debbie needed medication. Once the door was unlocked, they forced their way inside and restrained Alysha to keep her from going out the window as she'd promised to do. When she fought against restraints, they were able to convince her to let them sedate her instead. Once she was sedated, they carried both mother and daughter downstairs and put them in aid cars. Emmett explained that Alysha would be admitted to the hospital for 72 hours and there were ways for her to get treatment even though they couldn't afford to pay. He also offered services to help Debbie. Debbie thanked him for treating her like a human being. Emmett then rode with Alysha to the hospital and they discussed how they could improve the program. ''(\"[[Can't Feel My Face]]\")''\n\nThe next call Emmett helped respond to was [[Myles Anthony Trudeau]], an autistic man who was refusing to leave a city bus at the end of its route. Emmett helped control the crowd outside while Jack talked to Myles. ''(\"[[100% or Nothing]]\")''\n\n===Gas Main Explosion===\nEmmett was at the station looking for Travis when he ran into Carina, who was using the gym. She informed him that the team was out on a call. They shared the worry that comes with loving firefighters and when Carina got a text asking her to come to the scene to treat a pregnant woman, Emmett went with her. When they arrived, Emmett stepped in to help treat Vic, who had been electrocuted. He then told Travis there were some aid cars stuck in gridlocked traffic just down the street, leading to them carrying Vic to one so she could go to the hospital. ''(\"[[Things We Lost in the Fire (Station 19)|Things We Lost in the Fire]]\")''\n\n===Thanksgiving===\nEmmett joined station 19 for Thanksgiving dinner. When Travis was distressed over his father's continued affair, Emmett tried to balance him out and encourage him to be more understanding of where Paul was. Instead, Travis pushed Paul until he came out to Nari at the station and confessed his affair.\n\nEmmett later joined the members of station 19 and their families for Thanksgiving dinner, provided by station 23 after their original meal was destroyed when a small kitchen fire activated the sprinklers. ''(\"[[Little Girl Blue]]\")''\n\n===Christmas Celebration and Helping Amy===\nAbout a week before Christmas, Emmett decided he couldn't wait any longer to give Travis his Christmas gift, so he gave him a portrait he'd painted of Travis in bed. Later that day, he responded, along with Jack and Vic, to a Crisis One call. When they arrived, he told them Dispatch got a call about a woman who seemed to be having an anxiety attack. They went inside the house and found [[Amy]], who was breathing heavily in her kitchn, where a pan of eggs had been thrown to the ground. They turned off her stove and then tended to Amy. They quickly figured out that her husband, [[Greg (Season 5)|Greg]], was abusive and she'd actually made the call herself to buy her some time for him to calm down. They agreed that it was beyond what they could handle, so they needed to call the police. While Jack was calling police, Vic impulsively took Amy's son and tried to get her to leave. When police arrived, they found bruises on Amy and arrested Greg. Emmett then checked out Vic in the aid car, as her heart monitor had gone off. Vic then helped Amy pack and call her cousin in Portland.\n\nAfter the call, Emmett went back to the station, where they were wrapping presents to pass out to community members who might not be able to afford any. He celebrated when Maya and Carina announced they were going to start trying to have a baby. ''(\"[[All I Want for Christmas is You]]\")''\n\n===Harry and Conflict with Travis===\nEmmett arrived on the scene when neighbors called to report [[Harry (Season 5)|Harry]] yelling and pacing in his front yard. Travis took the lead on the call, talking to Harry while Andy and Emmett observed. Emmett was shocked when Travis admitted that he was falling out of love with Emmett like Harry's wife had done with him without giving Emmett any warning. After this, Emmett ignored Travis's calls. ''(\"[[The Little Things You Do Together]]\")''\n\nThings remained tense between Emmett and Travis after that, including when they responded to a Crisis One call together. Emmett arrived after Vic and Travis at a property owned by [[Virginia]], who said her tenant hadn't paid the last two months' rent and she wanted him removed from the property. They got not response when they knocked, so they pried open the door and found the tenant, Alan, long dead, likely because he was unable to afford his insulin. Vic and Travis were called away to a fire, leaving Emmett to wait for the police and fill out the report. The next morning, Emmett came to Travis's house and told him he hadn't been able to sleep the previous night because he couldn't stop thinking about them. He told Travis he forgave him and wanted to forgive what Travis had said and move forward. ''(\"[[Cold Blue Steel and Sweet Fire]]\")''\n\n===His Father's Birthday Dinner===\nEmmett and Travis came over on Dixon's birthday to have dinner. While they were looking through old photos of Emmett, Dixon shifted the conversation to SFD, which he believed needed more conservativism. Travis challenged him, but they were cut off by Kitty and Emmett calling them for dinner. They ate in awkward silence until Kitty brought up Alicia and her desire to have grandchildren. This led to even more awkwardness, then Dixon talking about his plans to run for mayor and his plan to shut down Crisis One if he were elected. He and Travis argued about it while Kitty tried to get them all to eat cake and Emmett told Travis it wasn't worth it. During this argument, Dixon accused Travis of taking Emmett off his path and making him gay. Emmett said that Travis hadn't made him gay. Travis stood up for Emmett, leading Emmett to say that he didn't need Travis to fight his battles. Travis said he did because it was the first time all night he'd stood up to his father. Travis and Emmett then talked outside. Travis apologized and Emmett said they both knew they shouldn't be together. He then told Travis he'd gotten into an art program in Italy. Travis said he really did care about Emmett, but they still said goodbye. ''(\"[[Alone in the Dark]]\")''\n\n==Relationships==\n===Romantic===\n====[[Travis Montgomery]]====\nHe met and hooked up with Travis Montgomery before Travis knew he was a firefighter. ''(\"[[Satellite of Love]]\")'' Despite this, when Travis tried to talk to him about it, he said he has a girlfriend. Travis left, defeated. ''(\"[[Born to Run]]\")''\n\nLater, Emmett came to Travis's apartment after working and started kissing him. Travis kissed him back and pulled him inside. ''(\"[[Something About What Happens When We Talk]]\")''\n\nAfter meeting Alicia, Travis told Emmett they were done because he hated what Emmett was doing to Alicia. ''(\"[[No Days Off]]\")'' Emmett told Travis he didn't want things to be over between them. ''(\"[[I'll Be Seeing You]]\")''\n\nAfter quitting his job as a firefighter, Emmett continued to have sex with Travis. While they were celebrating a successful call, Emmett took Travis outside and told him he loved him. Travis said he didn't feel the same, upsetting Emmett. ''(\"[[Louder Than a Bomb]]\")''\n\nLater, when Emmett returned to the station to testify at Sullivan's hearing, Travis approached him and asked if they could be friends, saying he needed more gay friends. ''(\"[[We Are Family]]\")''\n\nThey continued their friendship until Maya and Carina's wedding, where Travis admitted that he had feelings for Emmett and wasn't scared of them anymore, leading them to share a kiss. ''(\"[[Forever and Ever, Amen]]\")''\n\nAfter the wedding, they continued to see each other happily, despite Travis's fear that he was just setting himself up for more pain. ''(\"[[Phoenix from the Flame]]\")''\n\nSeveral months into their relationship, Emmett asked Travis to consider moving his wedding photo out of the bedroom so he didn't have to look at Michael every time they had sex. Travis, distracted by his parents, brushed off the request, upsetting Emmett. Later at the gas main explosion, Travis said he'd move the picture. ''(\"[[Things We Lost in the Fire (Station 19)|Things We Lost in the Fire]]\")''\n\nThings hit a snag when, while on a call, Travis admitted to a stranger that he was falling out of love with Emmett without giving Emmett a warning or a chance to fix things. Travis tried calling Emmett later, but Emmett ignored all of his calls. ''(\"[[The Little Things You Do Together]]\")''\n\nEmmett continued to ignore all his calls and texts. Finally, Emmett came to the station and said he couldn't respect himself if he stayed with Travis and asked Travis to stop trying to talk to him. ''(\"[[In My Tree]]\")''\n\nNot long after this, Travis and Emmett responded to a Crisis One call together. The next morning, Emmett came over and told Travis he forgave him for what he'd said and wanted to move forward together. ''(\"[[Cold Blue Steel and Sweet Fire]]\")''\n\n====[[Alicia]]====\nHe and Alicia have been together for six years and first met in college, in an Art History class. ''(\"[[No Days Off]]\")''\n\nThey later became engaged. ''(\"[[Dream a Little Dream of Me]]\")'' After Emmett came out to his team, he ended the engagement. ''(\"[[Bad Guy]]\")''\n\n===Familial===\n====[[Michael Dixon]]====\nHis father was the Fire Chief after Ripley. Emmett hid his true self because he felt his father would not approve of him. Dating Alicia and joining the Fire Academy was just to please his dad. He struggled with his identity because of the way he was raised. After a difficult call, Emmett came out to his dad and quit his job as a firefighter. ''(\"[[Bad Guy]]\")''\n\nAfter he came out to his father, his father refused to speak to him. ''(\"[[We Are Family]]\")''\n\n==Career==\nHe was a firefighter at station 19. His father says he's not a natural talent, but he works hard. He struggled from his very first day to keep up with the other firefighters. ''(\"[[Satellite of Love]]\")'' He quickly panicked when he and other firefighters became trapped in a burning building. ''(\"[[I'll Be Seeing You]]\")'' After that incident, he refused to enter a bowling alley that was on fire out of fear. ''(\"[[The Ghosts That Haunt Me]]\")'' After being held at gunpoint by a woman seeking drugs, he decided to quit his job as a firefighter. ''(\"[[Bad Guy]]\")''\n\nAfter quitting the fire department, he got a job at [[Grey Sloan Memorial Hospital]], doing contact tracing during the coronavirus pandemic. ''(\"[[We Are Family]]\")''\n\n==Notes and Trivia==\n*He was raised Catholic.<ref>[[Satellite of Love]], 3x07 (S19)</ref>\n*He failed the written exam to become a firefighter.<ref>[[Bad Guy]], 3x15 (S19)</ref>\n*He loved playing dress-up as a child and was particularly obsessed with his mother's high-heeled leather boots.<ref>[[Alone in the Dark]], 5x14 (S19)</ref>\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nS193x07EmmettDixon.png|[[Satellite of Love]]\nS193x08EmmettDixon.png|[[Born to Run]]\nS193x09EmmettDixon.png|[[Poor Wandering One]]\nS193x10EmmettDixon.png|[[Something About What Happens When We Talk]]\nS193x11EmmettDixon.png|[[No Days Off]]\nS193x12EmmettDixon.png|[[I'll Be Seeing You]]\nS193x13EmmettDixon.png|[[Dream a Little Dream of Me]]\nS193x14EmmettDixon.png|[[The Ghosts That Haunt Me]]\nS193x15EmmettDixon.png|[[Bad Guy]]\nS193x16EmmettDixon.png|[[Louder Than a Bomb]]\nS194x03EmmettDixon.png|[[We Are Family]]\nS194x04EmmettDixon.png|[[Don't Look Back in Anger]]\nS194x07EmmettDixon.png|[[Learning to Fly]]\nS194x08EmmettDixon.png|[[Make No Mistake, He's Mine]]\nS194x09EmmettDixon.png|[[No One is Alone]]\nS194x10EmmettDixon.png|[[Save Yourself]]\nS194x11EmmettDixon.png|[[Here It Comes Again]]\nS194x16EmmettDixon.png|[[Forever and Ever, Amen]]\nS195x01EmmettDixon.png|[[Phoenix from the Flame]]\nS195x02EmmettDixon.png|[[Can't Feel My Face]]\nS195x04EmmettDixon.png|[[100% or Nothing]]\nS195x05EmmettDixon.png|[[Things We Lost in the Fire (Station 19)|Things We Lost in the Fire]]\nS195x06EmmettDixon.png|[[Little Girl Blue]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS193x07-1.jpg\nS193x07-2.jpg\nS193x07-3.jpg\nS193x07-5.jpg\nS193x07-6.jpg\nS193x07-34.jpg\nS193x08-7.jpg\nS193x08-8.jpg\nS193x08-28.jpg\nS193x08-29.jpg\nS193x08-30.jpg\nS193x08-31.jpg\nS193x08-34.jpg\nS193x08-35.jpg\nS193x08-36.jpg\nS193x08-37.jpg\nS193x08-38.jpg\nS193x08-39.jpg\nS193x10-25.jpg\nS193x10-26.jpg\nS193x10-27.jpg\nS193x10-28.jpg\nS193x10-29.jpg\nS193x10-30.jpg\nS193x13-17.jpg\nS193x13-18.jpg\nS193x13-19.jpg\nS193x13-20.jpg\nS193x13-21.jpg\nS193x13-23.jpg\nS193x13-66.jpg\nS193x13-67.jpg\nS193x14-5.jpg\nS193x14-6.jpg\nS193x14-22.jpg\nS193x14-34.jpg\nS193x16-28.jpg\nS193x16-29.jpg\nS193x16-30.jpg\nS193x15-47.jpg\nS193x15-48.jpg\nS193x15-50.jpg\nS193x15-51.jpg\nS193x15-52.jpg\nS193x15-54.jpg\nS194x03-7.jpg\nS194x03-14.jpg\nS194x03-15.jpg\nS194x03-16.jpg\nS194x03-19.jpg\nS194x04-16.jpg\nS194x04-19.jpg\nS194x04-20.jpg\nS194x04-25.jpg\nS194x07-3.jpg\nS194x07-4.jpg\nS194x16-7.jpg\nS194x16-8.jpg\nS194x16-9.jpg\nS194x16-11.jpg\nS194x16-13.jpg\nS194x16-17.jpg\nS194x16-26.jpg\nS195x06-8.jpg\nS195x06-9.jpg\nS195x06-10.jpg\nS195x08-1.jpg\nS195x08-2.jpg\nS195x08-4.jpg\n</gallery>\n\n==Appearances==\n{{Emmett Dixon Appearances}}\n{{Scrollbox}}\n\n[[de:Emmett Dixon]]\n\n{{DEFAULTSORT:Dixon, Emmett}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S3 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:S19 S5 Characters]]"}]}}}}