{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"12664": {"pageid": 12664, "ns": 0, "title": "Erica Warner", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PP5x17-21.jpg\n|name = Erica Warner\n|status = Deceased\n|parents = Mother †\n|children = [[Mason Warner]]\n|first appearance = [[Deal With It]]\n|last appearance = [[It Was Inevitable]]\n|count = 14\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Private Practice)|5]]\n|portrayed by = [[A.J. Langer]]\n}}\n\n'''Erica Warner''' is the mother of [[Mason Warner]].\n\n==History==\n===Pregnancy===\nErica had a one-night stand with Cooper in her car and got pregnant. She thought about calling him but she was too scared since she thought it could've been possible Cooper wasn't the father and then they'd been stuck in each other's lives.\n\n===Finding Cooper===\nOne day, Erica approached Cooper at Seaside Health and Wellness, the practice where he works. He initially didn't recognize her. Erica reminded him who she was and showed him Mason, their son. ''(\"[[Deal With It]]\")''\n\nHe was shocked and asked if she was sure. When she said she was, Cooper asked why she had come now. Erica said Mason had been asking about him and he was too old to be distracted. She suggested he give Mason a checkup as a start. He impressed Mason with a magic trick. They later hung out at the pier, but Erica told Cooper she wasn't ready for Mason to know that Cooper was his father.\n\n===Meeting up with Charlotte===\nCharlotte, unconvinced that Erica was telling the truth, met up with her and wrote her a check, telling her to come to her again if she needed more money, but to stay away from Cooper. Erica was supposed to bring Mason to see Cooper that night, but she didn't show up. She came in the next day, giving Cooper the check back and saying she wasn't a whore. Cooper told her that he didn't do it and said he'd make it right. A paternity test confirmed that Cooper was Mason's biological father. ''(\"[[Remember Me]]\")''\n\n===Having Mason Bond with Cooper===\nAfter the incident with Charlotte, Erica decided to set ground rules for the time they spent together. She said Charlotte wasn't allowed around Mason and she didn't want Cooper to tell Mason he was his father. In order to get to see him, those were her conditions. The three of them went fishing together and Mason asked Cooper if he was dating Erica. Cooper said he wasn't.\n\nMason decided he didn't want to keep seeing Cooper. When Cooper talked to him later, Mason asked if Cooper was his dad. Mason said they couldn't be friends if he was not going to be around, like the other guys. They told Mason Cooper was his dad and Cooper said he wasn't going anywhere. ''(\"[[Step One]]\")''\n\nAs Mason and Cooper bonded, Erica maintained that she didn't want Mason to be around Charlotte. When she came to pick Mason up at the end of the day and found Charlotte there, she was upset and left abruptly. She later came to see Cooper and said that she had realized that Charlotte wasn't a bad person. ''(\"[[Don't Stop 'Till You Get Enough]]\")''\n\n===Mason's Play===\nMason had a part in James and the Giant Peach at his school. Cooper helped him rehearse and promised to go see the show. Erica was working backstage with the kids on costumes. When Cooper had to miss the play to take care of a patient, she told him he covered well, but he didn't believe her. ''(\"[[The Breaking Point]]\")''\n\n===Thanksgiving===\nShe and Mason went to Thanksgiving dinner at Addison's house along with the other doctors in the practice. ''(\"[[The Breaking Point]]\")''\n\n===Brain Tumor===\nErica visited Cooper and Mason, who were drinking milkshakes in the practice's kitchen. Amelia, who was also in the kitchen, noticed Erica's hand shaking. Erica picked up a milkshake glass and suddenly dropped it due to the weakness in her hand.\n\nThis made Amelia suspicious. She stitched up Erica's cut finger and offered to give Erica a neuro work up, but she refused. Amelia told Charlotte about her suspicions, so Charlotte called a clinic Erica had been to recently and had them courier over her most recent brain scan, which revealed that she had a massive gliosarcoma.\n\nWhen confronted by Charlotte, Erica admitted that she had gone to numerous surgeons, all of whom had determined the tumor to be inoperable. Erica didn't want to tell Cooper, but after Charlotte pressured her, she did. ''(\"[[The Standing Eight Count]]\")''\n\nCooper had papers drawn up to ensure that if Erica died, Mason would go to Cooper. Erica was reluctant to sign it. Cooper figured out she hadn't reached acceptance, which meant she still had hope. He told her not to waste it. She agreed to see Amelia to look into options. Amelia did new tests and said that the best they could do was aggressive radiation therapy and chemotherapy to slow the growth. It could give her about six months and it would be rough. She decided she didn't want to try it, but Cooper said that without it, she'd miss Mason's next birthday. It's not much time, but another birthday with his mom would mean a lot to Mason. Erica went to Amelia and asked if she'd do chemotherapy and radiation if she were in Erica's shoes. Amelia admitted that she wouldn't do the treatment. Erica took the paperwork back to Cooper and said they'd sign it tomorrow. Cooper was upset that she was giving up. ''(\"[[Losing Battles]]\")''\n\n===Car Accident===\nSoon after that, Erica and Mason were brought to the ER after being in a car accident. She was disoriented after the accident and Mason said she'd fallen asleep at the wheel. Amelia ran tests and determined that the likely cause of the accident was a seizure caused by the tumor. She warned that Erica only had a few months to live and her symptoms would get worse during that time. When Mason came to visit her later, she had a tonic clonic seizure in front of him. Cooper later went to Erica and asked her to fight. ''(\"[[The Time Has Come]]\")''\n\n===Chemotherapy===\nErica started chemotherapy and refused to let Mason come in to see her during her treatments. Amelia did research into gliosarcomas during this time, trying to figure out another option for Erica. She found an experimental treatment in New Zealand, but Erica said she wouldn't go because it would mean leaving Mason. Amelia did more research and suggested instead that they go to Seattle, where Derek would help her. ''(\"[[Too Much]]\")''\n\n===Tumor Resection===\nAfter Amelia and Derek practiced the procedure and felt confident they could do it, Erica came to Seattle to have surgery the next morning. She wanted to spend one more day with Mason first. As they played football in the park, Erica started to cry and she finally told Mason she was sick and needed to have surgery.\n\nThe next day, they successfully cut off and restored blood flow within the required 90 seconds, but Erica threw a clot and had a stroke. Despite that, they were able to remove her whole tumor and finish her surgery. She woke up after surgery in pain, but able to move her fingers and toes. ''(\"[[You Break My Heart]]\")''\n\n===Recovery===\nWhile Erica was weak and recovering from her surgery, Cooper tried to be there with her and Mason every night, but it started affecting his ability to do his job, so Charlotte hired a night nurse to stay overnight and take care of Erica. ''(\"[[Andromeda]]\")''\n\n===Death===\nNot long after the surgery, Erica was in severe abdominal pain and began to vomit blood. She was rushed to the ER where it was determined that the gliosarcoma had spread to her liver, GI tract, and near her spine. She was told she had about a week to live, during which she'd develop paralysis and be in serious pain. She didn't want Mason to be there to watch that happen, so they brought him in to say goodbye for the last time. Charlotte went to see her afterward to see if there was anyone she wanted Charlotte to call. When Erica said she didn't have anyone, Charlotte held her hand and told her that wasn't true. ''(\"[[The Letting Go]]\")''\n\nErica's condition continued to decline with Charlotte by her side. She continued to refuse to see Mason. When the time came that she had only minutes to live, Erica relented and Charlotte rushed to bring Mason to Erica's bedside. Mason arrived in time and climbed into Erica's bed and hugged her until she died. ''(\"[[It Was Inevitable]]\")''\n\n==Relationships==\n===Romantic===\nMason mentioned that Erica had had some boyfriends, but they all left her at some point.\n\n===Familial===\n====[[Mason Warner]]====\nErica was a loving mother to Mason. She wanted to protect Mason from everything, even keeping her tumor a secret from him. When he found out that she was sick, he was very upset. However, he forgave her when she was on her deathbed.\n\nShe originally didn't want Mason to see her dying because she cared so much about him. Charlotte convinced her that Mason would never get closure if he didn't see his mother one last time, so Erica allowed him to come into her hospital room. She died as he held her in a hug.\n\n====[[Cooper Freedman]]====\nErica and Cooper had a one-night stand in her car. The result of this night was Erica getting pregnant with their son, [[Mason Warner|Mason]]. Years later, Erica searched for Cooper so he could start to be Mason's father, as she had been diagnosed with an inoperable gliosarcoma.\n\n===Friendships===\n====[[Charlotte King]]====\nWhen Charlotte was suspicious that Erica was lying about Cooper being Mason's father, she was very mean to Erica. She even sent her a check for Erica to go away and never talk to Cooper again.\n\n==Career==\nShe was a bartender when she and Cooper first met.\n\n==Notes and Trivia==\n*She once spat on a six year old for spitting on then three year old Mason.<ref>[[Don't Stop 'Till You Get Enough]], 5x07 (PP)</ref>\n*She liked to party before she had Mason.<ref>[[Remember Me]], 5x04 (PP)</ref>\n*She talks like Yoda when she is stressed.\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPP5x03EricaWarner.png|[[Deal With It]]\nPP5x04EricaWarner.png|[[Remember Me]]\nPP5x05EricaWarner.png|[[Step One]]\nPP5x06EricaWarner.png|[[If I Hadn't Forgotten...]]\nPP5x07EricaWarner.png|[[Don't Stop 'Till You Get Enough]]\nPP5x09EricaWarner.png|[[The Breaking Point]]\nPP5x11EricaWarner.png|[[The Standing Eight Count]]\nPP5x12EricaWarner.png|[[Losing Battles]]\nPP5x13EricaWarner.png|[[The Time Has Come]]\nPP5x14EricaWarner.png|[[Too Much]]\nPP5x15EricaWarner.png|[[You Break My Heart]]\nPP5x16EricaWarner.png|[[Andromeda]]\nPP5x17EricaWarner.png|[[The Letting Go]]\nPP5x18EricaWarner.png|[[It Was Inevitable]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP5x03-9.jpg\nPP5x03-10.jpg\nPP5x03-13.jpg\nPP5x04-4.jpg\nPP5x04-14.jpg\nPP5x04-15.jpg\nPP5x05-3.jpg\nPP5x05-8.jpg\nPP5x05-9.jpg\nPP5x06-3.jpg\nPP5x06-4.jpg\nPP5x07-10.jpg\nPP5x07-11.jpg\nPP5x09-1.jpg\nPP5x09-5.jpg\nPP5x09-16.jpg\nPP5x11-1.jpg\nPP5x12-3.jpg\nPP5x15-2.jpg\nPP5x15-3.jpg\nPP5x15-12.jpg\nPP5x15-13.jpg\nPP5x17-4.jpg\nPP5x17-5.jpg\nPP5x17-6.jpg\nPP5x17-8.jpg\nPP5x17-9.jpg\nPP5x17-14.jpg\nPP5x17-21.jpg\nPP5x17-24.jpg\nPP5x17-28.jpg\n</gallery>\n\n==Appearances==\n{{Erica Warner Appearances}}\n\n{{Scrollbox}}\n\n[[de:Erica Warner]]\n\n{{DEFAULTSORT:Warner, Erica}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]\n[[Category:Deceased Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Neuro)]]\n[[Category:Patients (Oncology)]]\n[[Category:Patients (Trauma)]]\n[[Category:Patients (General)]]"}]}}}}