{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"82541": {"pageid": 82541, "ns": 0, "title": "Eric", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S194x14Eric.png\n|name = Eric\n|status = Alive\n|marital = [[Sonia]] ''(wife)''\n|only appearance = [[Comfortably Numb]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 4 (Station 19)|4]]\n|portrayed by = [[Dhruv Uday Singh]]\n}}\n\n'''Eric''' is the husband of [[Sonia]].\n\n==History==\nDuring the pandemic, Eric's wife, Sonia, started having an affair with her neighbor, [[Matthew (Comfortably Numb)|Matthew]]. One day, while she was at his place, someone entering the apartment made her believe his girlfriend had come home. She jumped out a window onto what she thought was a fire escape only to fall three stories into a dumpster after hitting her back on the edge of it. Jack and Inara found her soon afterward and called for an ambulance. She tried to refuse, saying calling an ambulance would ruin her life. She admitted to Jack and Inara that she'd been having an affair and an ambulance would mean her husband would find out about the affair. Jack climbed into the dumpster with her and talked to her as a tingly sensation made its way up her body, affecting her limbs. He warned her of a possible spinal injury and impressed upon her the importance of going to the hospital. While she talked about the mess she'd made of her life, her husband, Eric, arrived and overheard her talking. He was upset at her having an affair and got into a fight with Matthew over it. Soon after that, the firefighters arrived and pulled Sonia out of the dumpster and took her to the hospital. Jack later reported that her spine wasn't severed, just bruised.\n\n==Relationships==\n===Romantic===\nHe is married to [[Sonia]], though she is having an affair with their neighbor.\n\n==Notes and Trivia==\n*During the pandemic, he and his wife had their groceries delivered on Tuesdays and a virtual game night on Fridays.\n\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S4 Characters]]"}]}}}}