{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49746": {"pageid": 49746, "ns": 0, "title": "Erin Merring", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP103Erin.png\n|name = Erin Merring\n|status = Alive\n|diagnosis = Ammonium nitrate poisoning\n|doctors = [[Cooper Freedman]]\n|treatment = Methylene blue\n|siblings = *[[Becky Merring]]\n*[[Kim Merring]]\n*[[Sasha Merring]]\n|parents = *[[Paige Merring]]\n*Father\n|only appearance = [[In Which Addison Finds the Magic]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 1 (Private Practice)|1]]\n|portrayed by = [[Karley Scott Collins]]\n}}\n'''Erin Merring''' is one of the four sisters who repeatedly turned blue. She was the first to become sick.\n\n==History==\nErin came to the practice with her mother when her skin turned cornflower blue. After looking for possible causes, Cooper found out that Erin had recently had her first ever cavity filled at the dentist and believed the dental drugs had reacted with the hemoglobin in her blood, which had turned her blue. He gave her methylene blue to make her pink again and sent her home. However, she came back and was blue again, along with her three sisters.\n\nAfter giving them all methylene blue, Cooper went to their house to look for environment poisons, but found nothing. While he was there, Erin had a seizure and had to rushed to the hospital. Desperate to find an answer, Cooper went back to the house and pretended to be a princess with Becky, Kim, and Sasha, and they led him to their castle, which was a shed that had bags of fertilizer with ammonium nitrate in it, which was poisoning them.\n\n==Relationships==\n===Familial===\nErin is very close with her three sisters. The four of them play princesses, which included going into a castle together. They rarely speak to adults.\n\n{{DEFAULTSORT:Merring, Erin}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S1 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Peds)]]"}]}}}}