{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51189": {"pageid": 51189, "ns": 0, "title": "Erin George", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x15-9.jpg\n|name = Erin George\n|status = Alive\n|children = [[Tanya George]]\n|only appearance = [[Two Steps Back]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Helen Slater]]\n}}\n\n'''Erin George''' is the mother of [[Tanya George]].\n\n==History==\nErin brought her daughter, Tanya, into the practice. She was worried because she'd caught Tanya having sex with [[Ricky (Two Steps Back)|Ricky]], a classmate of hers who also had special needs. Tanya had been complaining of stomach pains, so her mother asked Sam to run a pregnancy test. He did an ultrasound, which revealed that she was pregnant.\n\nHer mother was worried she would be unable to carry a pregnancy safely because of her heart problems, but Sam said it would be high-risk, but not impossible. Erin then asked about how Tanya and Ricky would manage raising a child, especially if the baby also had special needs. The baby had a 50% chance of having Down syndrome. Erin said she loved Tanya, but she didn't know if she could raise another child with Down syndrome. She felt aborting the baby was the only option she had. Naomi suggested CVS before doing that, so she'd know if the baby was healthy or had Down syndrome. Erin agreed to let her run the test.\n\nThey did the CVS and Ricky came into the room just after they finished. Erin then decided to tell Ricky and Tanya about the pregnancy. They were both excited about it. Erin said that despite their excitement, she couldn't trust them with the baby, so she'd have to baby. She then told Ricky and Tanya they didn't get to have the baby for sure.\n\nNaomi got the results of Tanya's CVS back, but Erin wasn't answering the phone, so Naomi and Sam drove over to her house. Naomi told Erin the baby didn't have Down syndrome or any other abnormalities, but Erin said that she'd taken Tanya for an abortion that morning.\n\n==Relationships==\n===Familial===\nHer daughter has Down syndrome. Because of this, she stayed home with her to raise her.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP4x15-9.jpg\nPP4x15-10.jpg\n</gallery>\n\n{{DEFAULTSORT:George, Erin}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]"}]}}}}