{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"85307": {"pageid": 85307, "ns": 0, "title": "Erroll", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S195x17Erroll.png\n|name = Erroll\n|status = Alive\n|job = Toll Booth Worker\n|workplace = \n|only appearance = [[The Road You Didn't Take]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Cullen Douglas]]\n}}\n\n'''Erroll''' is a patient who came into the station 19 clinic.\n\n==History==\nErroll came into the clinic and said it was getting harder and hard to walk. Travis removed his sock and two of his toes fell onto the ground. Travis asked him if he was diabetic and he said he didn't know for sure, but didn't think so. He noticed his toes changing, but thought it was just bad circulation. Ben examined him and diagnosed diabetic neuropathy and foot disease, which he also saw in Erroll's other foot. Maya pricked his finger to check his blood sugar. They told him he needed to get to Grey Sloan immediately for care. He tried to object, becuase he didn't have insurance and didn't want to lose his house, but Travis promised to help him figure it out. When he found out he'd have to go by ambulance, he worried even more about the cost. He then said he'd noticed that his feet were numb for a few weeks, but it never seemed urgent enough to go into debt.\n\n==Career==\nHe worked collecting tolls until the city automated the whole process.\n\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}