{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50498": {"pageid": 50498, "ns": 0, "title": "Esau Ajawke", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP316EsauAjawke.png\n|name = Esau Ajawke\n|status = Alive\n|diagnosis = Tuberculosis\n|doctors = *[[Sam Bennett]]\n*[[Pete Wilder]]\n|marital = [[Elisha]] ''(fiancée)''\n|children = Son\n|parents = Parents\n|only appearance = [[Fear of Flying]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Aldis Hodge]]\n}}\n'''Esau Ajawke''' is a patient who contracted tuberculosis and was deported because of it.\n\n==History==\nEsau's fiancée, Elisha, was pregnant and at the practice for an ultrasound. The baby had a heart defect which would require multiple surgeries after he was born. Esau was an immigrant and his visa had expired, so he got a physical so he could apply for his green card.\n\nEsau's chest x-ray revealed that he had tuberculosis, so he was taken to the hospital. Esau pleaded with Sam not to tell Immigration that he was sick because they would send him back if they knew. When Sam said he had an obligation to send it in, Elisha said they'd just go back to Kenya and live with Esau's parents there, but she was told that with her baby's heart condition, he wouldn't be able to get the care he needs there.\n\nThe tests showed that Esau's tuberculosis was MDR, which meant it was drug resistant. They went to put him in isolation, but found his bed empty because he and Elisha had left.\n\nAddison and Sam tried to find them, but weren't successful. Esau and Elisha returned to the hospital when Elisha went into labor. Esau wanted to go with her, but Sam said he needed to go back to isolation. [[Agent Jones]] from Immigration arrived to take Esau, but Sam said his oxygen levels had dropped and he needed to stay in the hospital. Agent Jones said they'd wait until he was stable. This gave them the time for him to meet his son before Immigration took him away.\n\n==Relationships==\n===Romantic===\nHe is engaged to [[Elisha]].\n\n===Familial===\nHis parents live in Kenya.\n\nHis son was born with a serious heart condition that required multiple surgeries.\n\n==Notes and Trivia==\n*He loves Elvis Presley.\n\n{{DEFAULTSORT:Ajawke, Esau}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]\n[[Category:Patients]]\n[[Category:Patients (General)]]\n[[Category:Patients (ID)]]"}]}}}}