{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"86243": {"pageid": 86243, "ns": 0, "title": "Ethan (Season 6)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S196x02Ethan.png\n|name = Ethan\n|status = Alive\n|only appearance = [[Everybody's Got Something to Hide Except Me and My Monkey]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 6 (Station 19)|6]]\n|portrayed by = [[David W. Thompson]]\n}}\n\n'''Ethan''' is a college student who was running a server farm for [[Bryan (Season 6)|Bryan]] to mine cryptocurrency.\n\n==History==\nEthan had a server bank set up in his apartment at the behest of [[Bryan (Season 6)|Bryan]], who was using them to mine cryptocurrency. Because college students qualified for utilities at a discounted price, Bryan used them to set up operations all over town, increasing his profit margins. However, the one in Ethan's apartment caught fire due to overloading. The fire quickly spread through the apartment building, but Ethan stayed behind, trying to save the computers. After he was forcibly evacuated, he told Maya he needed to get the computers out. She told him that was between him and his insurance company, but the noticed his reaction to [[Gerald]] being treated nearby. She realized he knew something about the fire and asked him how it started. When Maya brought Beckett and Ross over, Ethan reluctantly admitted that he was running servers to mine cryptocurrency for someone else. He gave them Bryan's name, but said he didn't know where any of his other operations were.\n\n==Notes and Trivia==\n*Bryan paid him $2000/month for running the servers.\n\n{{DISPLAYTITLE:Ethan}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S6 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}