{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"76286": {"pageid": 76286, "ns": 0, "title": "Eva Vasquez", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Other Characters Infobox\n|image = S193x08-27.jpg\n|name = Eva Vasquez\n|status = Alive\n|marital = [[Rigo Vasquez]] † ''(husband)''\n|other family = Father-in-law †\n|job = Bartender\n|first appearance = [[Indoor Fireworks]]\n|last appearance = \n|count = 10\n|seasons = '''[[Station 19|S19]]:''' [[Season 3 (Station 19)|3]] and [[Season 6 (Station 19)|6]]\n|portrayed by = [[Kelly Thiebaud]]\n}}\n\n'''Eva Vasquez''' was the wife of [[Rigo Vasquez]].\n\n==History==\n===Meeting Jack===\nEva came to the bar when the firefighters from station 19 were celebrating a good call and watching the press conference given by their new fire chief. She caught Jack's eye when she said the new fire chief looked like a sex offender. They ended up leaving the bar and having sex in a car. Jack was then horrified when she noticed her husband looking for her and even more horrified to learn that her husband is [[Rigo Vasquez]]. She was surprised at his reaction since they had met at a barbecue at the station before. ''(\"[[Indoor Fireworks]]\")''\n\nDespite being married, Eva continued to pursue Jack, coming to the station to sleep with him. After they had sex, Jack asked if Rigo was bad to her and she said he was actually great to her. ''(\"[[Eulogy]]\")''\n\nAfter having sex in a hotel room, Jack invited Eva to stay a while longer, but she left early in the morning, saying she didn't want to snuggle as she already had a husband. ''(\"[[House Where Nobody Lives]]\")''\n\n===Camping Trip===\nEva came on the team building camping trip with her husband. Despite her husband being there, she climbed into Jack's tent early in the morning so they could have sex, saying Rigo had had sleeping pills and beer. They were interrupted by the screams from [[Rachel Burke|Rachel]] and [[Scott Burke]], who'd been attacked by a bear. They waited until the rest of the campers had left to check them out before coming themselves. Their late arrival aroused some suspicion, but it passed because of the ongoing issue. Later, Eva and the others, who were searching for Scott's missing nose, encountered a bear. Eva immediately cowered to the ground. After they scared off the bear, Eva found Scott's nose. The team then left the campsite to go back home. ''(\"[[Into the Woods]]\")''\n\n===Rigo's Accident and Death===\nWhile cleaning up after a rocket crash, Rigo was injured when he ignored Jack's warning not to hit some \"smoke\" (really liquid oxygen) with a fire extinguisher. Rigo was thrown back and eviscerated. He was then stabilized with REBOA in the PRT before being taken to the hospital. ''(\"[[Satellite of Love]]\")'' After his surgery, Eva was told Rigo was stable in the ICU. Later, he was able to come off the vent.\n\nJack approached Eva at the bar, offering his help to her. She rebuffed him, saying he needed to get over his guilt on his own time. ''(\"[[Born to Run]]\")''\n\nTravis and Emmett cooked some food for Eva, but when they took it to her, she said she didn't want it because she didn't want to be a widow and never see her husband again. ''(\"[[Something About What Happens When We Talk]]\")''\n\n===Reconnecting with Jack===\nAfter Jack quit his job, he reconnected with Eva and began living with her. One day, she left him handcuffed to her bed while she went to the kitchen. While she was gone, a tornado swept through and threw a tree into the side of the house, pinning Jack's handcuffed arm to the bed. Eva called for help and directed the firefighters to the bedroom when they arrived. While she got checked out at the aid car, they cut the tree, pulled it off him, and unlocked the cuff. Then they told Eva to take him to a hospital to get his injured wrist checked out. ''(\"[[Twist and Shout]]\")'' Jack didn't go right away to get his wrist checked out, instead leaving it just in a wrap, but it interfered with them being able to have sex, so he went to the ER and got a splint for the buckle fracture. He went to the bar to see her and she celebrated him being on the mend. ''(\"[[Everybody's Got Something to Hide Except Me and My Monkey]]\")''\n\nWeeks later, the tree was still stuck through the roof of the house. When Andy brought muffins and asked Jack to come back to the station, Eva got upset because she felt Andy was rude. Later, while Jack was trying to fix the roof, they got into an argument because Jack said he felt weird using Rigo's tools and Eva took one of Jack's pain pills. When Jack came back and started fixing the roof, they fought again and Eva told him that she didn't believe in God anymore because he took the wrong ones, referencing Rigo's death. ''(\"[[Dancing With Our Hands Tied]]\")''\n\n===Halloween===\nOn Halloween, Eva took drugs and gave some to Jack as well. The two of them went to a bar, where Jack told Eva he was hallucinating Rigo. She believed he was lying and trying to hurt her by bringing up Rigo, so she left him and began flirting with another man. When Jack approached them and tried to explain, Eva watched as the man she'd been flirting with punched Jack. ''(\"[[Demons]]\")''\n\n==Relationships==\n===Romantic===\n====[[Rigo Vasquez]]====\nShe was married to [[Rigo Vasquez]] until his death. Despite this, she had sex with Jack after meeting him at a bar. They had met before, but Jack didn't remember this and didn't know she was married to Rigo. Even after Jack learned this, their sexual relationship continued, despite his attempts to stop it.\n\n====[[Jack Gibson]]====\nShe and Jack met at a bar an immediately slept together. ''(\"[[Indoor Fireworks]]\")'' Jack was horrified when he learned she was Rigo's wife, but kept having sex with her. ''(\"[[Eulogy]]\")'' This continued until Rigo was fatally injured at a scene after ignoring Jack's instructions. ''(\"[[Something About What Happens When We Talk]]\")''\n\nYears later, when Jack learned that his birth parents stayed together after he was born and went on to have and raise four more children, he ended up reconnecting with Eva and they resumed their relationship. ''(\"[[Twist and Shout]]\")''\n\n==Career==\nShe is a bartender. ''(\"[[Everybody's Got Something to Hide Except Me and My Monkey]]\")''\n\n==Notes and Trivia==\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nS193x02EvaVasquez.png|[[Indoor Fireworks]]\nS193x03EvaVasquez.png|[[Eulogy]]\nS193x04EvaVasquez.png|[[House Where Nobody Lives]]\nS193x05EvaVasquez.png|[[Into the Woods]]\nS193x08EvaVasquez.png|[[Born to Run]]\nS193x10EvaVasquez.png|[[Something About What Happens When We Talk]]\nS196x02EvaVasquez.png|[[Everybody's Got Something to Hide Except Me and My Monkey]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS193x03-30.jpg\nS193x03-31.jpg\nS193x03-32.jpg\nS193x03-33.jpg\nS193x03-34.jpg\nS193x03-35.jpg\nS193x03-36.jpg\nS193x05-22.jpg\nS193x05-23.jpg\nS193x05-25.jpg\nS193x05-35.jpg\nS193x05-36.jpg\nS193x05-43.jpg\nS193x05-44.jpg\nS193x05-48.jpg\nS193x05-49.jpg\nS193x05-50.jpg\nS193x05-51.jpg\nS193x05-52.jpg\nS193x05-53.jpg\nS193x08-26.jpg\nS193x08-27.jpg\nS193x08-32.jpg\nS193x08-33.jpg\n</gallery>\n\n==Appearances==\n{{Eva Vasquez Appearances}}\n\n[[de:Eva Vasquez]]\n\n{{DEFAULTSORT:Vasquez, Eva}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S3 Characters]]\n[[Category:S19 S6 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}