{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52231": {"pageid": 52231, "ns": 0, "title": "Evan Olsen", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP5x10EvanOlsen.png\n|name = Evan Olsen\n|status = Alive\n|doctors = *[[Jake Reilly]]\n*[[Violet Turner]]\n|only appearance = [[Are You My Mother?]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Private Practice)|5]]\n|portrayed by = [[John Sloan]]\n}}\n'''Evan Olsen''' is one of a polyamorous triad that wanted to have a baby via assisted reproduction.\n\n==History==\nEvan came in with [[Kendra Templeton]] and [[Rose Filmore]]. Rose and Kendra said they'd been together for six years and they were ready to have a baby. Evan was there to be the sperm donor. They wanted to use Rose's egg, but have Kendra carry so they could both be part of the experience. Jake consulted with them and then insisted that they sit down with Violet before proceeding because they were using a known donor, so that everyone would know what the expectations and limitations were.\n\nThey sat down with Violet, who asked Evan what he saw his role as. He said he'd donate the sperm, put together the crib, and then be the cool uncle. Violet questioned what would happen when the baby got a little older and he disagreed with a parenting decision. Her insistence on the truth pressed the three of them to admit that they were a polyamorous triad and planned to raise the baby together. Violet reminded them that they'd have to raise the child in the real world, which wouldn't be as accepting of their family as they were. They believed that they had enough love that they could it through.\n\nRose and Kendra went in to be examined before starting the process. Kendra's exam was unremarkable, but Rose was informed that she had uterine scarring and ovarian failure secondary to pelvic tuberculosis, making her completely infertile. However, Jake said that Kendra and Evan would not likely have trouble conceiving without assistance if they want. Rose quickly backed out of the pursuit for a baby, saying that they couldn't do it if they couldn't all be part of it.\n\nKendra and Evan saw Violet without Rose, saying they didn't understand the problem. Violet explained Rose's point of view on them sharing something she wasn't part of. They wanted to fix it, so Violet suggested a compromise.\n\nRose went to Jake asking if there was anything he could do to make her able to participate. He said that many women come to him unable to conceive and he still finds a way to make them mothers. She was worried a baby would change everything. He said that if the love were real, it could withstand anything, but admitted he didn't actually believe that. Love's powerful, but sometimes life wins.\n\nRose went to Kendra and Evan and said she wanted a baby, but not that way. Despite that, she said she loved them and agreed to trust them and have them conceive together. Evan agreed, but Kendra said she couldn't do it. She said the reason they worked was because of the rules. They needed unanimous to avoid someone getting hurt. She said they could have a baby another way, but given the choice, she chose the three of them. Evan said it wasn't trivial. He wanted a biological child and wasn't sure he could choose the relationship above that.\n\n==Relationships==\n===Romantic===\nHe's been seeing Kendra and Rose for six years. They said the first night was amazing and so was the next morning and the morning after that. To make the relationship work, they had very strict rules to follow, including one that stated all decisions had to be unanimous so no one felt ganged up on. Rose's infertility threatened their relationship, leaving their future together in question.\n\n===Familial===\nEvan says he grew up in a family with a lot of commitment, but not a lot of love.\n\n{{DEFAULTSORT:Olsen, Evan}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]\n[[Category:Patients]]\n[[Category:Patients (REI)]]\n[[Category:Patients (Psych)]]"}]}}}}