{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49973": {"pageid": 49973, "ns": 0, "title": "Evan Dawson", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP3x08-15.jpg\n|name = Evan Dawson\n|status = Alive\n|alias = Porter\n|diagnosis = *Diabetes\n*Infection\n*Seizure\n*Kidney infection\n*Arm laceration\n|doctors = [[Cooper Freedman]]\n|treatment = *Antibiotics\n*Insulin pump\n*D50\n*Stitches\n|parents = *[[Lynn Jarvey]]\n*[[Frank Dawson]]\n|other family = [[Ted Jarvey]] ''(stepfather)''\n|first appearance = [[Worlds Apart]]\n|last appearance = [[Sins of the Father]]\n|count = 2\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]] and [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Joey Luthman]]\n}}\n\n'''Evan Dawson''' is a kid who went on the run with his father.\n\n==History==\n===Pump Infection===\nA kid calling himself Porter came in to see Cooper for an exam. He had diabetes, so Cooper took his blood sugar level and it was 210. He said that his insulin pump got clogged sometimes, but his dad fixed it. They'd been on the road for the last five weeks. Cooper checked out his insulin pump and found that it was infected. Cooper asked him about keeping it clean, but he said they were sleeping in the car, which made it difficult to keep the area clean.\n\nCooper gave him a prescription for antibiotics, but also told his father he'd need a new insulin pump. Cooper said that that would take a few days, but Frank said that he needed to get to Oregon in order to keep a job he'd gotten. Cooper talked to him and said that he needed to wait for his kid's well being. Cooper ran the serial number on Porter's pump and found that it was registered to Evan Dawson. When Cooper called the doctor who placed it, he found out that Evan had been kidnapped. Cooper called Frank and Porter back to the practice, saying he needed to run a few more tests. Once alone with Porter, Cooper asked him about it. Evan then confessed that he and his father had run away because his mom's boyfriend, who was living with her, had started to hit him and his father was the only person who believed him. Evan then had a seizure due to low blood sugar. He was rushed to the hospital and a new pump was placed. However, the hospital also ran the number on his old pump and found that he had been kidnapped and called the police. However, Cooper gave them a heads up and sent them out of the hospital with some supplies to keep them going for a while. ''(\"[[Worlds Apart]]\")''\n\n===Reunion with His Mother===\nWhen [[Lynn Jarvey]] came to the practice looking for her son, Cooper said he didn't know where Evan was. However, he met up with Evan and his father in the park and examined him and drew some blood for tests. Cooper told Frank about Lynn coming to see him, but said they didn't need to run, but to be careful.\n\nCooper was arrested for helping them and the detective showed Cooper a call log that showed that Lynn received a call from Evan asking her to stop looking for him so his dad and Cooper didn't get in trouble. Since he was in jail, Cooper sent Charlotte to get Evan's labs and give him antibiotics for his kidney infection.\n\nAt a grand jury hearing, Cooper refused to answer questions about where Evan and Frank were. A judge offered him immunity in exchange for telling where they were. When he again refused, he was held in contempt without bail.\n\nCharlotte picked up Evan's labs and took antibiotics to him. However, the police found them, tipped off by Addison, and arrested Frank and returned Evan to his mother. Evan later came into the ER saying that Ted had stabbed him, but Charlotte and Sam observed that he had intention marks meaning he'd do it himself. He said that he thought it would force them to release his father from jail. Charlotte said they needed to find real evidence to put Ted in jail. Evan then admitted that he'd made it up to try to keep his parents together, but his mother didn't believe him and his father did. And once he'd started, he didn't know how to stop.\n\nLynn dropped the charges and Frank was then released from jail. ''(\"[[Sins of the Father]]\")''\n\n==Relationships==\n===Familial===\nEvan ran off with his father at the age of 12 being he claimed that his mom's boyfriend was hitting him and the only person to believe him was his father.\n\n==Notes and Trivia==\n*He was 12 at the time of his infection, but 13 when he was reunited with his mother.\n*He likes The Three Musketeers. He chose his fake name, Porter, based on his favorite musketeer: Porthos.<ref>[[Worlds Apart]], 2x10 (PP)</ref>\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" crop=\"true\" position=\"center\" hideaddbutton=\"true\">\nPP210Porter.png|[[Worlds Apart]]\nPP308EvanDawson.png|[[Sins of the Father]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP3x08-8.jpg\nPP3x08-11.jpg\nPP3x08-15.jpg\nPP3x08-20.jpg\n</gallery>\n\n==Appearances==\n{{Evan Dawson Appearances}}\n\n{{Scrollbox}}\n\n{{DEFAULTSORT:Dawson, Evan}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:PP S3 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Peds)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Renal)]]"}]}}}}