{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"70538": {"pageid": 70538, "ns": 0, "title": "Evelyn", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S192x03Evelyn.png\n|name = Evelyn\n|status = Alive\n|marital = Jeffrey †\n|only appearance = [[Home To Hold Onto]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 2 (Station 19)|2]]\n|portrayed by = [[Carol Locatell]]\n}}\n'''Evelyn''' is a woman who became trapped in her apartment after falling.\n\n==History==\nEvelyn had a cardiac episode in her apartment and fell, which knocked over a pile of stuff nearby and trapped her. Her downstairs neighbors and friends, [[Jaime]] and [[Liam]], called for help because they were worried about the cracking ceiling in their apartment. Due to the massive amount of hoarded materials in her apartment, the floor was likely to collapse quickly and couldn't bear additional weight. Andy wanted to wait for the structure to be stabilized before going after Evelyn, but Maya and Sullivan didn't believe they had time to wait. Sullivan wanted to send Ben in after Evelyn, but Maya suggested Andy instead because she's the lightest member of the team. Andy was sent in with a stretcher to bring Evelyn back out. She had to have Evelyn call out to her to make sure she was going in the right direction. When she reached Evelyn, she assessed her status and then put her on the stretcher. The floor started to crack as Andy made her way out. As she reached the door, she sent Evelyn out and Evelyn was pulled to safety in the hallway. She was then put on a stretcher to go to the hospital. Liam and Jaime said they were glad she was safe, even though her apartment had fallen into theirs.\n\n==Relationships==\n===Romantic===\nShe was married until her husband Jeffrey died. After his death, she began hoarding because she said her husband was the one who always knew what to keep and what to throw away.\n\n===Friendships===\nShe is friends with [[Jaime]] and [[Liam]], who live in the apartment beneath hers.\n\n==Notes and Trivia==\n*She has arthritis in her fingers.\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S2 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}