{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49844": {"pageid": 49844, "ns": 0, "title": "Father Mark", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP108FatherMark.png\n|name = Mark\n|status = Alive\n|diagnosis = Typhus carrier\n|doctors = *[[Sam Bennett]]\n*[[Naomi Bennett]]\n|treatment = Antibiotics\n|job = Priest\n|workplace = St. Mary's\n|only appearance = [[In Which Cooper Finds a Port in His Storm]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 1 (Private Practice)|1]]\n|portrayed by = [[Tom Irwin]]\n}}\n\n'''Mark''' is Naomi and Sam's priest who called them when a nun got seriously ill.\n\n==History==\nMark called the practice asking that Naomi and Sam come to see him as soon as possible. When they arrived, he told them that one of the nuns, Sister Helen, was sick. They'd been sequestered together for three weeks. Naomi examined Helen and found a rash on her abdomen. They took a picture of her rash and sent it to Dell to try to identify it. In the meantime, they decided to send Helen out to the hospital. However, before she could be taken, the illness quickly spread and they decided to lock down the place while waiting for St. Ambrose to prepare an isolation unit for them. The infectious disease specialist came back with a diagnosis of typhus. They started antibiotics for all the nuns and started asking if anyone had broken sequester, because the incubation period for typhus is two weeks. No one would admit to anything, but Sam and Naomi watched Mark give the sacrament of the sick and began to suspect that there was more to their relationship than he had said. They went to him and said they wanted to test him as a typhus carrier. He admitted to them that he would sneak into the convent at night and they would cook together. They said they'd start him on antibiotics.\n\n==Relationships==\n===Friendships===\nHe was very fond of Sister Helen. He would sneak into the convent at night so they could cook together, but he says they never crossed the line and got physical. When she was away, he said he looked forward to his return because he missed her.\n\n===Professional===\nSam and Naomi Bennett are members of his congregation.\n\n==Career==\nHe is a Catholic priest. Sam and Naomi are part of his congregation.\n\n==Notes and Trivia==\n*He couldn't cook until Sister Helen taught him.\n\n{{DEFAULTSORT:Mark}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S1 Characters]]\n[[Category:Patients]]\n[[Category:Patients (General)]]\n[[Category:Patients (ID)]]"}]}}}}