{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"84845": {"pageid": 84845, "ns": 0, "title": "Fernanda Lima", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = 18x14FernandaLima.png\n|name = Fernanda Lima\n|status = Alive\n|alias = Fierce Fernanda\n|diagnosis = *Congenital aortic valve disease\n*Aortic stenosis\n*Dehydration\n|doctors = *[[Maggie Pierce]]\n*[[Winston Ndugu]]\n*[[Taryn Helm]]\n|treatment = Ross-Konno Procedure\n|siblings = [[Rafael Lima]]\n|parents = *[[Daniel Lima]]\n*[[Angela Lima]]\n|only appearance = [[Road Trippin']]\n|seasons = '''[[Grey's Anatomy|GA]]:''' [[Season 18 (Grey's Anatomy)|18]]\n|portrayed by = [[Breaunna Bryan]]\n}}\n\n'''Fernanda Lima''' is a child who came to the hospital to have heart surgery.\n\n==History==\nFernanda had congenital heart disease that caused aortic stenosis. She'd had two prior open-heart surgeries and made a trip with her family from Boston to Seattle for a third. Her condition made it unsafe for her to fly on a commercial airplane, so her parents used a crowdfunding website to raise money, which they used to get an RV and drive across the country. On the way, they stopped at several tourist attractions. By the time they reached Seattle, Fernanda was starting to feel dizzy, so they rushed her directly to the PICU. She was dehydrated, so they gave her fluids and ordered more tests, which showed that her aortic stenosis had gotten worse and they were forced to covert to a Ross-Konno Procedure. It carried additional risk, but her parents agreed to it because Maggie said it was the best option. The surgery went well and her family was told she'd be okay.\n\n==Relationships==\n===Familial===\nWhen she and her family had to travel from Boston to Seattle for her to have heart surgery, they took the time to spend together as a family, stopping at tourist sites along the way.\n\n==Notes and Trivia==\n*She was thirteen at the time of her surgery.\n*She loves salted caramel ice cream and action movies.\n*She and her family are Brazilian.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\n18x14-4.jpg\n</gallery>\n\n[[de:Fernanda Lima]]\n{{DEFAULTSORT:Lima, Fernanda}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S18 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Cardio)]]\n[[Category:Patients (Peds)]]"}]}}}}