{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"85425": {"pageid": 85425, "ns": 0, "title": "Firefighter Kline", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Firefighter Infobox\n|image = S195x18FirefighterKline.png\n|name = Firefighter Kline\n|status = Alive\n|job = Firefighter\n|workplace = [[SFD Station 19]]\n|first appearance = [[Too Darn Hot]]\n|count = 2\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]] and [[Season 6 (Station 19)|6]]\n|portrayed by = [[Denton Williamson]]\n}}\n\n'''Firefighter Kline''' is one of the firefighters at [[SFD Station 19]].\n\n==History==\n===Andy's Trial and Cesium===\nKline was eating in the beanery while Vic, Jack, Ben, and Theo talked about Andy's decision not to take the plea deal. Vic said she respected Andy for not taking it and Kline agreed. Most of the rest of the team was then called out to a car accident. Later, he was sweeping the barn when Maya and Carina arrived for Pru's party. He told Maya they'd missed a big call, involving nuclear waste. Both he and Maya were disappointed by that. ''(\"[[Crawl Out Through the Fallout]]\")''\n\n===Andy's Self Defense Class===\nKline volunteered for Andy's self defense class to let the participants practice choke holds. ''(\"[[Twist and Shout]]\")''\n\n===Cryptocurrency Fires===\nKline helped the team fight a fire at an apartment complex where an illegally-wired computer bank started a fire. When they learned it was a crypto mine and there were others around town, Kline went with Maya and Beckett to another one to get it shut down before it could also start a fire. ''(\"[[Everybody's Got Something to Hide Except Me and My Monkey]]\")''\n\n==Career==\nHe is a firefighter at [[SFD Station 19]].\n\n==Notes and Trivia==\n*He makes his first speaking (and credited) appearance in [[Crawl Out Through the Fallout]] yet can be seen in the background as a non-speaking character in multiple earlier episodes.\n*The credit for his first speaking appearance spells his name as \"Kline\" while his uniform in earlier appearances spelled \"Klyne\". The spelling on his uniform, however, is changed to \"Kline\" for his first speaking appearance, matching the credit.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS196x06-1.jpg\nS196x06-3.jpg\nS196x06-4.jpg\n</gallery>\n\n==Appearances==\n{{Firefighter Kline Appearances}}\n\n{{DEFAULTSORT:Kline, Firefighter}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 S6 Characters]]\n[[Category:Firefighters]]"}]}}}}