{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"82852": {"pageid": 82852, "ns": 0, "title": "Fire Chief McCallister", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Firefighter Infobox\n|image = FireChiefMcCallister.jpg\n|name = Fire Chief McCallister\n|status = Alive\n|job = Fire Chief ''(former)''\n|workplace = [[Seattle Fire Department]] ''(former)''\n|first appearance = [[Forever and Ever, Amen]]\n|last appearance = [[Things We Lost in the Fire (Station 19)|Things We Lost in the Fire]]\n|count = 3\n|seasons = '''[[Station 19|S19]]:''' [[Season 4 (Station 19)|4]] and [[Season 5 (Station 19)|5]]\n|portrayed by = [[Larry Poindexter]]\n}}\n\n'''Fire Chief McCallister''' is the former fire chief for the [[Seattle Fire Department]]\n\n==History==\n===Maya's Demotion===\nFire Chief McCallister came to the scene of a fire at the Garcia house. When [[Zaza Delgado]] was pulled out of the house with burns over 30% of his body, McCallister ordered Maya to wait the estimated eight minutes it would take to get another aid car to their location to transport him to the hospital, citing the risk of lawsuit if he died en route to the hospital in the engine. Maya said she was tired of risking lives by following protocols designed to avoid lawsuits and had her team load Zaza onto the engine with medical supplies against McCallister's direct order.\n\nAs a result of Maya's actions, McCallister said there would be an official investigation. He spoke to Andy and Sullivan about the incident, saying he should fire both of them and their captain and shut 19 down, but Sullivan said if McCallister made him captain of 19, he could get the house back in order. The firefighters were later informed that Maya had been relieved of her duties. ''(\"[[Forever and Ever, Amen]]\")''\n\nMaya, Carina, and Andy left the wedding to confront McCallister about this demotion. Maya said she was just doing what was right instead of allowing a child to die in the street. Carina pointed out that the child lived. Andy said she knew multiple male fire captains who were similarly insubordinate and weren't relieved of their duties, including her own father. Maya said she refused to accept her demotion, saying her team wouldn't accept it either. McCallister then told Andy she was reassigned to station 23 effective immediately. He told Maya she could keep 19, but he'd reassign the whole team, so she accepted the demotion pending investigation. She said Andy would be the best replacement in her absence, but he made it clear that Andy's reassignment was still in place. ''(\"[[Phoenix from the Flame]]\")''\n\n===Gas Main Explosion===\nWhen a gas main exploded about half a mile from station 19, McCallister arrived after station 23 had been called as backup. With the threat of another explosion looming, Beckett told McCallister he would have to take command of the scene while Beckett helped with evacuation. ''(\"[[Things We Lost in the Fire (Station 19)|Things We Lost in the Fire]]\")''\n\nAn investigation into his action was launched after this event. He decided to take early retirement as a result. ''(\"[[All I Want for Christmas is You]]\")''\n\n==Career==\nHe was the fire chief of the [[Seattle Fire Department]]. He was appointed to this position after the arrest and removal of [[Michael Dixon]]. He took early retirement after the [[Things We Lost in the Fire (Station 19)|gas main explosion]], which led to the death of [[Dean Miller]].\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nS194x16FireChiefMcCallister.png|[[Forever and Ever, Amen]]\nS195x01FireChiefMcCallister.png|[[Phoenix from the Flame]]\nS195x05FireChiefMcCallister.png|[[Things We Lost in the Fire (Station 19)|Things We Lost in the Fire]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS194x16-34.jpg\n</gallery>\n\n==Appearances==\n{{Fire Chief McCallister Appearances}}\n\n{{DEFAULTSORT:McCallister, Fire Chief}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:Firefighters]]"}]}}}}