{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"4340": {"pageid": 4340, "ns": 0, "title": "Frances", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP206Frances.png\n|name = Frances\n|status = Alive\n|alias = Franny\n|diagnosis = *Head injury\n*Normal-pressure hydrocephalus\n|doctors = *[[Sam Bennett]]\n*[[Naomi Bennett]]\n|treatment = *Spinal tap\n*Residential care\n|marital = [[Henry]] ''(husband)''\n|siblings = Helen †\n|only appearance = [[Serving Two Masters]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Kim Hamilton]]\n}}\n'''Frances''' was a patient of [[Sam Bennett|Sam]].\n\n==History==\nHenry came to Oceanside Wellness for a check up from Sam, but as Frances had Alzheimer's, he was unable to leave her alone. When [[Naomi Bennett|Naomi]] came to greet them, Frances mistook Naomi for Helen, her sister, and so Naomi pretended to be Helen to keep Frances happy while Henry saw Sam.\n\nFollowing the appointment at the practice, Frances was admitted to the [[St. Ambrose Hospital]] [[Emergency Room|ER]] after falling and hitting her head as Henry tried to her get out of the tub. While looking over Frances's notes in the ER, Naomi noticed Frances wasn't given a [[Computed Tomography|CT]] scan prior to the diagnosis of Alzheimer's, Henry stating that her doctor said she didn't require any more tests. Back at the practice, Naomi did some research and diagnosed her with normal-pressure hydrocephalus. Sam pointed out Frances was not a candidate for neurosurgery, but Naomi pulled up another study claiming that a spinal tap to drain away excess cerebrospinal fluid could give Frances a few moments of lucidity, and Naomi wanted that so she could see how bad things were for Henry.\n\n[[Sam Bennett|Sam]] performed the spinal tap at [[St. Ambrose Hospital|St. Ambrose]], and while waiting for Frances to wake up, Henry recalled their last moments together the last time she was lucid: Frances was shivering, and Henry asked if she wanted him to turn the heat up and he did, and when he returned, she didn't know who he was. Following this, Frances woke up lucid. Naomi quickly explained the situation, and had him promise her that he would visit her every day and hold her hand, and then let her go.\n\n==Relationships==\n===Romantic===\nFrances has a husband, Henry. They have been married for almost 50 years. After she was diagnosed with Alzheimer's, he provided round the clock care for her as he promised her he would never put her in a home. This put a lot of stress on Henry and they did a spinal tap to give Frances a few lucid moments to tell Henry to put her in a nursing home.\n\n===Familial===\nFrances had one sister, Helen. At the time of her health issues, Helen had passed away \"a few years ago.\" She believed that Naomi was Helen.\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Neuro)]]"}]}}}}