{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51199": {"pageid": 51199, "ns": 0, "title": "Frank (Love and Lies)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x16-18.jpg\n|name = Frank\n|status = Alive\n|marital = [[Isabelle]] ''(wife)''\n|children = Daughter †\n|only appearance = [[Love and Lies]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[David Eigenberg]]\n}}\n\n'''Frank''' is the husband of [[Isabelle]].\n\n==History==\nFrank's wife, Isabelle, was pregnant with a baby who had been diagnosed with hypoplastic left-heart syndrome. Addison looked at all the scans and said that neither fetal surgery nor neonatal surgery was an option for her, but Isabelle and Frank had another idea. They had conceived the baby with their last embryo and Isabelle didn't have any eggs left, so they wanted to harvest their baby's eggs to use to become parents.\n\nIsabelle and Frank came into the practice to try to convince Addison to do the surgery. She said they had other options to be parents, such as adoption, but Isabelle said she needed to be a parent to a baby she carried herself. Addison agreed to do the surgery, but only after the baby was born, so she wouldn't have to cut into Isabelle's uterus.\n\nWhen Isabelle went into labor, Addison went to the hospital to deliver the baby. The cord prolapsed, so Addison rushed her into surgery for a c-section.\n\nAfter the baby was born, Addison asked Frank and Isabelle if they'd thought about a name, but they were just interested in how soon she could do the surgery and didn't want to meet her at all.\n\nAddison brought the baby to see them, saying that they wanted to be parents and this was their chance. They said they didn't want to bond with her because they didn't want to have to grieve. Addison said that was inevitable and they finally held the baby until she died.\n\n==Relationships==\n===Romantic===\nHe is married to [[Isabelle]]. They've been together for over 20 years.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP4x16-6.jpg\nPP4x16-7.jpg\nPP4x16-15.jpg\nPP4x16-18.jpg\n</gallery>\n\n{{DISPLAYTITLE:Frank}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]"}]}}}}