{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51011": {"pageid": 51011, "ns": 0, "title": "Frances Wilder", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PP4x18-6.jpg\n|name = Frances Wilder\n|status = Deceased\n|children = *[[Pete Wilder]] †\n*[[Adam Wilder]]\n|grandchildren = [[Lucas Wilder]]\n|other family = *[[Violet Turner]] ''(daughter-in-law)''\n*[[Anna Wilder]] † ''(daughter-in-law)''\n|first appearance = [[Can't Find My Way Back Home]]\n|last appearance = [[The Hardest Part]]\n|count = 2\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Louise Fletcher]]\n}}\n\n'''Frances Wilder''' was the mother of [[Pete Wilder]].\n\n==History==\n===Killing Henry===\nWhen Pete was a teen, she dated a man named Henry. Henry was good to Pete and Adam and wanted to marry Frances, but during a fight, Frances stabbed Henry to death. ''(\"[[All in the Family]]\")''\n\n===Time in Prison===\nFrances had served 35 years in prison for manslaughter when Adam went to Pete to try to repair their relationship. Pete went to see Frances, but saw that she didn't have any condition that would merit compassionate release. He went to Sam and asked him to lie and get Frances released. Sam offered to lie for him, but Pete spoke to his mother and decided he couldn't go through with it after hearing that his mother didn't feel bad for killing Henry or anything else about Pete's childhood. ''(\"[[Can't Find My Way Back Home]]\")''\n\n===Death===\nFrances came into the ER with an arrhythmia. Sam put in a temporary pacemaker in the ER to stabilize her. She'd been released from prison the previous week after developing congestive heart failure. When questioned, Adam admitted to bribing a guard to give her digoxin. When they learned that, they rushed to reverse the drug's effects.\n\nViolet visited Frances' room. Frances asked Violet to get Pete to visit her. She needed Pete to forgive her before she died. Violet talked to Pete about forgiving Frances, but he said he couldn't. However, he brought Lucas to visit her. He talked about the love he felt for Lucas and wondered how she didn't feel that love. She said it was because of the drinking and the drugs. She asked if it was too late to start over. He introduced Lucas to her. Sam then informed Pete that the damage to her heart was extensive and she would die soon. Pete and Adam sat by her bedside as she died. ''(\"[[The Hardest Part]]\")''\n\n==Relationships==\n===Romantic===\nWhen Pete was a teen, Frances dated a man named Henry, whom Pete says is the first good man that he knew. Henry wanted to marry Frances, but they once had a fight that ended with Frances stabbing Henry to death. ''(\"[[All in the Family]]\")''\n\nPrior to Henry, she had multiple partners, to the point where Pete has no idea who his father is.\n\n===Familial===\nWhile Adam has stuck by her side and defended her actions, Pete resented his mother for killing the only man he ever felt was a good role model for him.\n\n==Notes and Trivia==\n*She was 76 at the time of her death.\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPP4x09FrancesWilder.png|[[Can't Find My Way Back Home]]\nPP4x18FrancesWilder.png|[[The Hardest Part]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP4x18-6.jpg\nPP4x18-8.jpg\nPP4x18-11.jpg\nPP4x18-12.jpg\nPP4x18-17.jpg\nPP4x18-19.jpg\nPP4x18-22.jpg\nPP4x18-23.jpg\nPP4x18-28.jpg\nPP4x18-29.jpg\n</gallery>\n\n==Appearances==\n{{Frances Wilder Appearances}}\n\n{{DEFAULTSORT:Wilder, Frances}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Deceased Characters]]\n[[Category:Patients]]\n[[Category:Patients (Cardio)]]\n[[Category:Patients (ER)]]"}]}}}}