{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"84507": {"pageid": 84507, "ns": 0, "title": "Francesca Lyons", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = 18x10FrancescaLyons.png\n|name = Francesca Lyons\n|status = Alive\n|diagnosis = *Herniated discs\n*Endometriosis\n|doctors = *[[Carina DeLuca]]\n*[[Amelia Shepherd]]\n*[[Jo Wilson]]\n*[[Mabel Tseng]]\n|treatment = *Epidural injections\n*Low-dose, continuous birth control\n|only appearance = [[Living In a House Divided]]\n|seasons = '''[[Grey's Anatomy|GA]]:''' [[Season 18 (Grey's Anatomy)|18]]\n|portrayed by = [[Jasmine Ashanti]]\n}}\n\n'''Francesca Lyons''' is a patient who came into the ER with back pain and was diagnosed with endometriosis.\n\n==History==\nFrancesca came into the ER with pain in her lower back. She'd been in twice before with the same complaint. Amelia had given her epidurals both time. She said the fire week after the injections, she felt great, but then the pain came back. When she mentioned that she was on her period and having horrible cramps in addition to the back pain, Amelia called for a GYN consult. Carina and Jo came and examined her. Francesca explained that she'd been having severe pain with her periods since middle school, so Carina asked if she'd ever been evaluated for endometriosis. She explained the condition and then agreed to do a diagnostic surgery that same day. They took her into surgery, where the diagnosis was confirmed. They removed some of the tissue and then started her on low-dose, continuous birth control to help manage her symptoms.\n\n==Relationships==\n===Romantic===\nShe has a boyfriend who has a boat, which she normally hates. She decided to go with it because he's so hot.\n\n==Notes and Trivia==\n*She was 26 at the time of her diagnosis.\n\n{{DEFAULTSORT:Lyons, Francesca}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S18 Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Neuro)]]\n[[Category:Patients (OB/GYN)]]"}]}}}}