{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49880": {"pageid": 49880, "ns": 0, "title": "Frank Kimble", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP203CaptainFrank.png\n|name = Frank Kimble\n|status = Alive\n|title = Captain\n|diagnosis = *Panic attacks\n*Blackouts\n*Post-traumatic stress disorder\n*Partial-thickness burns\n|doctors = [[Pete Wilder]]\n|treatment = *Herbs\n*Exercises\n*Acupuncture\n*Burn cream\n|job = Fire Captain\n|only appearance = [[Nothing to Talk About]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Ernie Hudson]]\n}}\n\n'''Frank Kimble''' is a fire captain who wore lingerie to cope with panic attacks.\n\n==History==\nFrank, a fire captain, was having panic attacks due to the trauma of several close calls with fires. He was seeing Pete, who gave him herbs and he'd done acupuncture and exercised. However, Frank revealed to Pete that what really helped him was wearing bras. He was worried about how the other firefighters would react if they found out, so he asked Pete to help him stop.\n\nFrank and Pete worked on reducing Frank's panic without using the panties. He felt that the other firefighters wouldn't trust him anymore if they found out and he'd almost been caught twice before.\n\nPete was later paged to the hospital when Frank was burned in a fire. He had partial-thickness burns, but refused to let anyone but Pete touch him. Pete began to treat his burns, but he was shocked when his co-workers came to see him and saw his bra. He told Pete he was done. Pete said he'd be up and around in a few weeks, but Frank maintained that he was quitting. Pete said there was nothing wrong with his coping mechanism. He agreed to go to therapy, but still said he was done. Pete said that if it were him, he wouldn't care what Frank was wearing as long as he got him out alive. He also encouraged Frank to share the burden of his stress with others.\n\n==Career==\nFrank is a fire captain. He'd faced several very serious fires, which gave him a lot of stress.\n\n{{DEFAULTSORT:Kimble, Frank}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (CAM)]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (Trauma)]]\n[[Category:Patients (Plastics)]]\n[[Category:Firefighters]]"}]}}}}