{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52508": {"pageid": 52508, "ns": 0, "title": "Gabi Rivera", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP6x08-4.jpg\n|name = Gabi Rivera\n|status = Alive\n|treatment = Grief counseling\n|marital = Ex-husband\n|job = Writer\n|workplace = '''Former'''<br>\nNational Geographic\n|first appearance = [[Good Grief]]\n|last appearance = [[Life Support]]\n|count = 2\n|seasons = '''[[Private Practice|PP]]:''' [[Season 6 (Private Practice)|6]]\n|portrayed by = [[Marianne Jean-Baptiste]]\n}}\n\n'''Gabi Rivera''' is a woman Violet met at her grief group.\n\n==History==\n===Grief Group===\nGabi was in a grief group. She talked about Ally, her partner. Two doctors said she was brain dead and a third told her not to give up hope. She struggled with the idea of turning off life support, wondering how she'd know that the next day wouldn't be the one where Ally woke up. Ally never gave up on anything, so why should she give up on her? ''(\"[[Good Grief]]\")''\n\n===Ally's Death===\nViolet later saw Gabi at the hospital on the way to grief group. She said she visited Ally every day to tell her she loved her. They then decided together not to go to grief group and instead spent the time together.\n\nA couple weeks later, Gabi and Violet had coffee on a bench. Gabi talked about how she was already starting to forget things about Ally. She couldn't remember the name of the restaurant where they met. She said as long as a chance existed for Ally to wake up, she couldn't give up and the doctors couldn't agree on a possible timeline.\n\nViolet asked Amelia to check on Ally for her. Amelia looked at her scans and said that Ally had no activity and wouldn't be waking up ever. Gabi came in and interrupted them. When Violet introduced Amelia, Gabi asked them to leave.\n\nViolet went to Gabi and admitted she'd overstepped. She wanted to help because Gabi's her friend. Two doctors had already told her what Amelia told her months ago, but she couldn't accept it, so she went to a psychic, which she knows is ridiculous. But the psychic said there was hope. She was worried no one would ever love her like Ally did again. Violet admitted to being relieved when Pete died. Gabi said she wasn't relieved and just wanted Ally back.\n\nA few weeks later, with Violet's help, Gabi decided to turn off the machines and allow Ally to die. ''(\"[[Life Support]]\")''\n\n==Relationships==\n===Romantic===\n====Ex-Husband====\nShe was married to a wonderful man for 8.5 years. She says he was her best friend, but she didn't know there could be more until she met Ally.\n\n====Ally====\nShe met her girlfriend, Ally, in Mexico. Gabi was writing for National Geographic and Ally was taking the pictures. ''(\"[[Life Support]]\")''\n\nShe once did a three-week cleanse with Ally. Two days in, Gabi was eating cookies, but Ally finished it. ''(\"[[Good Grief]]\")''\n\nThey were together for ten years when Ally was left brain dead. Gabi struggled to accept this and refused to give up hope that Ally would wake up.\n\n===Friendships===\nShe and [[Violet Turner]] became friends after meeting in a grief group.\n\n==Career==\nShe used to write for National Geographic. ''(\"[[Life Support]]\")''\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPP6x03GabiRivera.png|[[Good Grief]]\nPP6x08GabiRivera.png|[[Life Support]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP6x08-3.jpg\nPP6x08-4.jpg\n</gallery>\n\n==Appearances==\n{{Gabi Rivera Appearances}}\n\n{{DEFAULTSORT:Rivera, Gabi}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S6 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Psych)]]"}]}}}}