{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"7152": {"pageid": 7152, "ns": 0, "title": "Gabriel Fife", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = PP4x22-22.jpg\n|name = Gabriel Fife\n|status = Alive\n|title = M.D.\n|marital = [[Naomi Bennett]] ''(ex-fiancée)''\n|job = [[Attending]] [[Medical Genetics|Medical Geneticist]]\n|workplace = '''Current'''<br>\n[[National Institutes of Health]]<br>\n'''Former'''<br>\n[[Pacific Wellcare Center]]\n|first appearance = [[Slip Slidin' Away]]\n|last appearance = [[...To Change the Things I Can]]\n|count = 14\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]] and [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Michael Patrick Thornton]]\n}}\n\n'''Gabriel Fife''' was a [[Medical Genetics|medical geneticist]] who fell in love with [[Naomi Bennett]].\n\n==History==\n===Donovans===\nDr. Fife was hired behind Naomi Bennett's back by [[William White]] as a cutting edge genetic specialist who targeted experimental and risky procedures. His first case at [[Pacific Wellcare Center]] was with Naomi. [[Sally Donovan|Sally]] and [[Curtis Donovan]] were both dwarfs. They wanted a dwarf baby and wanted to use selective IVF to get one. Naomi was reluctant, but agreed, until she found that the dwarf embryos also had a mutation that had a 40% chance of causing cancer. He said the Donovans had agreed to go ahead anyway. Naomi talked to the Donovans and said that she would not implant the mutated embryos. Gabriel then told her that medicine would go the way toward genetic engineering whether she was okay with it or not. ''(\"[[Slip Slidin' Away]]\")''\n\n===Neil Delhom===\nWhen Gabriel heard that Pete was trying to keep [[Neil Delhom]] alive for six more weeks so that he could meet his unborn daughter, Gabriel suggested a device that would target the tumor. He implanted the device, but it didn't work, so he suggested instead delivering the baby early. He then said he'd use what he learned to save other lives even though he couldn't save Neil. ''(\"[[Sins of the Father]]\")''\n\n===Colin Bowman===\nWhen [[Colin Bowman|Colin Bowman's]] arm had to be amputated, Gabriel sent him to Sweden to have a bolt implanted that allowed him to get an electronic arm that gave him use similar to his own natural arm. When an infection developed, Gabriel ignore Pete's recommendation to remove the bolt and tried a drug protocol to treat it. When Colin developed neurotoxicity as a result, Gabriel lowered the dosage. When the infection took over his body, Gabriel finally admitted they'd need to remove the bolt and possibly what was left of Colin's arm. Pete instead suggested antibiotic implants, which would fight the infection and give him a chance to keep what was left of his arm. ''(\"[[Best Laid Plans]]\")''\n\n===Fundraising Ball===\nGabriel attended a fundraising ball at which William was being honored. At the ball, he talked to Naomi, but their conversation was interrupted by William. Later, he watched as they left the practice together and shared a kiss. ''(\"[[Love Bites]]\")''\n\n===ALS Antibiotic Trial===\nGabriel started working on an ALS antibiotic trial to slow the muscle decline. He had dinner with Naomi in order to convince her that the work was important and should be accelerated. After finding out from Pete that William had ALS and that's why he was pushing Gabriel's research forward, because he needed it personally. ''(\"[[Triangles]]\")''\n\nWhen it was time for phase two of his trial, Naomi was out of the country, so he had Pete read and approve his application. ''(\"[[Eyes Wide Open]]\")''\n\nWhen William returned to Los Angeles with Naomi, his condition had declined significantly, leading Naomi to ask Gabriel to use his ALS protocol on him, even though it hadn't gotten FDA approval and likely wouldn't if they used it outside the trial. He refused to give William the treatment. However, when Pete got him to realize that he'd said no for the wrong reasons, he said that he'd send over the treatment. ''(\"[[In the Name of Love]]\")''\n\nWilliam refused the treatment and sent Gabriel to the hospital to be with Naomi after Maya's accident. Gabriel was also tasked with telling Naomi that William had refused the treatment and left. ''(\"[[The End of a Beautiful Friendship]]\")''\n\n===Return to Los Angeles===\nGabriel returned to Los Angeles, wanting to woo Naomi after giving her time to mourn William's death. He said that he'd left his job, his home, everything for Naomi. When she became disillusioned by what was happening at the practice, he offered her the chance to go back with him, saying the NIH had thrown money at him to do research. ''(\"[[Love and Lies]]\")''\n\n===House Call===\nGabriel went along with Naomi to see [[Marion]], a patient in assisted living. He figured out that she was upset because her friend had died and she never told him she loved him because she felt that doing so would be betraying her late husband. ''(\"[[Something Old, Something New]]\")''\n\n===Move to New York===\nGabriel gave Naomi one last chance to move to DC with him. However, she refused. At the last minute, she changed her mind and went to the airport. She arrived after the doors were closed, but saw that Gabriel hadn't gotten on the plane, knowing she'd come after him. He proposed and she accepted, but said they'd be moving to New York instead of DC and she'd open an office of the foundation and they'd work together. ''(\"[[...To Change the Things I Can]]\")''\n\n==Relationships==\n===Romantic===\n====[[Naomi Bennett]]====\nAfter she found out Maya was pregnant, Naomi tried to force her to have an abortion. After Maya didn't have one, Naomi went to Gabriel and cried. He held her for a moment, but then she left, saying it never happened. ''(\"[[Best Laid Plans]]\")''\n\nAfter Naomi started dating William, Gabriel told her that she would just be a trophy for William, but he cared about her. He said that she made him a better person. Despite this, she continued to see William. ''(\"[[Fear of Flying]]\")''\n\nThey had dinner together to talk about Gabriel's ALS trial and Gabriel labelled the dinner a date despite Naomi's insistence that it wasn't. She later kissed him despite being with William. ''(\"[[Triangles]]\")''\n\nAfter the kiss, Naomi said that she was seeing William, so they weren't going to talk about it. She was then shocked when Gabriel informed her that William had gone to Switzerland without telling her. After a second conversation about Naomi's unhappiness in her life, they kissed again. Naomi then talked to Charlotte about options for sex because of Gabriel's limited mobility. Gabriel found the guide Charlotte had given her on Naomi's desk. He asked why she didn't just ask him. He clarified that he can have sex and said if she wanted, they could go back to his place with a bottle of wine and see what happened. They ultimately slept together, but Naomi felt guilty because of William. Gabriel then told her about his ALS, causing her to go to Switzerland. ''(\"[[Pulling the Plug]]\")''\n\nHe refused to give William his ALS treatment because he was in love with Naomi and wanted to be with her. But he later said that he wanted to give her what she wanted because he wanted her to be happy. He agreed to have the treatment sent over for William. ''(\"[[In the Name of Love]]\")''\n\nWhen William left to see his daughter in Sun Valley, he told Gabriel to go be with Naomi. ''(\"[[The End of a Beautiful Friendship]]\")''\n\nAfter William died, Gabriel gave Naomi time to mourn between returning to woo her. Naomi agreed to have a meal with him, but continued to resist his advances. When Naomi became disillusioned by life at the practice, Gabriel offered her the chance to go back to the NIH with him. ''(\"[[Love and Lies]]\")''\n\nGabriel followed Naomi around, at the practice and elsewhere, trying to win her over. He attended the party before Cooper and Charlotte's wedding at which he and Naomi shared a kiss. ''(\"[[Something Old, Something New]]\")''\n\nAfter the wedding, they slept together and Gabriel asked Naomi to move to DC with him. She said she wouldn't move with him. ''(\"[[God Bless the Child]]\")''\n\nHe prepared to move, but came back to give Naomi one more chance to say yes to moving with him. She said no, so he left. However, she showed up at the airport and saw that he hadn't gotten on his plane. He proposed and she accepted, on the condition they'd move to New York instead of DC and open an office of the foundation where they'd work together. ''(\"[[...To Change the Things I Can]]\")''\n\nThey later separated. ''(\"[[In Which We Say Goodbye]]\")''\n\n==Career==\nDr. Fife was initially hired by [[William White]] to work under [[Naomi Bennett|Dr. Bennett]] at [[Pacific Wellcare Center]]. As a [[Medical Genetics|medical geneticist]], Dr. Fife worked with other doctors, both from Pacific Wellcare and [[Oceanside Wellness Group|Oceanside Wellness]], to further his cutting edge, yet morally-questionable, research.\n\nDr. Fife later resigned from Pacific Wellcare Center to work for the [[National Institutes of Health|N.I.H.]] and run their research division.\n\n==Notes and Trivia==\n*He told Naomi losing his legs wasn't his worst day, but she said he was full of crap. ''(\"[[Best Laid Plans]]\")''\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPP306GabrielFife.png|[[Slip Slidin' Away]]\nPP308GabrielFife.png|[[Sins of the Father]]\nPP312GabrielFife.png|[[Best Laid Plans]]\nPP314GabrielFife.png|[[Love Bites]]\nPP316GabrielFife.png|[[Fear of Flying]]\nPP317GabrielFife.png|[[Triangles]]\nPP318GabrielFife.png|[[Pulling the Plug]]\nPP319GabrielFife.png|[[Eyes Wide Open]]\nPP322GabrielFife.png|[[In the Name of Love]]\nPP323GabrielFife.png|[[The End of a Beautiful Friendship]]\nPP4x16GabrielFife.png|[[Love and Lies]]\nPP4x20GabrielFife.png|[[Something Old, Something New]]\nPP4x21GabrielFife.png|[[God Bless the Child]]\nPP4x22GabrielFife.png|[[...To Change the Things I Can]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP3x06-12.jpg\nPP3x06-15.jpg\nPP3x06-16.jpg\nPP3x06-17.jpg\nPP3x06-18.jpg\nPP3x12-3.jpg\nPP3x12-4.jpg\nPP3x12-7.jpg\nPP3x12-11.jpg\nPP3x12-13.jpg\nPP3x12-16.jpg\nPP3x12-18.jpg\nPP3x12-20.jpg\nPP3x12-21.jpg\nPP3x12-24.jpg\nPP3x16-2.jpg\nPP3x16-6.jpg\nPP3x16-8.jpg\nPP4x16-4.jpg\nPP4x16-9.jpg\nPP4x20-11.jpg\nPP4x20-12.jpg\nPP4x20-14.jpg\nPP4x22-22.jpg\n</gallery>\n\n==Appearances==\n{{Gabriel Fife Appearances}}\n\n{{DEFAULTSORT:Fife, Gabriel}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Doctors]]"}]}}}}