{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"81477": {"pageid": 81477, "ns": 0, "title": "Gabriella Aurora", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = S194x08-2.jpg\n|name = Gabriella Aurora\n|alias = Gabri\n|status = Alive\n|title = M.D.\n|job = Doctor\n|workplace = Paolo Calvino Hospital\n|first appearance = [[Make No Mistake, He's Mine]]\n|last appearance = [[Comfortably Numb]]\n|count = 2\n|seasons = '''[[Station 19|S19]]:''' [[Season 4 (Station 19)|4]]\n|portrayed by = [[Gabriella Pession]]\n}}\n\n'''Gabriella Aurora''' is one of Carina's friends from medical school.\n\n==History==\n===Visiting Carina===\nGabriella and [[Carina DeLuca]] met when they were in medical school. Due to their very busy, exhausting schedules, they never dated, but sometimes had sex to get a release. During their time in medical school together, they took a road trip in a car with a broken air conditioner, but still had a good time. At another point, Andrew visited them and stayed in Gabriella's room, which excited him.\n\nYears later, when Gabriella heard that Andrew had been killed, she drove overnight to Seattle to see Carina. She made Carina espresso and food and they pored over memories of their time in medical school and memories of Andrew. Gabriella chided Maya for not speaking Italian and not being able to make good espresso for Carina, though Maya said she was trying to learn. When Maya left to deal with a friend emergency, they continued to share memories until Carina left to help Maya. ''(\"[[Make No Mistake, He's Mine]]\")''\n\n===Return to Italy===\nAs the pandemic worsened in Italy, Gabriella traveled back to Italy to help out. Carina planned to join her. The day Carina was meant to fly out, Gabriella correctly deduced that Carina had not even begun packing. Gabriella called Carina several times throughout the day, asking for help working out problems she was having. At the end of the day, when Maya and Carina had a fight and Carina left for the airport on her own, Carina told Gabriella that Maya had proposed, but Carina didn't want to get married just to get a visa. Gabriella encouraged her to do it if the alternative was losing Maya, saying that she'd never seen Carina light up the way she did when she was with Maya. Even when she was grieving, it was clear that Maya made her happy. ''(\"[[Comfortably Numb]]\")''\n\n==Relationships==\n===Friendships===\nShe and Carina have been friends since meeting in medical school. Despite having sex during this time, they never dated.\n\n==Career==\nShe is a doctor of some kind working at Paolo Calvino Hospital in Italy.\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nS194x08GabriellaAurora.png|[[Make No Mistake, He's Mine]]\nS194x14GabriellaAurora.png|[[Comfortably Numb]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS194x08-1.jpg\nS194x08-2.jpg\nS194x08-3.jpg\nS194x08-4.jpg\nS194x08-5.jpg\n</gallery>\n\n==Appearances==\n{{Gabriella Aurora Appearances}}\n\n[[de:Gabriella Aurora]]\n\n{{DEFAULTSORT:Aurora, Gabriella}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:Doctors]]"}]}}}}