{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51232": {"pageid": 51232, "ns": 0, "title": "Gary Woodward", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x19GaryWoodward.png\n|name = Gary Woodward\n|status = Alive\n|marital = [[Val Woodward]] ''(wife)''\n|children = Daughter\n|only appearance = [[What We Have Here...]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Gabriel Olds]]\n}}\n\n'''Gary Woodward''' is the husband of [[Val Woodward]].\n\n==History==\nGary's wife, Val, was 25 weeks pregnant. During a routine exam, Sam saw that her glands were swollen, so he did a biopsy. The biopsy revealed Burkitt's lymphoma. Because it was so aggressive, they suggested getting her to the hospital immediately for more testing. The type of cancer she had made chemotherapy her only option, but she couldn't start treatment while she was pregnant. She didn't have time to wait until she reached full term in her pregnancy, so Addison suggested delivering the baby immediately. Gary wanted to deliver and start treatment, but Val said with all the past miscarriages, she wanted to carry the baby to term, even if it killed her.\n\nVal was admitted to the hospital for testing. She told Addison that Gary said he could deal with being with a career woman, but no kids would be a deal breaker for him. When Addison pushed a little more, Val admitted she'd had an abortion early in their marriage without telling Gary. While talking to Addison, Val started to have trouble breathing, so Addison gave her oxygen.\n\nEven though her condition was deteriorating and she had a problem with her heart, Val continued to insist that she didn't want to start treatment yet. Gary said he wanted to be a parent, but not without her. Val admitted that she'd had an abortion. He was upset and left the room.\n\nDespite his anger, Gary stayed in the waiting room because he couldn't leave. Addison spoke to him and convinced him to tell Val to have the c-section. After the c-section, they watched over their baby in the NICU.\n\n==Relationships==\n===Romantic===\nHe is married to [[Val Woodward]].\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP4x19-4.jpg\nPP4x19-12.jpg\nPP4x19-13.jpg\nPP4x19-14.jpg\nPP4x19-15.jpg\nPP4x19-16.jpg\n</gallery>\n\n{{DEFAULTSORT:Woodward, Gary}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]"}]}}}}