{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"22213": {"pageid": 22213, "ns": 0, "title": "Georgie Schwartz", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x06GeorgieSchwartz.png\n|name = Georgie Schwartz\n|status = Alive\n|diagnosis = *PVS\n*Pregnancy\n|doctors = *[[Addison Forbes Montgomery]]\n*[[Amelia Shepherd]]\n|treatment = Surgery\n|marital = [[Bob Schwartz]] ''(husband)''\n|only appearance = [[All in the Family]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n}}\n'''Georgie Schwartz''' was a patient who was in a persistent vegetative state following a ski accident when she was 31.\n\n==History==\nGeorgie was in a ski accident when she was 31 and never regained consciousness. However, her husband, [[Bob Schwartz|Bob]], refused to give up hope. He perceived the remaining reflexes as signs of life. When Amelia was brought in to consult on her case, her husband insisted that Amelia run tests to see if anything could be done for Georgie. The results of the labs showed that Georgie was pregnant. They immediately assumed that she had been raped by a staff member at her care facility. However, when her husband found out, he admitted that he had gotten her pregnant and was excited about it. She had some bleeding and was taken to the hospital.\n\nWhile Georgie was being treated, Bob spoke to Sheldon, who tried to get him to come to terms with Georgie's condition. Despite Addison's best efforts, she could not continue the pregnancy. Bob was devastated, but agreed to keeping seeing Sheldon to work on it. However, when Addison heard Bob telling Georgie they'd try again for another baby, she called the police on him.\n\n==Relationships==\n===Romantic===\nShe and [[Bob Schwartz]] were married prior to her accident. Following the accident, he remained convinced that she would wake up and that she was interacting with him, despite the assurances of multiple doctors.\n\n{{DEFAULTSORT:Schwartz, Georgie}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (Neuro)]]\n[[Category:Patients (MFM)]]"}]}}}}