{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50773": {"pageid": 50773, "ns": 0, "title": "George Walters", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP322GeorgeWalters.png\n|name = George Walters\n|status = Alive\n|only appearance = [[In the Name of Love]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Larry Clarke]]\n}}\n\n'''George Walters''' is the man who kidnapped [[Lainie]] and kept her prisoner for 15 years.\n\n==History==\nGeorge came into the ER with a woman he called Kim, whom he claimed was his daughter. She was 30 weeks pregnant and had serious back pain. She hadn't had any prenatal care, but Addison said the baby was the appropriate size for her gestation. She called in Sam for a consult, noting that something was off about the two of them.\n\nHer scans revealed an abdominal aortic aneurysm, so they said they wanted to keep her at the hospital to watch her and run more tests and delay surgery because of her pregnancy. They also asked for a family medical history. George insisted on accompanying Kim to all of her tests.\n\nWhen Sam reviewed a second set of scans and said she needed surgery right away, even with the risks to the baby. She tested positive for the gene associated with fibrillin disease, which caused the aneurysm. It also revealed that George wasn't biologically related to her because he didn't have the disease.\n\nSam used the excuse of running more tests to get Kim away from George and took her to talk to Sheldon.\n\nShe told Sheldon she didn't remember her mother, whom they had said was dead, at all. He asked her about future plans. She said George didn't think she needed to go to college. She then asked about him. He then told her that the condition she had could only have been inherited from a father and George didn't have it.\n\nAfter speaking to her, Sheldon said he believed they were witnessing an abducted girl and her kidnapper. George overheard that and tried to take Kim out of the hospital. Sheldon called security while Sam restrained George. Kim was taken into surgery and George was arrested.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP3x22-4.jpg\nPP3x22-11.jpg\nPP3x22-12.jpg\n</gallery>\n\n{{DEFAULTSORT:Walters, George}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]"}]}}}}