{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"81342": {"pageid": 81342, "ns": 0, "title": "Gideon", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S194x07Gideon.png\n|name = Gideon\n|status = Alive\n|only appearance = [[Learning to Fly]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 4 (Station 19)|4]]\n|portrayed by = [[Neil Haskell]]\n}}\n\n'''Gideon''' is a cult member who dislocated his shoulder falling off a tree stump.\n\n==History==\nAt some point, Gideon joined a cult led by [[Brother John]]. When John climbed on the roof and began to dance, Gideon danced along on the ground. When firefighters arrived to get John off the roof, Gideon told them they just didn't understand what John was doing. He also insisted the followers weren't doing drugs and were simply high on the magic of humanity.\n\nLater, the firefighters noticed that Gideon was hyperventilating, but noted he could be doing it on purpose. However, he then sat back on a tree stump and fell off it, so they rushed to his aid. Despite being injured, including having disclosed his shoulder, he continued to dance and refused to let them treat him. When they tried, he licked Dean's forehead. Despite this, they continued to try to help him. [[Officer Buckner]] came over to help, but Gideon grabbed him around his chest with both arms. Buckner pushed him off, but let him continue dancing. Gideon then tried to lick his face too.\n\nGideon was still present when John jumped off the roof and he cheered with the rest of the cult when John emerged from the air bag.\n\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}