{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51244": {"pageid": 51244, "ns": 0, "title": "Gina Rakoff", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x21GinaRakoff.png\n|name = Gina Rakoff\n|status = Alive\n|marital = [[Phil Rakoff]] ''(husband)''\n|children = [[Marshall Rakoff]]\n|only appearance = [[God Bless the Child]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Wendy Hoopes]]\n}}\n'''Gina Rakoff''' is the former foster mother of [[Betsey Parker]].\n\n==History==\nGina and her husband, Phil, came into the ER when their foster daughter, Betsey, fell down the stairs. Because of that injury and a previous healed clavicle fracture, Cooper suspected she was being abused. Naomi got Gina and Phil out of the room and Cooper asked her about it, but she said she fell. When they figured out what was happening, the Rakoffs asked Cooper to leave.\n\nCooper called in [[Gladys]] because of his concerns. Gladys said she believed he was wrong, but she'd follow-up on his complaint.\n\nLater, while eating ice cream with Marshall, Sheldon had concerns that Marshall was the one who had hurt Betsey. He went to the Rakoffs about it, but they were angry at the implication and refused to listen.\n\nSheldon went to Gina alone and deduced that she'd already been concerned about Marshall. She said that she'd known for a while that he was different, but she didn't want to see it. She thought bringing another kid into their home would give him a friend. She told a comatose Betsey that she loved her and left, saying she needed to put Marshall first.\n\n==Relationships==\n===Romantic===\nShe is married to [[Phil Rakoff]].\n\n===Familial===\nHer son, Marshall, has emotional problems. Because of this, she and her husband stopped fostering Betsey to focus on his care.\n\n{{DEFAULTSORT:Rakoff, Gina}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]"}]}}}}