{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52334": {"pageid": 52334, "ns": 0, "title": "Gloria Murphy", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP5x15GloriaMurphy.png\n|name = Gloria Murphy\n|status = Deceased\n|diagnosis = *Congestive heart failure\n*Pregnancy\n|doctors = *[[Sam Bennett]]\n*[[Jake Reilly]]\n*[[Addison Forbes Montgomery]]\n|treatment = *Vaginal delivery\n*Surgery\n|marital = [[Mr. Murphy]] ''(husband)''\n|children = Daughter\n|only appearance = [[You Break My Heart]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Private Practice)|5]]\n|portrayed by = [[Dahlia Salem]]\n}}\n'''Gloria Murphy''' is a patient who became pregnant despite medical advice.\n\n==History==\nGloria came into the ER with difficulty breathing. Sam was shocked when the paramedic said she was 30 weeks pregnant because she had received a heart transplant and he'd previously warned her as her doctor that pregnancy in her condition could kill her. Jake then arrived and said he'd gotten her pregnant, unaware that she'd had a transplant.\n\nThey advised that she have a c-section immediately to reduce the strain on her heart. She refused.\n\nGloria's condition continued to deteriorate. Sam said she needed to go to the cath lab, but she refused because it could cause precipitous labor. Sam was confused as to why she was starting to reject her heart until she confessed that she'd stopped taking her anti-rejection meds when she got pregnant because she was worried about them hurting the baby. Her water then broke and she was rushed into labor and delivery, where she quickly gave birth. She lost pulse, so Sam cracked her chest in the delivery room while Addison finished delivering her baby. Her aorta was dissected and Sam tried to repair it, but she unfortunately died in the delivery room.\n\nHer husband held their daughter by Gloria's bedside and wondered what he'd name her because they hadn't talked about girls' names.\n\n==Relationships==\n===Romantic===\nShe was married to [[Mr. Murphy]] until her death.\n\n===Familial===\nHer daughter was born shortly before she died.\n\n==Notes and Trivia==\n*They planned to use the name Thomas for a boy.\n\n{{DEFAULTSORT:Murphy, Gloria}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]\n[[Category:Deceased Characters]]\n[[Category:Patients]]\n[[Category:Patients (Cardio)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (REI)]]"}]}}}}