{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50005": {"pageid": 50005, "ns": 0, "title": "Gracie Rousakis", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP212GracieRousakis.png\n|name = Gracie Rousakis\n|status = Unknown\n|diagnosis = *Cystic fibrosis\n*Burkholderia cepacia\n|doctors = *[[Cooper Freedman]]\n*[[Pete Wilder]]\n*[[Addison Forbes Montgomery]]\n*[[Wyatt Lockhart]]\n|treatment = CF meds\n|siblings = Julian Rousakis\n|parents = *[[Daron Rousakis]]\n*Mother †\n|other family = Aunt\n|only appearance = [[Homeward Bound]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Darcy Rose Byrnes]]\n}}\n\n'''Gracie Rousakis''' is a cystic fibrosis patient who contracted a very serious bacterial infection.\n\n==History==\nGracie came into the practice with her father and brother, all of whom had cystic fibrosis. They examined the family and ran some labs. Gracie's tests came back and revealed that she had burkholderia cepacia, an aggressive bacteria. She had to be isolated from her brother and father because the bacteria is highly contagious among cystic fibrosis patients. Cooper took her over to the hospital and got her into isolation.\n\nDaron struggled with having to choose between letting Gracie die alone or being with her and leaving Julian behind without a father. When [[Wyatt Lockhart]] saw Gracie, he proposed a solution, saying that he'd had success treating a similar condition in cancer patients. Daron agreed to try, even after being told it was a long shot.\n\nThey extracted the bacteria from Gracie's lungs and then tried several antibiotic combinations to treat it. However, none of them work and Pete had to tell Gracie that she was going to die. Unable to watch Gracie die alone, Daron handed Julian and the keys to his house over to the doctors and broke isolation to be with Gracie, exposing himself to the bacteria.\n\n==Relationships==\n===Familial===\nGracie's mother had died and her brother and father both have cystic fibrosis like herself.\n\n==Notes and Trivia==\n*She got a camera for her birthday.\n*She was nine at the time of her infection.\n*She loves horses.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP2x12-2.jpg\nPP2x12-4.jpg\nPP2x12-7.jpg\nPP2x12-9.jpg\nPP2x12-10.jpg\nPP2x12-12.jpg\nPP2x12-13.jpg\n</gallery>\n\n{{DEFAULTSORT:Rousakis, Gracie}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Peds)]]"}]}}}}