{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"67819": {"pageid": 67819, "ns": 0, "title": "Grant (Station 19)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = S192x07-39.jpg\n|name = Grant\n|status = Alive\n|grandparents = *[[Edith]]\n*Grandfather †\n|job = *Yoga teacher\n*Line cook\n|first appearance = [[Reignited]]\n|last appearance = [[Crash and Burn]]\n|count = 9\n|seasons = '''[[Station 19|S19]]:''' [[Season 1 (Station 19)|1]] and [[Season 2 (Station 19)|2]]\n|portrayed by = [[Sterling Sulieman]]\n}}\n'''Grant''' is the ex-boyfriend of [[Travis Montgomery]].\n\n==History==\n===Helping Edith===\nGrant takes care of his grandmother, Edith. When she started having tremors and falling often, Edith chose not to tell Grant about it because she didn't want him to worry. However, when Travis was checking on Edith while Grant was visiting, he told Grant that she needed to see a doctor very soon. ''(\"[[Reignited]]\")''\n\n===Re-Meeting Travis===\nGrant saw Travis again at a yoga place. Grant gave Travis his number, but Travis didn't use it. They were both lured to Edith's apartment under false pretenses, where she tried to set them up. Travis told Grant he was interested in seeing him again, but when Grant tried to make plans, Travis just said he'd be in touch.\n\nThe next morning, Grant came to the station. Travis told him he doesn't date, but then Grant laid out his plans for their first few dates and Travis agreed to get breakfast. ''(\"[[Let It Burn]]\")''\n\n===Breakfast===\nGrant made Travis the promised breakfast, eggs cooked in a jar, which he promised would be the best thing Travis ever tasted. After tasting the eggs, Travis agreed. ''(\"[[Hot Box]]\")''\n\n===Visiting the Station===\nGrant went shopping with Travis one morning before work and helped him bring the groceries into the station. While he was there, Travis learned he'd made plans with Maya and Vic to do aerial yoga. Travis thought it was strange that they were making plans and walked Grant out. Grant said he didn't want Travis playing games and if he needed to go slower, that was okay. ''(\"[[Not Your Hero]]\")''\n\n===Travis's Recovery===\nGrant came to the hospital when he learned that Travis has been taken there. They wouldn't tell him anything at the desk because he wasn't family, but Ben and  Vic filled him in on Travis's condition. He was confused about Travis having been left alone and angry when he learned that Ben had left him. He waited with Ben and Vic for news about Travis. Travis ultimately made it through his surgery and Grant took care of him as he recovered. ''(\"[[No Recovery]]\")''\n\nAfter six weeks, Travis was ready to try to go back to work, but Grant wanted him to ask for more time off. Travis went into work one day to talk to Sullivan about that, but got caught up in helping in the search for Max and felt he was ready to step back into work. Grant was upset by this, but Travis reassured him that it was the right decision. ''(\"[[Under the Surface]]\")''\n\n===Investor Meeting===\nGrant had a meeting with a restaurant investor. He needed the dry cleaning that Travis had picked up for him, which Travis accidentally left at the fire station, so Grant said he'd pick it up during his break. When he arrived, he met Sullivan and was surprised by how attractive he was. ''(\"[[Do a Little Harm...]]\")''\n\n===Friendsgiving===\nWhen the restaurant where Grant works decided to stay closed during the windstorm, Grant ended up going to Friendsgiving with Travis. When he arrived, he was enlisted to help with the cooking. After the team was called away, he helped Greg, Ryan, and Pruitt move the meal to the station. While the team was gone on a call, they finished the meal and player poker while they waited for their return. When the team returned, they sat down to eat. ''(\"[[Weather the Storm]]\")''\n\nGrant expressed his desire to leave the station after Friendsgiving was over, but couldn't because it was still stormy outside. When conditions improved, Travis told him he could leave. Before he left, they got into a fight and decided to end their relationship, because they wanted different things. ''(\"[[Crash and Burn]]\")''\n\n==Relationships==\n===Romantic===\nHe started seeing Travis after his grandmother set them up. ''(\"[[Let It Burn]]\")'' Travis told Grant they they'd have to go very, very slow for him to ease back into dating. Grant was okay with that, but after a difficult shift, Travis went to Grant, kissed him, and told him he didn't want a slow burn. ''(\"[[Hot Box]]\")'' When Travis was injured in the skyscraper fire, Grant took care of him during his recovery. ''(\"[[No Recovery]]\")'' Due to Travis being injured, they skipped over a lot of the early courtship, including having sex. To combat this, Travis wore part of his fire uniform and seduced Grant. ''(\"[[Do a Little Harm...]]\")''\n\nDuring Friendsgiving, things became awkward when Greg assumed Grant and Travis were married after seeing Travis's ring and Grant denied it quickly and emphatically. This worried Travis, who asked Grant about it at the end of the day. Grant revealed that he didn't want to get married. ''(\"[[Weather the Storm]]\")'' Travis tried to talk to Grant about this, but they ended up having sex instead. Later, when Travis was left behind to look after Jack, who then ran away, they talked again. Travis said he wanted to get married again, as he had enjoyed being married. They argued over it and Travis called him Michael during the argument, so they both agreed it wasn't working and parted ways. ''(\"[[Crash and Burn]]\")''\n\n===Familial===\nHe takes care of his grandmother. His grandfather died of Parkinson's. ''(\"[[Reignited]]\")''\n\n==Career==\nHe teaches yoga. He was also recently promoted to line cook at his restaurant. ''(\"[[Let It Burn]]\")''\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nS191x04Grant.png|[[Reignited]]\nS191x07Grant.png|[[Let It Burn]]\nS191x09Grant.png|[[Hot Box]]\nS191x10Grant.png|[[Not Your Hero]]\nS192x01Grant.png|[[No Recovery]]\nS192x02Grant.png|[[Under the Surface]]\nS192x05Grant.png|[[Do a Little Harm...]]\nS192x07Grant.png|[[Weather the Storm]]\nS192x08Grant.png|[[Crash and Burn]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS191x10-3.jpg\nS191x10-6.jpg\nS191x10-7.jpg\nS191x10-19.jpg\nS192x07-31.jpg\nS192x07-36.jpg\nS192x07-39.jpg\nS192x07-48.jpg\nS192x07-49.jpg\nS192x07-50.jpg\nS192x07-51.jpg\nS192x07-52.jpg\nS192x07-55.jpg\nS192x07-56.jpg\nS192x07-57.jpg\nS192x07-58.jpg\nS192x07-59.jpg\nS192x07-63.jpg\nS192x07-65.jpg\nS192x07-66.jpg\nS192x07-67.jpg\nS192x07-68.jpg\nS192x07-69.jpg\n</gallery>\n\n==Appearances==\n{{Grant Appearances}}\n\n[[es:Grant]]\n\n{{DISPLAYTITLE:Grant}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S1 Characters]]\n[[Category:S19 S2 Characters]]"}]}}}}