{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"70534": {"pageid": 70534, "ns": 0, "title": "Gregory Dougal", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S192x03GregoryDougal.png\n|name = Gregory Dougal\n|born = October 17, 1978\n|status = Alive\n|marital = [[Janet (Home To Hold Onto)|Janet]] ''(ex-wife)''\n|children = [[Lindy Dougal]]\n|job =\n|workplace = \n|only appearance = [[Home To Hold Onto]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 2 (Station 19)|2]]\n|portrayed by = [[Tom Costello]]\n}}\n\n'''Gregory Dougal''' is a man who was caught in the process of kidnapping his daughter.\n\n==History==\nGregory was upset with the custody arrangement after he and [[Janet (Home To Hold Onto)|Janet]] got divorced. He impulsively decided to kidnap Lindy and disappear with her. As he fled with her, he was pulled over by Ryan, who was suspicious of Gregory because he saw the ring tan line and a quickly packed bag for Lindy. He went back to his squad car and radioed in his suspicions. When it was confirmed that there was an Amber alert out for Lindy, Ryan stalled while they waited for additional help to arrive. Sensing that Gregory was starting to get impatient, Ryan went over to his car and quietly explained that it wouldn't end well for him if he fled with Lindy and convinced him to turn himself in and let Lindy go back with her mother while he was arrested.\n\n==Relationships==\n===Romantic===\nHe is divorced from [[Janet (Home To Hold Onto)|Janet]]. Together, they have a daughter, [[Lindy Dougal|Lindy]].\n\n===Familial===\nHe was upset with the custody arrangement for his daughter after his divorce, which led him to try to kidnap her.\n\n==Notes and Trivia==\n*He lives at 6550 Cerritos Street in Seattle, Washington\n*He's 5'9\", weighs 180 lbs., and has brown eyes.\n*He drives a 2007 Honda Accord.\n\n{{DEFAULTSORT:Dougal, Gregory}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S2 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}