{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"84168": {"pageid": 84168, "ns": 0, "title": "Greg (Season 5)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S195x08Greg.png\n|name = Greg\n|status = Alive\n|marital = [[Amy]] ''(wife)''\n|children = Son\n|only appearance = [[All I Want for Christmas is You]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Michael Emery]]\n}}\n\n'''Greg''' is a man who was abusing his wife.\n\n==History==\nGreg's wife, Amy, was making eggs for their son for dinner when Greg got angry and attacked her, throwing the pan of eggs across the kitchen floor. Afterward, he acted as if nothing would happen, even when Crisis One responded to the call that Amy was having an anxiety attack. He told them that she had panic attacks all the time and minimized their concerns about her, saying they could leave and she would be fine. However, they had recognized the signs of domestic violence and Amy had quietly confirmed that she wasn't safe in the home. Jack stepped away to call the police and Vic impulsively picked up their son and told Amy it was time to leave. Greg called the polce himself and reported it as an attempted kidnapping. However, when police arrived, they found bruises on Amy and arrested Greg. They were only going to keep him overnight to let him calm down, but while he was gone, Vic helped Amy pack to leave for her cousin's in Portland and tell the police she wanted to press charges against him.\n\n==Relationships==\n===Romantic===\nHe is currently separated from [[Amy]] after he continuously abused her.\n\n===Familial===\nHe and Amy have a son, whom Greg used to keep Amy from leaving.\n\n==Notes and Trivia==\n*He and Amy lived at 1163 Forrester Lane until she left him.\n\n{{DISPLAYTITLE:Greg}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]"}]}}}}