{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49938": {"pageid": 49938, "ns": 0, "title": "Gregory Milford", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP207GregoryMilford.png\n|name = Gregory Milford\n|status = Alive\n|marital = [[Tess Milford]] ''(wife)''\n|children = Expecting twins\n|only appearance = [[Tempting Faith]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Scott Michael Campbell]]\n}}\n\n'''Gregory Milford''' is the husband of [[Tess Milford]].\n\n==History==\nGregory's wife, Tess, was pregnant with triplets after using IVF. An ultrasound showed that two of the triplets had TTTS, so Addison wanted to operate. However, the Milfords were religious and decided not to interfere a second time.\n\nTess later collapsed at the airport. One of the babies had fluid around his heart and Tess was mirroring. She stabilized while resting, but was advised that that wasn't enough. Addison pleaded with Gregory to let her help Tess. Tess had the surgery, but had a reaction to the anesthesia, so Addison wasn't able to finish.\n\nAddison later got paged to Tess's bedside. Addison did an ultrasound and determined that the triplet not involved in the connection had died. Tess begged Addison for her help. Addison said she was too weak for another surgery. Addison said they could do local, but it was too danger. Tess implored her to try something, so Addison agreed and did the surgery with local anesthesia. It was successful and the blood vessels were separated.\n\n==Relationships==\n===Romantic===\nHe is married to [[Tess Milford]].\n\n===Familial===\nDesperate to have children, Tess and Gregory turned to IVF. They had one embryo implanted and it split into triplets. However, one of the triplets later died in utero.\n\n{{DEFAULTSORT:Milford, Gregory}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]"}]}}}}