{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50134": {"pageid": 50134, "ns": 0, "title": "Greg Bishop", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP218Greg.png\n|name = Greg Bishop\n|status = Alive\n|marital = [[Terri Bishop]] ''(wife)''\n|children = [[Annie Bishop]]\n|only appearance = [[Finishing]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Vince Grant]]\n}}\n'''Greg Bishop''' is the father of [[Annie Bishop]].\n\n==History==\nGreg's daughter, Annie, had a cardiac tumor. She was scheduled to have the tumor removed. [[Noah Barnes]] operated, but wasn't able to get the whole tumor. He said he believed chemo would shrink it more and then he'd be able to remove the rest in another month. Annie didn't believe them, as that's what they'd said the last time. She said she didn't want more surgery.\n\nA month later, after chemo, her labs looked good. She said she still didn't want the surgery. She talked to Cooper and said that she wanted to feel good for a little bit and live her life and be normal for a while before she died. Her parents and doctors had a meeting and Cooper stood up for her, saying that stopping the treatment might be the best thing for her. Noah still insisted he could help, but her parents decided they wanted to take her home. Cooper went to take her catheter out, but Charlotte stopped him, saying Noah was going to a judge to get a court order. [[Judge McLennan]] came in and ruled that her catheter would stay in and she'd have the surgery on the first available date.\n\nAfter another month, Annie was upset. She believed she'd die in the hospital. After seeing her condition, [[Charlotte King]] went to Noah and said she supported the decision to end treatment and questioned who Noah was really fighting for. Noah went to Cooper and said he wouldn't push anymore. He told the judge he reevaluated his position. Annie was told that once the catheter was out, it would be hard to get it back in, meaning they wouldn't be able to get medicine to her fast enough if something went wrong. Annie said it was okay and that she'd finally get to see the ocean.\n\nA month later, on Annie's 13th birthday, she had a party on the beach and was able to surf and talk to her friends.\n\n==Relationships==\n===Romantic===\nHe is married to [[Terri Bishop]].\n\n===Familial===\nHis daughter, Annie, had a cardiac tumor. Despite not wanting to lose her, he and his wife supported her decision to stop treatment and live the life she had left.\n\n{{DEFAULTSORT:Bishop, Greg}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]"}]}}}}