{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"70657": {"pageid": 70657, "ns": 0, "title": "Greg Tanner", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = S192x07-64.jpg\n|name = Greg Tanner\n|status = Alive\n|marital = Ex-wife\n|children = [[Ryan Tanner]] †\n|first appearance = [[Lost and Found]]\n|last appearance = [[I Fought the Law]]\n|count = 5\n|seasons = '''[[Station 19|S19]]:''' [[Season 2 (Station 19)|2]]\n|portrayed by = [[Dermot Mulroney]]\n}}\n\n'''Greg Tanner''' is the father of [[Ryan Tanner]].\n\n==History==\n===1993 Storm===\nIn 1993, there was a windstorm, during which Pruitt had to board up the Tanners' windows.<ref>[[Weather the Storm]], 2x07 (S19)</ref>\n\n===Finding Ryan===\nGreg was at the scene when they arrested a man during a poker game. He hid in a closet while the other players were asked to give statements. Ryan found him. He'd figured out that his father was there when he saw his father's favorite cigarette at the table. Greg immediately offered to give up any information he had, but Ryan said they just wanted a statement because they weren't after him this time. Ryan was also upset to learn that Greg had been back in Seattle for two and a half months and hadn't contacted him. When Greg then asked for a ride, Ryan tried to refuse, but ended up taking Greg to his next call, where he left Greg in the back seat while he interviewed someone who claimed to have been robbed. Greg told Ryan that the guy hadn't been robbed and explained why. Ryan then revealed he knew the whole time, because Greg had taught him to think like a criminal his whole life. At the end of the day, Greg told Ryan that he wanted to grow a relationship with Ryan, but Ryan said he didn't need one or want one. ''(\"[[Lost and Found]]\")''\n\n===Fight===\nOn his way to meet with his son, Greg saw a couple people trying to attack a kid. He stepped in to break up the fight, but they turned their attention to him instead and beat him up. He walked over to Station 19 to ask Pruitt to patch him up. He instead found Andy and Maya. Andy knew who he was and started to patch up his injuries. She wanted to take him to the hospital, but he refused, so she had him sign a waiver. When she and Maya were called out, Pruitt took over patching up his injuries. After a confrontation with Ryan, who believed he was lying about defending a kid, he tried to leave the station. However, when Andy and Maya returned to the station, they found him passed out in the elevator. They believed he had a cardiac bruise. They were able to resuscitate him and sent him to the hospital, where Ryan accompanied him, having heard from police dispatch that a civilian had intervened in a fight as Greg described. ''(\"[[Last Day on Earth]]\")''\n\n===Friendsgiving and Arrest Warrant===\nGreg stayed with Ryan while he recovered from his injuries. Ryan decided to bring him to Friendsgiving. When the team was called away, Greg had the idea to bring Friendsgiving to the station for them. While they waited for the team to return from their call, they played poker and reminisced. At the end of the day, they sat down to eat with the returned team, but Greg went to find Ryan, who revealed there was a warrant out for Greg's arrest. He told Greg he had two choices: he could arrest Greg or he could let Greg go and never ever see him again and he wasn't sure which he was going to do. ''(\"[[Weather the Storm]]\")''\n\nGreg told Ryan to arrest him and Ryan agreed, but used the storm as an excuse to put it off. ''(\"[[Crash and Burn]]\")''\n\nAfter disappearing, Greg resurfaced because he wanted to give Ryan the key to a storage unit, which he said held something for him. Ryan went to the unit and found a large amount of money, which he said was clean and told Ryan to use for the mortgage. ''(\"[[I Fought the Law]]\")''\n\n==Relationships==\n===Romantic===\nHe is divorced from Ryan's mother.\n\n===Familial===\nHe is estranged from his son.\n\n==Notes and Trivia==\n*He likes gambling and cigars.<ref>[[Lost and Found]], 2x04 (S19)</ref>\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" crop=\"true\" position=\"center\" hideaddbutton=\"true\">\nS192x04GregTanner.png|[[Lost and Found]]\nS192x06GregTanner.png|[[Last Day on Earth]]\nS192x07GregTanner.png|[[Weather the Storm]]\nS192x08GregTanner.png|[[Crash and Burn]]\nS192x09GregTanner.png|[[I Fought the Law]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS192x04-14.jpg\nS192x04-15.jpg\nS192x04-16.jpg\nS192x04-17.jpg\nS192x04-18.jpg\nS192x04-19.jpg\nS192x04-20.jpg\nS192x04-21.jpg\nS192x04-22.jpg\nS192x04-23.jpg\nS192x04-24.jpg\nS192x06-11.jpg\nS192x06-12.jpg\nS192x06-13.jpg\nS192x06-14.jpg\nS192x06-25.jpg\nS192x06-26.jpg\nS192x06-27.jpg\nS192x06-28.jpg\nS192x06-29.jpg\nS192x06-30.jpg\nS192x06-31.jpg\nS192x06-32.jpg\nS192x06-33.jpg\nS192x06-34.jpg\nS192x06-35.jpg\nS192x06-37.jpg\nS192x06-38.jpg\nS192x06-39.jpg\nS192x06-40.jpg\nS192x07-64.jpg\nS192x07-65.jpg\nS192x07-66.jpg\nS192x07-67.jpg\nS192x07-68.jpg\nS192x07-69.jpg\nS192x09-1.jpg\nS192x09-2.jpg\nS192x09-5.jpg\nS192x09-15.jpg\nS192x09-16.jpg\n</gallery>\n\n==Appearances==\n{{Greg Tanner Appearances}}\n\n{{Scrollbox}}\n\n{{DEFAULTSORT:Tanner, Greg}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S2 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}