{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51512": {"pageid": 51512, "ns": 0, "title": "Greg Gilbert", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP5x02GregGilbert.png\n|name = Greg Gilbert\n|status = Alive\n|marital = [[Jessica Gilbert]] ''(wife)''\n|children = [[Kerri Gilbert]]\n|only appearance = [[Breaking the Rules]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Private Practice)|5]]\n|portrayed by = [[David Barry Gray]]\n}}\n'''Greg Gilbert''' is the father of [[Kerri Gilbert]].\n\n==History==\nGreg's daughter, Kerri, was in the hospital. Her labs showed that despite a bone marrow transplant from Greg, her cancer had returned. The only option left was a cord blood transfusion. Cooper said they'd search the public donor banks. There were no matches, so Cooper asked Charlotte to search the private banks. She refused because that cord blood is for the families' personal use.\n\nCooper went to watch a movie with Kerri. She said she was tired and asked if he'd come back the next day. He said he couldn't, but could come back Saturday, prompting her to ask if she'd still be alive on Saturday. Cooper then used Charlotte's computer to search the private banks and found a match.\n\nHe went to [[Robert Weston|Robert]] and [[Ellen Weston]], whose deceased son, Kip, was the match. He asked them to give Kerri the blood so spare another family the grief of losing a child. However, they wanted to keep the blood for their other son, Matt, in case he needed it.\n\nDespite this, Cooper used the blood to treat Kerri. The treatment worked and Kerri's condition rapidly improved.\n\nWhen the Westons came to the hospital to talk to Charlotte about the situation, they cross paths with Greg, who, upon figuring out who they were, hugged them, thanked them, and offered them the chance to meet Kerri, which they took.\n\n==Relationships==\n===Romantic===\nHe is married to [[Jessica Gilbert]].\n\n===Familial===\nHis daughter, Kerri, has leukemia. He donated bone marrow to her, but it didn't work.\n\n{{DEFAULTSORT:Gilbert, Greg}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]"}]}}}}