{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49875": {"pageid": 49875, "ns": 0, "title": "Greg (Nothing to Talk About)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP203Greg.png\n|name = Greg\n|status = Alive\n|marital = Heather ''(wife)''\n|children = Expecting\n|only appearance = [[Nothing to Talk About]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Joe Nieves]]\n}}\n\n'''Greg''' is the husband of a patient Addison operated on twice in one day.\n\n==History==\nGreg's wife was pregnant and had an ovarian torsion. She operated to untwist the ovary and both mom and baby were fine. She walked by Greg as she left the OR, but was unable to stop to talk to him.\n\nGreg's wife later started bleeding out and the baby was in distress. After the surgery, Addison talked to Greg who worried that the second surgery happened because she rushed off after the first one. Greg asked Addison what his wife's name was because he didn't think Addison knew it. Addison admitted that she didn't. Greg said that it was Heather and this was her third pregnancy. She kept redecorating the nursery every time she got pregnant in the hopes it would bring her good luck.\n\n==Relationships==\n===Romantic===\nHe is married to a woman named Heather.\n\n===Familial===\nHis wife was pregnant for the third time, after losing two previous pregnancies. She had decorated the nursery red in the hopes it would bring her good luck.\n\n{{DISPLAYTITLE:Greg}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]"}]}}}}