{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"84918": {"pageid": 84918, "ns": 0, "title": "Jan Taylor", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = 18x15JanTaylor.png\n|name = Jan Taylor\n|status = Alive\n|marital = Mason Taylor † ''(husband)''\n|only appearance = [[Put It to the Test]]\n|seasons = '''[[Grey's Anatomy|GA]]:''' [[Season 18 (Grey's Anatomy)|18]]\n|portrayed by = [[Dahlia Salem]]\n}}\n\n'''Jan Taylor''' is the wife of Mason Taylor, whose body she donated to research.\n\n==History==\nJan's husband, Mason, was hit by a drunk driver and declared brain dead at the hospital. She wanted to donate his organs, but UNOS rejected them as he had a history of cancer. She then decided to donate his body to research. [[Nick Marsh]] use him as the recipient for a genetically modified pig kidney. After the transplant had happened, Jan came to the hospital, saying she'd just gotten off a plane, and asked to see Mason. Nick consoled her and said she could see him and say goodbye later, but if she did it right away, donating his body would be for nothing. Later, Jan was able to see Mason. She told him it was okay and she'd be okay.\n\n==Relationships==\n===Romantic===\nShe was married to Mason Taylor until his death.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\n18x15-20.jpg\n</gallery>\n\n{{DEFAULTSORT:Taylor, Jan}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S18 Characters]]"}]}}}}