{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51177": {"pageid": 51177, "ns": 0, "title": "Janet (Blind Love)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x13Janet.png\n|name = Janet\n|status = Alive\n|children = Eric †\n|grandchildren = Natasha Hagan\n|only appearance = [[Blind Love]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Annette O'Toole]]\n}}\n\n'''Janet''' is the mother of [[Lizzie Hagan|Lizzie Hagan's]] late boyfriend, Eric.\n\n==History==\nJanet's son, Eric, died in an IED explosion that almost completely blinded his pregnant girlfriend, Lizzie. Lizzie later gave birth to a baby she named Natasha. When Lizzie nearly smothered Natasha while breastfeeding, Amelia called in Janet. Janet came up from San Diego to take Natasha home with her. Janet agreed to wait until they operated to try to restore Lizzie's vision, but said if they weren't able to, she'd be taking Natasha back with her.\n\nLizzie had the surgery and as her bandages were removed, she talked about seeing things around the room. Janet left, upset. She said that things were supposed to go so differently. Eric was supposed to be alive and she was supposed to gain a daughter and she was supposed to be there for her grandchildren.\n\nShe returned to Lizzie's room to say goodbye to Natasha before leaving to go home, but was told that Lizzie had lied and was totally blind after her surgery. Janet said she'd stay to help out, just as long as Lizzie needed to get adjusted to taking care of her. They agreed to try that.\n\n==Relationships==\n===Familial===\nHer son, Eric, died in Afghanistan several months before his daughter, Natasha was born.\n\n{{DISPLAYTITLE:Janet}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]"}]}}}}