{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50029": {"pageid": 50029, "ns": 0, "title": "Jane Williams", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP214Jane.png\n|name = Jane Williams\n|status = Alive\n|diagnosis = *Pregnancy\n*Stroke\n|doctors = *[[Addison Forbes Montgomery]]\n*[[Archer Montgomery]]\n|treatment = *Endovascular clot evacuation\n*Terbutaline\n*Blood thinners\n*C-section\n*Spinal block\n|marital = [[Tim Williams]] ''(ex-husband)''\n|children = Child\n|only appearance = [[Second Chances]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Amy Cale Peterson]]\n}}\n\n'''Jane Williams''' is a pregnant woman who had a stroke.\n\n==History==\nWhen Jane was 33 weeks pregnant, she had a stroke. Archer evaluated her and said that if he could stop the stroke within three hours of it starting, she had a good chance of not having any neurological deficits. Her ex-husband asked about the baby. Archer and Addison disagreed about treatment options. Archer did an endovascular clot evacuation. During the procedure, Jane started having contractions, which Addison was able to stop. After the procedure, Jane was stable, though still paralyzed on one side.\n\nJane went into labor while in recovery. Addison took her up for a c-section. Because stopping the blood thinners would put her at risk for another stroke, Addison decided to do the c-section with a spinal block while Archer monitored her neuro function.\n\nAfter the baby was delivered, he didn't breathe right away. He had aspirated meconium, but once Addison suctioned it out of his airway, he started breathing.\n\nAfter the surgery, Addison brought the baby to see Jane. Tim came in with them. She said she was glad that he was there. Tim handed Jane the baby and they sat together in her bed with their son.\n\n==Relationships==\n===Romantic===\nShe was married to [[Tim Williams]]. They had a long, painful divorce. Their divorce was complicated by the fact that Jane was pregnant. Jane even wished during a fight that she wasn't pregnant, because she resented that it kept Tim in her life.\n\n===Familial===\nHer son was born via emergency c-section after she had a stroke.\n\n==Notes and Trivia==\n*She was 30 years old at the time of her stroke.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP2x14-3.jpg\nPP2x14-4.jpg\n</gallery>\n\n{{DEFAULTSORT:Williams, Jane}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Neuro)]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (MFM)]]"}]}}}}