{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50833": {"pageid": 50833, "ns": 0, "title": "Jane Finch", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x02-18.jpg\n|name = Jane Finch\n|status = Alive\n|diagnosis = Amputated penis\n|doctors = *[[Charlotte King]]\n*[[Sheldon Wallace]]\n|treatment = *Surgery\n*Talk therapy\n|parents = *Mother\n*Father\n|only appearance = [[Short Cuts]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Darryl Stephens]]\n}}\n'''Jane Finch''' is a woman who needed psych approval in order to have sex reassignment surgery.\n\n==History==\nJane was at the practice to have a psych consult before having sex reassignment surgery as part of her transition. The consult went well, but Sheldon noticed scars from a past suicide attempt and they talked about that. After the consult, Sheldon had reservations and asked to continue seeing Jane before authorizing her surgery, feeling that she was rehearsed and was hiding something.\n\nJane came back in and asked Charlotte what she needed to do. Charlotte advised her to stop pretending she wasn't lonely. Jane said that the one time she stopped pretending was when she attempted suicide. She said that the loneliness was the result of not being able to be herself. Charlotte told Jane to tell Sheldon that.\n\nIn her next session with Sheldon, they talked about what Jane expected to feel after her surgery. She also talked about her father kicking her out when he caught her trying on her mother's bra and a man beating her up after finding out she was transgender. Sheldon said he wanted to hear about all of it and he wouldn't okay her surgery yet.\n\nJane went to Charlotte and said she'd keep doing her work, but Charlotte became concerned about Jane because of some things she said.\n\nCharlotte later got a call from Jane and went to her with Sheldon. When they got to her, they discovered that she was bleeding seriously. She'd cut her own penis off. They got her to the hospital where they were able to save her life.\n\nWhen she woke up after surgery, she apologized to Charlotte and Sheldon offered that she could still feel better. He agreed to keep seeing her.\n\n==Relationships==\n===Familial===\nHer father kicked her out when he caught her trying on her mother's bras.\n\n==Notes and Trivia==\n*She told her parents she was a girl when she was nine.\n*She attempted suicide at the age of 19.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP4x02-6.jpg\nPP4x02-7.jpg\nPP4x02-11.jpg\nPP4x02-18.jpg\nPP4x02-21.jpg\nPP4x02-25.jpg\nPP4x02-26.jpg\n</gallery>\n\n{{DEFAULTSORT:Finch, Jane}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Urology)]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Trauma)]]"}]}}}}