{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"85310": {"pageid": 85310, "ns": 0, "title": "Jane (The Road You Didn't Take)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S195x17Jane.png\n|name = Jane\n|status = Alive\n|marital = *[[Randall]] ''(husband)''\n*[[Bryan (The Road You Didn't Take)|Bryan]] ''(ex-husband)''\n|children = [[Matt (The Road You Didn't Take)|Matt]]\n|only appearance = [[The Road You Didn't Take]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Romy Rosemont]]\n}}\n\n'''Jane''' is the mother of [[Matt (The Road You Didn't Take)|Matt]].\n\n==History==\nJane came from Florida to Seattle with her husband, Randall, with the intent of kidnapping her son and bringing him back to Florida with them. The son, Matt, had come out to his parents as transgender a few years prior, which led to their divorce because his father supported him while his mother did not. Their argument drew the attention of a neighbor, who called the police. Crisis One responded and Jane told them that Bryan, her ex-husband, had kidnapped their child from her home in Florida and she'd tracked Matt's phone to find them. A police officer, [[Officer Marinis]], got involved and they determined that Bryan had recently been granted full custody of Matt, meaning he wouldn't have to go back with his mother. Matt then went to go inside to talk to his father, but Jane grabbed him and forced him into Randall's truck. As Randall prepared to drive away, Clarke, Vic, Theo, and Officer Marinis forced him to stop and got Matt out of his truck and back to his father. Randall and Jane were then arrested. Jane begged Matt to tell them it was a misunderstanding, but Matt just said he was sad for her that she wouldn't get to know the man he was becoming.\n\n==Relationships==\n===Romantic===\nShe was married to [[Bryan (The Road You Didn't Take)|Bryan]], but they divorced after she wouldn't accept that their son is trans. She later married [[Randall]].\n\n===Familial===\nShe has one son, Matt, but refuses to accept him and continuously deadnames him.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS195x17-1.jpg\nS195x17-6.jpg\nS195x17-27.jpg\n</gallery>\n\n{{DISPLAYTITLE:Jane}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}