{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"86065": {"pageid": 86065, "ns": 0, "title": "Jane Collins", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = 19x01JaneCollins.png\n|name = Jane Collins\n|status = Alive\n|children = Liam Collins †\n|only appearance = [[Everything Has Changed]]\n|seasons = '''[[Grey's Anatomy|GA]]:''' [[Season 19 (Grey's Anatomy)|19]]\n|portrayed by = [[Kerry O'Malley]]\n}}\n\n'''Jane Collins''' is the mother of Liam Collins, who was killed in a tour bus crash.\n\n==History==\nJane came to the hospital when her son, Liam, was in a tour bus that was swept off a cliff by a tornado. After some tests were performed, Liam was taken to have his organs harvested for transplant. However, due to an error, Jane was not informed and almost missed the chance to say goodbye to him. When his error was discovered, she insisted that Amelia re-run all the confirmatory tests and brought in their family doctor, [[Dr. Shagrin]], to consult on the case. When the tests confirmed the same diagnosis and Dr. Shagrin agreed, Simone told Jane that her son was brain dead. Wanting to make sure Jane agreed to proceed with the donation of Liam's organs, [[Benson Kwan|Blue Kwan]] told her how his brother died and his organs being donated helped Blue cope with that. She consented to the organ recovery.\n\n==Relationships==\n===Familial===\nHer son, Liam, died when the tour bus he was in was swept off a cliff by a tornado, causing a brain injury that led to brain death.\n\n{{DEFAULTSORT:Collins, Jane}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S19 Characters]]"}]}}}}