{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50172": {"pageid": 50172, "ns": 0, "title": "Janine", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP221Janine.png\n|name = Janine\n|status = Alive\n|diagnosis = *Pregnancy\n*Diffuse myocardial dysfunction\n*Cardiomyopathy\n|doctors = *[[Addison Forbes Montgomery]]\n*[[Noah Barnes]]\n|treatment = *Surgery\n*Heart transplant\n|marital = [[Phillip (What You Do for Love)|Phillip]] † ''(husband)''\n|children = Expecting\n|other family = [[Malcolm]] ''(brother-in-law)''\n|only appearance = [[What You Do for Love]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Elise Neal]]\n}}\n'''Janine''' is a pregnant woman who needed a heart transplant and got one from her husband.\n\n==History==\nJanine was 20 weeks pregnant and short of breath. She wondered if she had gestational diabetes because her husband, [[Phillip (What You Do for Love)|Phillip]], was diabetic. Her brother-in-law, [[Malcolm]], who is a nurse, came to her appointment because Phillip had to work. Addison said that her blood sugar was fine. Addison listened to her lungs and had Dell call an ambulance because she heard fluid in Janine's lungs. She had diffuse myocardial dysfunction. The added pressure of the pregnancy caused the condition to worsen quickly. She needed a heart transplant. Because the pregnancy was putting extra stress on her, Addison recommended termination. Her husband said she should, but Janine said she couldn't do it.\n\nJanine was put at the top of the donor list, but her husband and brother-in-law were told she had only 48 hours to find a heart.\n\nPhillip later came into the ER with no brain activity. He'd had an insulin overdose that caused brain death. His license revealed that he was an organ donor. They talked to Janine, asking her to take Phillip's heart to save her life. Malcolm encouraged her to take it. They took her in for the surgery, but were stopped by [[Charlotte King]]. She believed it was either suicide or homicide and insisted that evidence be collected before the transplant could take place. They waited and Phillip started to become unstable, so they had to rush once they were cleared to retrieve the heart.\n\nAfter the transplant, Janine's condition improved, though she worried because she suspected that Malcolm might have killed his brother to get Janine a heart. She knew he was in love with her. Addison confronted Malcolm about it, but he denied it, saying he loved his brother. The ME ruled Phillip's death an accidental overdose. Addison later watched as Malcolm kissed Janine's hand in her hospital room.\n\n==Relationships==\n===Romantic===\nShe was married to [[Phillip (What You Do for Love)|Phillip]] until his death. When he was declared brain dead, she received his heart for transplant.\n\n===Familial===\nHer brother-in-law, [[Malcolm]], came to all her appointments with her during her pregnancy because her husband worked a lot and wasn't able to come. She admitted to Addison that she knew he was in love with her and worried that he'd killed Phillip to get Janine a heart transplant.\n\n==Notes and Trivia==\n*Her blood type is O.\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Cardio)]]\n[[Category:Patients (Transplant)]]\n[[Category:Patients (MFM)]]"}]}}}}