{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52378": {"pageid": 52378, "ns": 0, "title": "Jasmine Spencer", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP5x19MrsSpencer.png\n|name = Jasmine Spencer\n|status = Alive\n|marital = [[Gary Spencer]] ''(husband)''\n|children = *[[Missy Spencer]]\n*[[Drea Spencer]] †\n|only appearance = [[And Then There Was One]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Private Practice)|5]]\n|portrayed by = [[Annie Fitzgerald]]\n}}\n\n'''Jasmine Spencer''' is the mother of [[Drea Spencer]].\n\n==History==\nJasmine's daughter, Drea, came into the ER with several stab wounds, including one to her chest. Her sister, Missy, came into the ER with her and said that she had told Drea she needed half an hour to finish her homework and then they'd make cupcakes, but when she came to get her, she wasn't in her room. Jasmine and Gary arrived just before they prepared to do a thoracotomy on Drea in the ER. When Violet went to lead the family out of the room while they cracked her chest, she noticed that Missy was looking at what they were doing intently.\n\nDrea's parents were upset about her injuries and Violet saw that Missy didn't seem upset, so she asked Gary if he wanted her to speak to Missy to see how she was feeling about the situation. He hinted that others had noticed odd behavior from her and said he wasn't concerned with how Missy was feeling at the moment because Drea was fighting for her life.\n\nAfter her surgery, Drea was pronounced brain dead. While their parents decided what to do about life support, Violet offered to talk to Missy again. Violet shared with Missy her experience being stabbed and said she wondered what Katie felt while she was stabbing her. Missy said she probably felt powerful and in control.\n\nAfter that conversation, Violet went to her parents and said she was showing signs of juvenile sociopathy and she believed Missy was involved in the stabbing. Jasmine said it was crazy, but Gary believed her.\n\nViolet talked to Missy again and said she had thought Missy was smart to figure out what Katie did what she did to fell powerful, but Violet disagreed. She thought Katie did it because she was jealous. Missy said she might have stabbed her to know if she could really do it. Violet pretended to be dubious, but Missy said it was only scary for a second and then you were in it. Missy then confessed that she'd stabbed her sister and it wasn't scary for her. It was the coolest thing she'd ever done. The police came in and arrested Missy.\n\nAmelia found Gary sitting by Drea's bedside. He said Jasmine had to leave. His family was destroyed because one of his daughters had killed the other. He felt that Drea's life should have counted for more and asked Amelia about organ donation. Amelia said he could do that and it would matter to a lot of people.\n\n==Relationships==\n===Romantic===\nShe is married to [[Gary Spencer]].\n\n===Familial===\nOne of her daughters stabbed the other and caused her death.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP5x19-3.jpg\n</gallery>\n\n{{DEFAULTSORT:Spencer, Jasmine}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]"}]}}}}