{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51253": {"pageid": 51253, "ns": 0, "title": "Jason Windsor", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x22JasonWindsor.png\n|name = Jason Windsor\n|status = Alive\n|marital = [[Angela Windsor]] ''(wife)''\n|children = [[Marisa Windsor]]\n|only appearance = [[...To Change the Things I Can]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Joshua Malina]]\n}}\n'''Jason Windsor''' is the father of [[Marisa Windsor]].\n\n==History==\nJason's daughter, Marisa, was at the practice for a routine exam when she started seizing. She had juvenile Krabbe's disease, which had caused significant neurological deterioration. She'd been on sedatives, but her parents had them reduced because they were making her a zombie. She'd lost most of her hearing and part of her eyesight. She had six months to a year left to live. Her parents had been seeing Sheldon to try to adjust to that idea.\n\nPete suggested a stem cell transfusion, but Cooper rejected the idea, worried it might do more damage. They went to the Windsors about it, saying it could give her two or three more years. Her mother, Angela, wanted to do it, but Jason worried about the possibility of it making her worse.\n\nThey did the transfusion, but Marisa had a severe allergic reaction and was deprived of oxygen for a significant amount of time, leaving her only minimally functional. Her parents were devastated and blamed the doctors for pushing them into the treatment.\n\nJason talked to Cooper about Marisa's condition and asked him to help end her suffering. Cooper refused.\n\n==Relationships==\n===Romantic===\nHe is married to [[Angela Windsor]].\n\n{{DEFAULTSORT:Windsor, Jason}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Psych)]]"}]}}}}