{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49862": {"pageid": 49862, "ns": 0, "title": "Jason Madison", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP2x01JasonMadison.png\n|name = Jason Madison\n|status = Alive\n|diagnosis = Acute lymphoblastic leukemia\n|doctors = [[Naomi Bennett]]\n|treatment = Cord blood transplant\n|siblings = Sister\n|parents = *[[Molly Madison]]\n*[[Eric Madison]]\n|only appearance = [[A Family Thing]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n}}\n\n'''Jason Madison''' is a child with cancer whose parents had a second child to save his life.\n\n==History==\nJason was diagnosed with acute lymphoblastic leukemia. He'd undergone treatment, but his parents decided to pay $80,000 to use selective IVF to get pregnant with a baby that could give Jason the cord blood transfusion he needed to save his life. In the meantime, they found a partial match to give him a bone marrow transplant. They prepared for the bone marrow transplant, which included killing off Jason's immune system, but the donor developed pneumonia and was unable to donate.\n\nDespite being only 27 weeks pregnant, Jason's mother begged Addison to deliver the baby immediately so they could use her cord blood to save Jason. Addison refused, saying that their daughter was important and she wasn't willing to risk the baby's life to save Jason's.\n\nMolly came into the hospital with her water broken. They tried to say it just happened, but Addison refused to help them until they told the truth. Molly admitted that she'd broken her own water with a knitting needle. Addison took her into the OR for a c-section. She delivered the baby and the cord blood was harvested for Jason. While he had his transfusion, Addison did liquid ventilation to keep his sister alive. Despite it being only experimental, it was successful and her condition improved. Jason's transfusion was also successful. Molly later thanked Addison and said she did what she had to do to save her family.\n\n==Relationships==\n===Familial===\nJason's parents were very concerned with his survival, to the point where they paid $80,000 to conceive another child to save his life.\n\n==Notes and Trivia==\n*He was seven at the time of his cord blood transfusion.\n*He likes bugs and has been known to sneak ladybugs into the house in his pocket.\n*He likes meatballs and french fries.\n*He's afraid of the dark.\n*He likes to read.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP2x01-11.jpg\nPP2x01-23.jpg\nPP2x01-26.jpg\n</gallery>\n\n{{DEFAULTSORT:Madison, Jason}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Peds)]]\n[[Category:Patients (Oncology)]]\n[[Category:Patients (Transplant)]]"}]}}}}