{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Pruitt Arike Miller", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = Sx-.jpg\n|name = Pruitt Arike Miller\n|alias = *TBD\n*Pru\n*Pruey\n|status = Alive\n|parents = *[[Dean Miller]] \u\n*[[JJ Lau]]\n*[[Miranda Bailey]]\n*[[Ben Warren]]\n|siblings = *[[Joey Phillips]]\n*[[William George Bailey Jones]]\n|grandparents = *[[Ifeya Miller]]\n*[[Bill Miller (Character)|Bill Miller]]\n*[[Petra Lau]]\n*[[Henry Lau]]\n|other family = [[Yemi Miller]] ''(aunt)''\n|first appearance = *'''[[Station |S]]:''' [[Ice Ice Baby]]\n*'''[[Grey's Anatomy|GA]]:''' [[Bottle Up and Explode!]]\n|count = \n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]] and [[Season  (Grey's Anatomy)|]]\n*'''[[Station |S]]:''' [[Season  (Station )|]], [[Season  (Station )|]], and [[Season  (Station )|]]\n|portrayed by = [[Janai Kaylani]]\n}}\n'''Pruitt Arike Miller''' is the daughter of [[Dean Miller]] and [[JJ Lau]]. After Dean's death, she was adopted by [[Ben Warren]] and [[Miranda Bailey]].\n\n\n\nAround eight months after one final hookup before committing to a time of celibacy, JJ came to Dean and told him she was pregnant. ''(\"[[House Where Nobody Lives]]\")''\n\nJJ spent the final weeks of the pregnancy at Dean's houseboat. ''(\"[[Into the Woods]]\")''\n\nDuring a serious blizzard, JJ was at the station with Dean when she went into labor. Maya called Carina, who advised over the phone how to handle the labor, since they were unable to get to the hospital for the delivery. JJ was upset with this, saying she wanted an epidural to handle the pain. Maya told her that Carina had suggested masturbating in order to progress the labor and help with the pain and JJ did so happily. Not long after that, labor progressed and she gave birth. ''(\"[[Ice Ice Baby]]\")''\n\nWhen she was less than a week old, she still didn't have a name. Dean and JJ learned they had different ideas of how to parent. After a few days, JJ packed her things and left the baby with Dean, saying she'd never intended to stay and just wanted to give Dean the chance to keep her if he wanted. She told Dean to give her a good name and a good life before leaving. ''(\"[[Satellite of Love]]\")''\n\nWith JJ gone, Dean struggled to take care of the baby. When Pruitt came over to help, he tried to reassure Dean that he would be okay, but quickly discovered that Dean wasn't sure he was going to keep her. After they spent the day talking, with Pruitt helping with the baby, Dean decided to keep her and named her Pruitt Arike Miller, after Pruitt. Soon after, Vic also moved in and agreed to take shifts with Dean to care for Pru. ''(\"[[Born to Run]]\")''\n\nDuring the Covid- pandemic, her aunt Yemi started living with her and took care of her. ''(\"[[Wild World]]\")''\n\n\nAfter her father died, Andy, who had been staying with them, brought her to the hospital to go with Ben and Bailey, since Ben had agreed to take her if anything happened to Dean. ''(\"[[Bottle Up and Explode!]]\")''\n\n\nOn Thanksgiving, Ben brought Pru to the station for the station's meal. When he had to go out on a call, he left her with Maya, who struggled as she hadn't spent much time with children. While Maya was watching her, Pru said she needed to potty, so Maya picked her up to take her, but Pru pooped in her diaper before they got anywhere. Carina then came in and took Pru from Maya and changed her diaper and her socks. Pru then spent some time coloring in the barn while the tables were being set up. When her grandfather arrived to take her, Bailey talked him into staying for dinner. He did so, but as soon as dinner was over, he took Pru with him, calling her Arike, which he said was her true name. ''(\"[[Little Girl Blue]]\")''\n\n\nPru remained with her dad's parents while Ben and Bailey explored their legal avenues. Dean's parents remained insistent that she would be living with them. However, one night, when Pru woke up crying for Bailey, they called her and had her help get Pru to sleep. ''(\"[[A House Is Not a Home]]\")''\n\n\nAbout a week before Christmas, Ifeya allowed Bailey to take Pru to the station for a visit. ''(\"[[All I Want for Christmas is You]]\")''\n\nAnna, Pru's nanny, later dropped her off for a visit with Ben and Bailey on the same day they were meeting with Ifeya and Bill to discuss their custody arrangement. She said they'd been held up at a medical appointment and asked her to drop Pru off. When the Millers arrived, they told Ben and Bailey they'd decided to let her live with them, with caveats. They eventually worked things out. ''(\"[[Cold Blue Steel and Sweet Fire]]\")''\n\n\nAfter Bailey took a few vacation days, she returned to work with Pru, but then had to put Pru in daycare when she discovered several surgeries had had to be cancelled or postponed. ''(\"[[I'll Cover You]]\")''\n\n\nBen and Bailey threw a party for Pru at the station. At the party, Ben gave a speech about how being a dad, especially to Pru, had helped him learn to stop taking so many risks at work. ''(\"[[Crawl Out Through the Fallout]]\")''\n\n\nIn the wake of the surgical residency program being shut down, Pru helped Bailey erase surgeries off the surgical board. Then Bailey quit and she and Pru went home to bake cookies. ''(\"[[You Are the Blood]]\")''\n\n\nBailey took Pru to the park to have a play date with [[Luna Ashton|Luna]]. ''(\"[[Wasn't Expecting That]]\")''\n\n\nJoey brought Pru to the station for the Halloween open house. She was originally supposed to come as a firefighter, but changed her mind and came as Megan Rapinoe instead. At the party, she saw and hugged Jack. ''(\"[[Demons]]\")'' From there, she went to the hospital to trick or treat there, despite already being tired. Bailey changed her into an Ewok costume and took her around. Afterward, she fell asleep in her stroller as Bailey packed up to go home. ''(\"[[Haunted]]\")''\n\n\n\nWhen she was less than a week old, her mother left her with her father, saying she couldn't be a good mom. She told Dean to have their daughter look her up when she was a teenager if she wanted. ''(\"[[Satellite of Love]]\")''\n\n\n*During her pregnancy, her mother craved strawberry ice cream.<ref>[[House Where Nobody Lives]], x (S)</ref>\n*She was named after [[Pruitt Herrera]].<ref>[[Born to Run]], x (S)</ref>\n*Arike comes from the Yoruba origin and it means \"The cherished one\".<ref>[[Something About What Happens When We Talk]], x (S)</ref>\n*She can't eat orange foods after dark or she vomits all night.<ref>[[Wild World]], x (S)</ref>\n*Her grandmother sometimes watches her while her father works.<ref>[[Can't Feel My Face]], x (S)</ref>\n*She went to Sunny Friends Daycare.<ref>[[Things We Lost in the Fire (Station )|Things We Lost in the Fire]], x (S)</ref>\n*When she's with the Millers, [[Anna (Season )|Anna]] is her part-time nanny.<ref>[[The Little Things You Do Together]], x (S)</ref>\n\n\n\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nSxBabyMiller.png|[[Ice Ice Baby]]\nSxPruittArikeMiller.png|[[Satellite of Love]]\nSxPruittArikeMiller.png|[[Born to Run]]\nSxPruittArikeMiller.png|[[Poor Wandering One]]\nSxPruittArikeMiller.png|[[Something About What Happens When We Talk]]\nSxPruittArikeMiller.png|[[No Days Off]]\nSxPruittArikeMiller.png|[[I Guess I'm Floating]]\nSxPruittArikeMiller.png|[[Can't Feel My Face]]\nSxPruittArikeMiller.png|[[Things We Lost in the Fire (Station )|Things We Lost in the Fire]]\nxPruittArikeMiller.png|[[Bottle Up and Explode!]]\nSxPruittArikeMiller.png|[[Little Girl Blue]]\nSxPruittArikeMiller.png|[[A House Is Not a Home]]\nxPruittArikeMiller.png|[[You Are the Blood]]\nxPruittArikeMiller.png|[[Wasn't Expecting That]]\n</gallery>\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\n</gallery>\n\n\n{{Pruitt Arike Miller Appearances}}\n{{Scrollbox}}\n\n[[de:Pruitt Arike Miller]]\n\n{{DEFAULTSORT:Miller, Pruitt Arike}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Miranda Bailey", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|name = Miranda Bailey\n|image = x-.jpg\n|status = Alive\n|alias = *Bailey\n*The Nazi\n*Mandy\n*Dr. Mommy\n*Amanda\n*BCB (Booty Call Bailey)\n*Dr. B\n*Chief\n*Chief Bailey\n*The Chief\n*Mama Bear\n*Little Bitty Doctor Bailey\n*Bingy\n|title = M.D., [[Fellow of the American College of Surgeons|F.A.C.S.]], G.S.\n|marital = *[[Tucker Jones]] ''(ex-husband)''\n*[[Ben Warren]] ''(husband)''\n|children = *[[William George Bailey Jones]]\n*Miscarried daughter ''(with [[Ben Warren|Ben]])''\n*[[Joey Phillips]]\n*[[Pruitt Arike Miller]]\n|siblings = Danielle Bailey \u\n|parents = *[[William Bailey]]\n*[[Elena Bailey]]  \u\n|other family = *[[Claire]]\n*[[Rosalind Warren]] ''(sister-in-law)''\n*[[Mr. Warren]] \u ''(father-in-law)''\n*[[Mrs. Warren]] \u ''(mother-in-law)''\n*Sister-in-law\n*Cousins\n*Two nieces\n|job = '''Current'''<br>\n[[Attending]] [[General Surgery|General Surgeon]]<br>\n'''Former''' \n*Chief of Surgery\n*Board Member\n|workplace = '''Current'''<br>\n[[Grey Sloan Memorial Hospital]]<br>\n'''Former'''<br>\n[[Seattle Grace Hospital]]<br>\n[[Seattle Grace Mercy West Hospital]]\n|first appearance = *'''[[Grey's Anatomy|GA]]:''' [[A Hard Day's Night]]\n*'''[[Private Practice|PP]]:''' [[Ex-Life]]\n*'''[[Station |S]]:''' [[Stuck]]\n|last appearance = '''[[Private Practice|PP]]:''' [[Right Here, Right Now]]\n|count = \n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], and [[Season  (Grey's Anatomy)|]]\n*'''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]] and [[Season  (Private Practice)|]]\n*'''[[Station |S]]:''' [[Season  (Station )|]], [[Season  (Station )|]], [[Season  (Station )|]], [[Season  (Station )|]], and [[Season  (Station )|]]\n*'''[[Grey's Anatomy: B-Team]]'''\n|portrayed by = *[[Chandra Wilson]] ''(adult)''\n*[[Alana Gay]] ''(young)''\n*[[Brooklyn Laws]] ''(preteen)''\n*[[Taylor Mosby]] ''(collegiate)''\n}}\n{{Quote|I am going to walk in there and tell the truth. I deserve it and if any one of them has the misguided impression that there is any choice at all in this matter, I will set that person on the righteous path before he or she can reveal him or herself as a moron.|'''Miranda Bailey'''}}\n\n'''Miranda Bailey''' is a [[General Surgery|general surgeon]] and the former [[Chief of Surgery]] at [[Grey Sloan Memorial Hospital]]. She is married to [[Ben Warren]] and has one son, [[William George Bailey Jones|Tuck]], with her ex-husband, [[Tucker Jones]]. During her internship at [[Seattle Grace Hospital]], she was very quiet and had no confidence, until she was mentored by [[Richard Webber]]. While in her residency, she was known as ''The Nazi'' to her interns, due to her tough and no-nonsense personality. However, she later dropped the nickname after operating on a real Nazi.\n\n\n\nAlthough Bailey has rarely spoken about her childhood, she has said that growing up she liked ''Star Wars'', took dance classes, played the oboe\uain the school band, and believed in Santa until the age of eleven.\n\nShe did not attend homecoming because the boy she liked never asked her out.\n\nHer mother (Elena) was very protective of her because she had lost another daughter before Miranda Bailey.\n\n\nAt the beginning of her internship, she met [[Debbie]], a nurse at Seattle Grace, who taught her how to be respectful to patients, as well as superiors and her fellow interns. She also told Bailey to not \"piss off the nurses\", and warned her of the consequences if she did so.\n\nWhile working on a patient about to have open-heart surgery, she became increasingly cranky and ordered Debbie to get her coffee. Debbie got her coffee, but she got her revenge and had Bailey do scut for an entire month.<ref>[[Overheard at the Emerald City Bar]]</ref>\n\nHer first solo surgery was an appendectomy during her intern year on Alicia Tatum, but it turned out Alicia's appendix was perfectly healthy. Alicia was a mystery; every test they did on her came out negative. She was sent home but came back, and Miranda diagnosed her with porphyria. She scolded Dr. Baylow for being careless, and Richard sent\uaher to his office. He made it look like he was angry with her, but he actually told her she was going to make \"a hell of a surgeon\".\n\n\nHer reputation as \"The Nazi\" preceded her as her interns were seen nervously discussing her after learning about their assignments on their first day of work.<ref>[[A Hard Day's Night]], x</ref>\n\n\nBailey kept her pregnancy news private from others, as she didn't want to get her personal life caught up in her professional life. She later admitted the pregnancy to Chief Webber, after he asked her about whether or not she was accepting a fellowship at Seattle Grace.\n\n\nThe position of Chief Resident was initially given to Dr. Torres. The Chief justified his decision by saying he didn't want Bailey to get caught up in the paperwork, and that she was too good a surgeon for that. Bailey was not entirely happy with his decision. After seeing Callie struggling due to the situation with George, Bailey elected to be her number two. She called the shots for the day, helping the residents with their patients and the doctors with their problems. Chief Webber realized that she was the one doing the amazing work, and as such gave her the position of Chief Resident.\n\n\nAt first, Bailey disliked Peds, because she couldn't see kids suffer, as it reminded her of her son, but after working with Arizona on a case, Arizona said she was perfect for the job. It took some time for Bailey to notice, but Peds was in her interest. When Bailey considered a pediatric surgery fellowship, her then-husband Tucker gave her an ultimatum: him or the job. She decided to leave him but also didn't accept the fellowship because she was becoming a single mom.\n\n\nDuring the point in time when Izzie Stevens, her former intern, and resident, was diagnosed with stage  melanoma that had spread to her liver, skin, and brain, Dr. Bailey was with her all the way, as her doctor and her friend. When all of her friends, and her new fianc\ue, Alex Karev, were too afraid to go visit her, Dr. Bailey was supportive, and a very motherly figure to Izzie. At one point, before her very risky surgery, Izzie gave Bailey a green knitted scarf which she had made during her cancer treatment. She gave it to Bailey because Bailey had supported her throughout her cancer treatment.\n\nMeredith discovered that their John Doe patient was actually George O'Malley. He was later pronounced brain dead in surgery. Everyone was devastated, especially Bailey, who said that she needed to stop caring so much because it was interfering with her life.\n\n\nBen and Bailey started going out after Miranda's divorce. Miranda had some inhibitions, as she had only ever had sex with her ex-husband, she had a child, she was divorced, but Ben didn't care. Ben was as headstrong as Bailey and they balanced each other out, but she was busy putting herself back together with \"tape and glue\" after the shooting, so they broke up, following the revelation that Ben was out golfing the day the shooting happened so he wouldn't have memories of that day.\n\n\nBailey had a fling with a headstrong male nurse by the name of [[Eli Lloyd|Eli]]. Ben told her that he thought she wanted him to wait for her after she broke up with him and that she was unclear. She ended things with Eli and resumed her relationship with Ben.<ref>[[Love, Loss and Legacy]], x</ref>\n\n\nAfter agreeing to move in together, Ben invited Bailey to lunch, but she got paged on a once in a lifetime case. They fought while she was operating and she found out he wanted her to do the crossword puzzle. She dropped everything to show him how childish it was and said the crossword was too easy. She got to a -letter answer with the clue: My question to you. He revealed that he made it and it took months to do. He was asking her to marry him. Later, she came to him in nothing but a trench coat and thong and proposed to him, but they didn't immediately get engaged because Ben told her he was offered a surgical internship at UCLA.\n\n\nWhen she heard that there was a plane crash, she brought Zola to Meredith. When they were on the plane, which was transporting her, Richard, and the sedated plane crash victims to Seattle, she said that she wished they sedated her too.<ref>[[Remember the Time]], x</ref>\n\n\nBailey was very nervous about this wedding, as she'd been married and divorced before. Her wedding got delayed because of Adele Webber, who had undergone emergency surgery, which was performed by Bailey. Ben didn't mind waiting for her. Much later than expected, Miranda and Ben got married.\n\n\nThree of Bailey's patients returned with post-operative infections. It was initially believed to be the fault of [[Leah Murphy]], who was ill but assisted on Bailey's surgeries.\n\nHowever, following the arrival of the third patient, whose surgery Dr. Murphy had not assisted on, it was apparent that the problem was more serious and the CDC was alerted.\n\nFollowing the investigation, it was deduced that Dr. Bailey was contaminated with MRSA, an aggressive infection which resulted in the deaths of all three patients.\n\nThe infections were transmitted due to the replacement of surgical gloves instituted via Pegasus policy, which possessed microtears.\n\nFollowing the investigation, Dr. Bailey became reclusive and refused to operate, testing herself repeatedly for MRSA. It was only when Meredith was critical post-natally did she step in and save her.\n\n\nFollowing her experience with MRSA, Bailey was more cautious in surgery. This came to a head when her husband, [[Ben Warren|Ben]] quit his surgical residency to return to [[Seattle]] to be with his family.\n\nAfter Bailey was informed of this, she began to show signs of obsessive-compulsive disorder (OCD) which caught her husband's attention.\n\nWhile casually speaking to Derek he mentioned that her condition could be affecting patient care. Derek, being a member of the board, was required to investigate and report these claims, which he did with the help of Owen.\n\nThey came to the conclusion that she was unfit to continue performing surgery and required psychiatric help. [[Dr. Alma]], an occupational therapist, was assigned to shadow her and clear her when she deemed Dr. Bailey ready.\n\nAfter the first two days, Dr. Alma tested Bailey's control over her condition and recommended that she take the medication she had been prescribed.\n\nAfter a conversation with [[Richard Webber]], Bailey finally agreed. The medication was effective and she was cleared to return to surgery.\n\n\nWhen Owen decided to step down as Chief of Surgery, Richard told Bailey she'd become his successor. Catherine refused to just appoint Bailey right away and demanded that she be tested against an outside candidate of Catherine's choosing. Upon hearing that, Bailey stated she felt sorry for the other candidate because she'd wipe the floor with them.<ref>[[Family Affair]], x</ref>\n\nHer confidence took a hit when the candidate turned out to be\ua[[Tracy McConnell]], who immediately proved to be very capable and popular with the other doctors. Ben convinced her not to back down. Bailey gave her speech in her OR and told the board members that she deserved the job because she'd do anything to make the hospital the best it could be, while it'd only be a temporary project for Tracy, who jumps from challenge to challenge. The board members voted and Bailey was appointed Chief of Surgery.<ref>[[Sledgehammer]], x</ref>\n\n\nBailey initiated the Code Orange when she heard that Alison was raped by Keith, and they had not been having consensual sex. When there was an explosion, and Meredith, Arizona, and Eliza were blocked from entering the hospital, Bailey cleared them, saying that fire trumped rapist on the loose. She later helped with the evacuation and was surprised to see Nathan, who was in the OR, just exiting the hospital when they evacuated the OR ages ago. After Eliza forgot to alert the police about Stephanie going missing, Bailey fired Eliza, saying that the hospital doesn't produce surgical robots. They produce human beings who know when not to follow the rules too strictly, which she came to realize Eliza couldn't do.<ref>[[Ring of Fire]], x</ref>\n\n\nWhen Ben told her that he was going to be a firefighter, Bailey began to ignore him and their relationship was strained.\n\nOn the day of her son's school presentation, Bailey went to Seattle Presbyterian Hospital and told the [[Julia Udell|nurse]] that she was having a heart attack. She was admitted and [[Intern Stuart|Stuart]], an intern, said that she wasn't showing any signs of a heart attack and that the test results looked fine as well. Later, [[Larry Maxwell|Dr. Larry Maxwell]] arrived and asked if she was having any stress, but Bailey told him that it wasn't because she was a woman who can't handle her feelings. She requested for a cardiac stress test and a second opinion, but Maxwell ignored her and asked her some other questions instead.\n\nAfter Bailey called Maggie to come over to Seattle Pres, [[Rich Gregory|Dr. Gregory]], a psychiatrist, believed that her condition was psychological rather than\uaphysical, but Bailey refused to play into that theory. Maggie and Richard arrived and found Bailey doing CPR on a [[Morgan|coding patient]]. As soon as she was done, she collapsed and they had to take her to surgery. Bailey was doing well for a while, but her pressure dropped and Maggie inserted an intra-aortic balloon pump. Maggie\uaasked Maxwell if he did a cardiac stress test and began to argue with him over Bailey's care because if he did the stress test, he would have seen the condition before it became emergent. Maggie then planned to perform a keyhole procedure. Before Bailey was put under, she asked for Ben and said that she needed her husband.\n\nAfter surgery, Bailey woke up. Ben arrived at the hospital and explained to Bailey that he quit his job at the fire station. Bailey told Ben to call his boss back and said that working as a firefighter was terrifying, but life was terrifying and was too precious to waste doing anything less than what makes him happy.\n\nWith Richard and Ben at her side, Bailey called her mother\uaElena and told her she had a heart attack and that it was scary, but she was okay. Elena knew she was because she was her Mandy.<ref>[[(Don't Fear) the Reaper]], x</ref>\n\n\nOn the morning of Jo and Alex's wedding, Bailey received a big check from the TrailBlazer. She and Ben were among the guests to follow a faulty GPS link, landing them at the wrong location and wrong wedding. When the bride's mother collapsed, Bailey and Ben took her to the hospital. Bailey got some scrubs and had Vik page whomever from cardio was on call. Everyone on call was all busy, but as a gift from God, [[Teddy Altman]] appeared with her luggage. She just arrived from Germany. Bailey had her scrub in so they could repair her abdominal aortic aneurysm. In surgery, Bailey talked about how her being at the wrong wedding saved this woman's life, only mere months after she nearly died herself. She changed her lifestyle to a more healthy one, but she did resume her life as if nothing had happened. Upon learning Teddy wasn't there for the wedding, Teddy revealed she had come there looking for a job, but Bailey didn't respond.\n\nAfter the successful surgery, Teddy apologized for putting her on the spot, but Bailey said it was just one more sign that it was time for a sabbatical from the Chief job. She wanted to have time to innovate and fall in love with the OR again and spend more time with her loved ones. She had tried to ignore the voice of the patriarchy in her head telling her she couldn't rest because she was a woman, but she decided to listen to her own voice and take the sabbatical after all. She then offered Teddy the position of interim Chief. Teddy was interested, but their talk was cut short when Ben came to say it was time for a wedding. They organized a wedding in the chapel for the couple whose wedding was cut short by the collapse of the bride's mother and set up a video chat so the mother could watch the ceremony from the ICU.<ref>[[All of Me]], x</ref>\n[[File:x-.jpg|thumb|Bailey had adjusted her lifestyle to a healthy one.]]\nThe next day, Bailey found Teddy waiting for her in her office. Teddy had decided she wouldn't be staying in Seattle after all and therefore wouldn't accept the job. Word got out and throughout the day, several attendings put their name in the mix for the job.<ref>[[With a Wonder and a Wild Desire]], x</ref>\n\nAs she showed him her innovative hyperbaric medicine lab, new Head of Ortho [[Atticus Lincoln]] helped her realize that she didn't want someone too good to replace her so that she would be missed and welcomed back with open arms. Bailey then spent the day in the hyperbaric chamber to get away from people pitching themselves for the job. Meredith found her and brought up Jo's plan to create a surgical innovation fellowship for her. Since she spent quite a lot of money on the hyperbaric chamber, the hospital couldn't afford both to hire Alex back and fund the fellowship. Bailey later witnessed Jackson put the hyperbaric chamber to good use to debride [[Nisha|Nisha's]] wound in there for a better outcome. However, Nisha passed away due to an infection.\n\nRichard later visited Bailey in her office and she explained to him that she wasn't giving him the job because she didn't want to add to his plate with his struggles after Ollie's death. After he left, Jo and Alex came back and Jo pitched why she was the future of medicine. Bailey was impressed and saw a solution to all her problems. She hired Alex back and appointed him interim Chief and decided to fund Jo's fellowship with her own money from the TrailBlazer. That also meant she would be running the fellowship instead of Meredith, which was the perfect opportunity to find both joy and tranquility.<ref>[[Broken Together]], x</ref>\n[[File:x-.jpg|thumb|Bailey ignores her fellow to fix Alex's messes on his first day.]]\nNo longer being Chief took some adjusting, like losing her personal parking spot. She checked in with Alex and both tried to hide their nerves, but Alex assured her he had this and told her to go de-stress. She assured him that she trusted him with the job. Alex had messed up the OR schedule, so Bailey fixed that and invited Jo to scrub in with her so they could discuss her fellowship. However, Bailey kept hearing that the nurses had been understaffed during first shift, so she ran out to fix that. She ignored the research Jo sent her and went to the Chief's office to verify some of Alex's work. She found he had spent the entire quarter's budget on his first day. Bailey stayed and helped him to rectify his mistake, but she was starting to think that having him replace her was a mistake.<ref>[[Gut Feeling]], x</ref>\n\nWhile Bailey and Maggie took care of [[Natalie Forrester]] and her family, who had been brought to the hospital by Andy, Ben, and Dean. She found out that Ben had a burn, which he tried to hide from her. She was not amused. She later cleared Andy and Dean to take off, which was required per a new policy and chastized them for letting Ben damage his surgical hands. Bailey later watched [[Evan Forrester]] say goodbye to his wife while his son Max was still in the dark. Despite Evan's misguided attempts to spare Max from the pain, Max had found out that his mother was dying and he ran off into the city.<ref>[[Momma Knows Best]], x</ref>\n\nPlagued by worries over Ben, Bailey couldn't sleep, so she got to work early and started working on Jo's idea for cancer killer cells. She wrote whiteboards full of possible approaches, which they had to narrow down to fit them all in one year. Alex came to fetch her and Jo for a surgical consult on [[Nina Sullivan]], who had a yet-undiagnosed cause of abdominal pain and came to the hospital for Meredith, who was out for the day. Bailey and Jo convinced her they were as good as Meredith and after a thorough work-up and a process of elimination, they figured out the diagnosis and resolved the problem surgically. Later, Jo found Bailey in their lab. Bailey told her that she had applied the process of elimination to her own life, too, to remove stressors from her life, but she was still stressed. She then suggested Ben's new job was the source of her stress.<ref>[[Everyday Angel]], x</ref>\n\nSoon after, she found a paper detailing Ben's death benefit at home. At work, she flourished as a mentor to Jo. They revived a liver from a deceased donor using normothermic perfusion. Alex ordered them to shut it down since it wasn't UNOS-approved and a failure could risk their standing with the organization, but they performed the procedure behind his back because case reports from Europe had Bailey convinced it would work. They did not face any consequences because the procedure was successful. Throughout the day, she had sent Ben worried texts since she - again - had not heard from him all day, but all of them were left unanswered. Privately, she measured her blood pressure, which was way too high. She then texted Ben that they needed to talk on his next day off.<ref>[[Flowers Grow Out of My Grave]], x</ref>\n[[File:Sx-.jpg|thumb|Bailey tells Ben she wants a marriage sabbatical in hopes that it would lower her stress levels.]]\nShe took a day off so they could spend his day off together. While she wanted to talk, he was happy that they could spend the day together and they had sex. Afterward, they had breakfast on the couch and she talked about how seeing Jo and Alex balance their work-life with his being Chief reminded her of her and Ben. He knew it had been hard on her since his job change and said it was time for them to re-connect. He was wondering what they could do to do that, but she couldn't ignore what she had to say any longer. She told him that stepping down as Chief hadn't helped to lower her stress and blood pressure. She told him that worrying about him and if he would come home at night was not helping. She needed a break from that, too. She explained that she needed time to get well and work on herself. She promised she wasn't trying to see other people or keep him from Tuck, but she hoped that she would stop worrying about whether he would come home or not if she knew that he wasn't coming home. While he thought that that was just the first step to a divorce, she desperately told him that she needed to try because she couldn't breathe every time she thought about him getting hurt. She was afraid that being married to him was killing her. He packed a suitcase and she assured him that it wasn't final. He left after kissing her goodbye.<ref>[[Do a Little Harm...]], x (S)</ref>\n\nDespite their sabbatical, Ben returned to the house to board up the windows in preparation for the windstorm. With Alex unable to make it to the hospital, Bailey briefly resumed her role as Chief. She benched Richard upon hearing that he had been arrested after demolishing a bar. She made a speech in the ER to announce that they were a brick house that the storm couldn't blow down and that they would stay open for traumas. The crowd applauded and she was glad to see she still got it. Richard later vented his concerns to her that Catherine was having an affair with Tom Koracick. Bailey scoffed at the idea and then informed him of her own marriage sabbatical. He said the worrying wouldn't stop because she asked Ben to stay away. He told her that fixing the inside from the outside wouldn't work and that she needed to get real help. Afterward, Bailey joined Taryn on an elevator to take [[Phoebe Moss]] up to the OR to procure her organs for [[Cece Colvin]]. However, a power outage trapped the elevator between floors.<ref>[[Blowin' in the Wind]], x</ref>\n\nBailey and Taryn had to keep each other calm and stop themselves from catastrophizing while ventilating Phoebe manually. She started pulling her fingers again. Eventually, they were rescued by [[Jed Lundberg]] and Jackson. They had to climb out and took Phoebe to the OR. During the procedure, Alex came to inform them that Jed's legs had been crushed when the elevator started working again mid-climb. Bailey ordered Alex to take over for her so she could go help him out and lead the hospital. Alex later found her in his office and told her she could have her job back if she was going to treat him the way she did. She told Alex that she was in crisis and didn't trust herself to finish the procurement. She then received a reassuring text from Ben to tell her he was safe and she broke down crying. She then begged Alex not to quit as she needed more time to straighten things out. He agreed to help her with whatever she needed.<ref>[[Shelter from the Storm]], x</ref>\n\nRichard telling her she needed to seek help led her to go back to her therapist. Faithfully doing her exercises, she made progress and began noticing again when she was pulling her fingers. At work, Teddy asked her for a job again, but Bailey directed her to Alex. Bailey and Maggie later watched Catherine's last surgery before her own spinal surgery from the gallery. Maggie practiced talking about her feelings with her and said that Catherine, Jackson, and Richard were delaying the inevitable by not talking about the tumor. Bailey told her the storm would come when it did, which was part of her exercise to stop trying to control things she couldn't control. The storm came after surgery. Bailey wanted to enter a lounge, but Maggie stopped her from going in because Catherine, Richard, and Jackson were fighting in there.<ref>[[Help, I'm Alive]], x</ref> Everyone came to terms with it and they made up for the surgery. Bailey sat down with Richard in the gallery and stayed with him during Catherine's surgery. When the surgeons had to flip Catherine on the table, Richard couldn't bear to look at the risky move, so Bailey informed when it was over.<ref>[[The Winner Takes It All]], x</ref>\n\nBailey and Ben remained separated through the holidays. Ben dropped off presents for Tuck on Christmas Eve. She had also written Ben's name on the presents she had got Tuck herself, but she promised to also give him Ben's gifts. He told her he was on call on Christmas, so they might see each other in the pit. On NYE, Bailey contemplated calling Ben but decided against it as it might seem like a booty call. A few weeks later, they ran into each other in the ER and she followed him outside. She told him her heart was ready for him to come back. She felt lonely without him when Tuck was at his father's and the fence needed some repair work. He told her she had broken his heart, so he wouldn't come home for the fence. She then told him that she was focusing so much on her physical health since the heart attack that she had neglected her mental health. Her meds needed to be adjusted, which is why she had been off. She told him she was being treated, but he didn't respond and left for an emergency. A few days later, on Valentine's Day, she came home and found Ben working in the front yard. He told her that she had told him to follow his bliss, but then she turned on him and left him over it. If he were to come back, he needed to know that that would never happen again. He said he should have realized something was wrong with her and brought up that he never followed through on building her the treehouse, which she asked for as a place to de-stress. She then noticed he was building her that treehouse and promised she would never call time-out on them again. They went inside and celebrated Valentine's Day in the bedroom.<ref>[[Girlfriend in a Coma]], x</ref>\n\nWith her home life back on track, Bailey grew increasingly impatient to get her job back, but there were still two months to go. She noticed that Alex had started a weekly free breakfast for the interns to boost morale. Much to her dismay, she discovered that a display with pictures from all past and present Chiefs had been installed in the cafeteria, with Alex's picture last. The pictures continued to bother her. She told Richard that Alex was praised in an article for the hospital's innovation while that was actually all her doing. Richard told her that's how it goes sometimes and shared a story of how she performed emergency surgery on a long-time patient of his, who now sent her a basket of pears every year. However, as soon as he was gone, she switched her picture with Alex's. At the end of the day, she tried to get Alex to give her her job back, but he had become good at it and insisted on finishing out the contract. Begrudgingly, she told him she was proud of him for standing up for himself like she had taught him.<ref>[[I Walk the Line]], x</ref>\n\nWhile Meredith was breaking the hospital's longest surgery record, Bailey helped out in the ER with the mass overdose victims. When Betty was discovered amongst the teenagers, she was diagnosed with an aortic dissection. Teddy decided to operate and Bailey forbade Owen from tagging himself in. At the end of the day, Ben and Bailey left together. Bailey said the world is a scary place, no matter how well you raise your kids. Ben told her to focus on the beauty of the world with him for a moment.<ref>[[I Want a New Drug]],x</ref>\n\nOn the night of Catherine's party, Catherine enticed Bailey to drive there in the back of a limo with her. Bailey had been warned Catherine might try to ditch her party, but she couldn't resist the party. Bailey appreciated the luxury and Catherine pointed out she had the money to buy nice things for herself outside of taking care of business, like fixing the garage door and paying off her car and property taxes. Bailey was reluctant to indulge because she didn't know how the TrailBlazer would be a success, but Catherine told her that money comes and goes and you need to let yourself enjoy it before it's gone. She convinced Bailey to buy the expensive C TurboMix, pointing out the joy it would bring her. Catherine then had the limo pull over. She didn't want to go because people would congratulate her like it was all over, but she was not cancer-free. She didn't want to celebrate living in constant dread. Bailey told her she needed to learn to spend joy like she had learned to spend money. She shared that she no longer trusted her heart and might drop dead tomorrow. But they were alive and people loved them, which was cause enough to celebrate. As soon as they arrived, the guests gathered for a speech, but that was interrupted by Owen and Tom's fight and a supposed fire in the kitchen. Everyone was evacuated. Ben responded to the call and after the penthouse was cleared, he offered Bailey a ride home on the aid car.<ref>[[We Didn't Start the Fire]], x</ref>\n\nWith  days left on the contract, Alex had Bailey cover the ER since both Owen and Teddy were out on personal days. She told him she was looking forward to no longer having to take orders from him.<ref>[[Blood and Water]], x</ref>\n[[File:x-.jpg|thumb|Bailey disapproves of the research approved by Alex.]]\nWith her resuming the position coming closer, Bailey started to look into the DeLuca research on external gestational sacks that Alex had approved. She thought it was an ethical slippery slope and she hated that she would have to handle in a few weeks. She advised Alex to look into Vincenzo DeLuca's mental health issues. Later, she ran into [[Helen Karev]] in the cafeteria and during their chat, Helen revealed she had extended her stay because she was scared of flying back and didn't dare to ask Alex for help. Bailey later informed him of this. Alex thought she was on a crusade against people with mental illness, but she pointed out she was someone with mental illness herself, so she knew how hard it could be to ask for help. She needed help herself not too long ago, which is why she asked him to stay on as Chief. Later, Alex asked Bailey to take over as Chief for  days so he could fly back to Iowa with his mother.<ref>[[And Dream of Sheep]], x</ref> Still able to relax shortly before taking back over, Bailey spent the day playing Tetris in one of Maggie's mood rooms. She took a short break to quiz a math whiz on math problems.<ref>[[Add It Up]], x</ref>\n\nOn Bailey's last sabbatical day, she and Ben found out that Tuck was \"just talking\" to a girl named Kelly. As they dropped him off, they saw him put his arm around her. Ben and Bailey took a break after he dropped a patient off at the hospital and she said they needed to talk to Tuck about respect, consent, and condoms so that he could properly enjoy his butterflies and first love. Ben offered to take that off her plate as his father gave him the talk and it worked. Bailey later stood among the wall of women to support [[Abby Redding]].<ref>[[Silent All These Years]], x</ref>\n\n\n[[File:x-.jpg|thumb|Bailey guides STEM students around the hospital.]]\nOn her first day back, she paged Alex because she couldn't find the compliance reports for the medical board, which were due tomorrow. He had no clue what she was talking about and left. Levi then also dumped a few STEM students on here, who were to learn about leadership, something she had approved months ago. As she guided them around the hospital, they ran into all kinds of awkward situations and people yelling and making mistakes. She apologized to the students and proposed they reschedule for a less hectic day, but they told her they had learned a lot from the way she handled the situations. She then also discovered that Alex had been handing off paperwork to the interns. She later showed Richard the results of that. They both thought it was an amazing idea, but they agreed Alex could never know they did.<ref>[[The Whole Package]], x</ref>\n\nWhen Tucker found out that Tuck was also calling Ben \"Dad,\" he had some angry calls with Bailey. Meredith asked her for advice on how to tell her kids that she was dating Andrew, which Bailey already knew about from Richard. Bailey told her that kids already know on some level and advised her to just make sure they knew she still loved them and that she was not going anywhere. Bailey settled the \"Dad\" issue by telling Tuck to call Ben by his name again as it hurt his father's feelings. Later, she comforted [[Warren Sterman]], a long-time patient of hers, as he grieved the death of his grandson, caused by a mistake by [[Nico Kim]].<ref>[[Head Over High Heels]], x</ref>\n\nBailey identified [[Lucas Ripley]] when Levi arrived with him at the hospital. Later, she was approached by both Ben and Teddy with concerns about Jo's wellbeing. They went to look for her and found her sobbing in [[Lori Carter|Lori Carter's]] arms. While Ben comforted her outside, Alex told Bailey that Jo had come back from Pittsburgh a changed person and that he didn't know what to do with her.<ref>[[What I Did for Love]], x</ref>\n[[File:x-.jpg|thumb|Bailey and Catherine have a meeting about Meredith's insurance fraud.]]\nWhen the Olympia United Medical Group discovered the insurance fraud committed by Meredith, their representatives held an emergency meeting with Bailey and Catherine. They went over the case together all day and paged Andrew to ask for details on the case.<ref>[[Drawn to the Blood]], x</ref> Andrew took the fall for Meredith, after which he was arrested. Bailey then found Jo lurking outside the room. She asked her if she could work today because many attendings were out and her star resident was just arrested. Jo said she could. Bailey and Catherine then settled the [[Gabriella Rivera]] case by telling [[Luis Rivera]] that the Foundation would pay for everything. After the meeting, she informed Richard of what Andrew had done, after which he ran off instead of joining her to the ER. As Bailey and Jo waited for an ambulance together, Jo told her they needed to talk later. Bailey and Richard operated together and she shared her suspicions that Andrew was just covering for Meredith and that he hadn't pulled it off by himself as he was too smart not to realize he was risking every employee's insurance and the Rivera family's asylum.\n[[File:x-.jpg|thumb|Meredith informs Bailey and Catherine on what she did.]]\nAs soon as she got herself out of the hyperbaric chamber, Meredith went to Catherine and Bailey and told them the truth. Alex and Richard came in to back her. They failed to report it but they couldn't bring themselves to put Luis through any more misery after everything he had been through. Bailey then fired all three of them. At the end of the day, Bailey watched as Jo checked herself into the in-patient psychiatry ward. As they walked off, Alex asked her if he was still fired, to which she replied it hurt her more than it did him.<ref>[[Jump Into the Fog]], x</ref>\n\nWith her three top attendings fired and DeLuca in jail, Bailey had to get Owen for an incoming trauma despite his daughter just having been born. A week later, she witnessed as Catherine took Tom into a private meeting. Another week passed by and Bailey found out that Catherine had hired Tom as her Foundation's Chief Medical Officer, meaning he would oversee all of the Catherine Fox Medical Centers' Chiefs, including Bailey. Bailey thought Catherine would stand by her. Catherine pointed out that doing so had created a big rift between her and Richard. She found she had less energy than before the cancer, so all small problems would be taken to Tom now instead of to her. Bailey was angered. Andrew showed up with a cocky attitude, knowing she needed help, which didn't help to calm her down. She spent a full week being angry, which exhausted her. She ran into Teddy in a lounge, who confessed she hated maternity leave and vented her fear that she was a bad mother. Bailey told her she had hated maternity leave, too, and that she was an excellent mother.<ref>[[Nothing Left to Cling To]], x</ref>\n\nTom's promotion left her without joy at work so she indulged in doughnuts instead of her usual green smoothies. Ben gave her a pep talk to go find herself joy. She had noticed the residents had been sulking around since she fired the three attendings, so she reminded them that she shaped Alex and Meredith into the surgeons they are today and offered to shape them, too. She gathered the residents for the case of [[Wade Foltz]], who needed an axillary-bifemoral bypass, and organized a skills lab for the toughest part of the procedure, promising that whoever finished first with good results would get to do that part in the actual surgery. Andrew beat out Taryn by mere seconds but Bailey chose Taryn instead. She also offered Jo full control over her fellowship to prevent her from quitting and accepting the same offer from Alex at Pac-North. Bailey hushed Andrew when he objected in the OR and later made him step in when there was bleeding from the suture line. Afterward, Bailey spotted Meredith in the waiting room with [[Robin (Season )|Robin]] as they went to check on Wade. Later, Andrew confronted her about sidelining him, suspecting she did so because of his relationship with Meredith. She clarified she wanted to give Taryn a taste of the adrenaline and fear that makes you a surgeon and warned him that he was making this personal. She suggested he think about his career and let go of certain loyalties. At the end of the day, Jo came to tell her she had considered her offer but wanted to be appointed attending general surgeon instead, using Alex's counteroffer in her negotiation. Bailey approved and hired her. At home, she told Ben about having found joy that day and how Tom was shocked in the nads by Owen, which made her laugh.<ref>[[Back in the Saddle]], x</ref>\n\nWhen [[Shirley Gregory]] came in for her ALPPS procedure, Bailey showed confidence in Jo by letting her perform the procedure under her supervision despite Jo only ever having observed it. However, Shirley only wanted to be operated on by Meredith, so Bailey had to agree to let Meredith follow the procedure through video chat to get Shirley to consent. Bailey had to assist to repair a bleeding but Jo pulled it off successfully. Bailey hung up on Meredith as soon as Jo was done. Afterward, she found a disappointed Dahlia crying in a hallway and found out that Dahlia resented her for firing Meredith, who was the sole reason she, like many others, had worked so hard to get herself matched to Grey Sloan. Understanding Dahlia wasn't open to learning from anyone else, Bailey fired her so she at least had something in common with her hero.<ref>[[Reunited]], x</ref>\n\n\nWhen a patient refused to be treated at Grey Sloan and was taken to Pac-North, Bailey learned that Meredith had published an article that trashed Grey Sloan. Bailey considered this a public attack and discovered it had sent the residents into mayhem, including the Chief Resident quitting on her. She appointed Andrew as Chief Resident to clean up the mess his girlfriend had made as he had failed to warn them about it before it came out. Bailey felt very hot and Jo suggested that her heart was in distress because of the stress caused by the article. Worried she might be right, Bailey fetched Maggie for a cardiac work-up, which revealed her heart was fine. Maggie suggested it was hormonal and drew blood to run a full panel. Knowing her mother went through early menopause, Bailey got emotional and asked Ben to sit with her and allow her to feel her feelings. Later, Meredith came by her office and told her that she had not meant for the article to come out like this. She said she had just pitched some ideas and the website published it this way, while she had never directed any comments towards the hospital itself, but rather at the medical system as a whole. Bailey shut down Meredith's suggestion to write a retraction since they never get read. Meredith stressed she would never attack her beloved hospital that taught her everything. Bailey recalled the many hours she had sacrificed from her family to be a mentor and friend to Meredith and said Meredith could apologize all she wanted but that the damage had been done. She asked Meredith to leave. Maggie later came by with her blood results. Bailey was indeed perimenopausal but also pregnant, which came as a shock.<ref>[[It's Raining Men]], x</ref>\n\nBailey tried to tell Ben about the pregnancy when he came home from an exhausting shift but he fell asleep as soon as he lay down on the bed. At work, Bailey took the case of [[Carly Davis]], who had a carbon monoxide poisoning from a suspected suicide attempt. Jo recognized Carly from her residential treatment and joined her and Bailey in the hyperbaric chamber. Bailey learned Carly was in fact one of her therapists, which resulted in Jo panicking and having shaky hands, which was ironic as Carly was the one who taught her tricks to keep her nervous system calm. Jo applied the techniques, including reciting a list of things you know by heart, but it didn't work. She feared she would never completely get better if even the person who helped her out of her depression could still attempt suicide. As she started to spiral, Bailey blurted out she was pregnant, which helped to calm Jo down. As Carly slowly improved, Jo asked her about the pregnancy. Bailey informed her Ben didn't know yet. She further said the pregnancy wasn't planned and that it terrified her but could also make her happy. Since Bailey started to panic, Jo had her recite Tuck's bedtime routine as a baby, which surprisingly helped. After solving Carly's case, Bailey offered to take the case off Jo's hands but Jo wanted to see it through. Bailey told her she watched Jo teeter on the edge, bring herself and Bailey back from that, and saved Carly's life in the process, which all told her Jo would be okay. After learning that the carbon monoxide poisoning had been an accident, Jo established a boundary and handed the case back to Bailey. Later, Bailey informed Ben she was in an emergency. He rushed to the hospital and found her. She eased his panic and told him about the pregnancy. While shocked at first, he was delighted and picked her up to twirl her around. In his excitement, he told some nearby staff.<ref>[[Breathe Again]], x</ref>\n\nAround Halloween, Bailey's hormones started to get the better of her. She didn't want to cry at work, especially in front of Tom. She cried when Tuck sent her a picture of his costume. She also had cravings and started to think about how breastfeeding, which she had read was recommended now, would interfere with her career. She took her concerns to Amelia, who taught her some tricks to hold back tears. She worked on a case with Teddy and Tom. Teddy was worried that she was a bad mother because she hadn't provided amazing self-made costumes for her kids. Bailey assured her no one equated good costumes to good parenting and advised her to just focus on spending time with her kids. After the successful surgery, Bailey confronted Tom about his continuous complaining about Halloween. He apologized and shared with her the story of how Halloween was his and his son David's thing and how David died a few weeks before he could ever put on his Stormtrooper costume, which just hung on David's bedroom door for months as Tom couldn't bring himself to take it down. While Amelia's tricks had helped her throughout the day, she couldn't stop herself from sobbing. Tom awkwardly comforted her. Afterward, Bailey went to see the parade in the peds ward and learned that Teddy had dressed up her babies as zombies, which made Bailey suggest she buy costumes next year.<ref>[[Whistlin' Past the Graveyard]], x</ref>\n[[File:Sx-.jpg|thumb|Bailey and Ben bask in joy as they look forward to meeting their baby.]]\nThe firefighters at [[SFD Station |Station ]] threw a surprise celebration for Ben and Bailey's baby, where Bailey learned that [[Jackson Avery|Jackson]] was seeing [[Victoria Hughes|Vic]]. [[Travis Montgomery]] gave a speech to congratulate the pair though he ruined it by calling it a late-life pregnancy. While enjoying the food, they went around the table with each firefighter stating a wish for the baby. Afterward, Bailey and Ben lied down on top of the engine and talked about their baby possibly being a girl. She told Ben she felt safe there. She liked knowing there are heroes out there in the dangerous world and knowing them personally.<ref>[[I Know This Bar]], x (S)</ref>\n\nA few days later at Meredith's trial, Bailey was surprised to see that most of Meredith's former colleagues showed up to support her. While testifying, Bailey denied being close to Meredith and stated that Meredith lost the qualities that had made her promote Meredith to Head of General Surgery. She also confirmed a list of incidents involving Meredith to be true. She found out Richard had cheated the system to get Meredith a spot at Seattle Grace and she scoffed as Richard later took the blame again for Meredith's tampering with Derek's Alzheimer's trial during his testimony. During a break, she confronted him and he reiterated that it was his decision to make. She pointed out he had a habit of going around the system for Meredith no matter the consequences. Richard thought he was jealous but admitted he gave Meredith special treatment due to his history with Ellis, making him consider her family. Bailey said they could have come to her for help. Richard thought that would have led to Catherine firing her. She finally told him that their actions had cost her her hospital with Tom being in charge now, her best surgeons, and most importantly, her closest friend. She admitted she felt betrayed by someone she raised. He pointed out her testimony made him feel the same way as he thought she'd stand up for Meredith as he had.\n[[File:x-.jpg|thumb|Bailey finally testifies on Meredith's behalf.]]\nAfter the break, Bailey barged into the room and talked about how Meredith had been breaking the rules since day one, and even though she deserved to be fired over it, she did not deem it fair for her license to be taken away. She concluded Meredith was too good of a surgeon and had worked too hard to get to where she was. Her second testimony and Alex's bringing together a whole group of patients whom Meredith had operated on convinced the panel to let her keep her license. Bailey then told Meredith she could have her job back, which Meredith accepted. They hugged it out.<ref>[[My Shot]], x</ref>\n\nThe Monday after, a few hours before getting an ultrasound to find out the sex of the baby, Bailey found out [[Pruitt Herrera]] had been admitted to the hospital with symptoms suggesting his cancer was back. She ran some tests to confirm. Meanwhile, she convinced Amelia to get an ultrasound, something Amelia had been putting off because she was afraid of what it might reveal given [[Christopher Shepherd|her history]]. Pruitt's tests came back, revealing a highly aggressive testicular lymphoma. While she was talking about his poor survival odds, he told her she was bleeding. Carina was called and she did an ultrasound while Ben was making his way to the hospital. As he arrived, Pruitt and Carina expressed their condolences and gave the couple some privacy. Together, they cried over their loss. After the initial grief had worn off a bit, Bailey decided she needed to work and told Ben to go drink with buddies. On her way to her office, she ran into Amelia, who asked about the ultrasound. Hiding the truth, Bailey told her the baby was a girl like she had expected and headed to her office, where she broke down crying after all.<ref>[[Let's All Go to the Bar]], x</ref>\n[[File:Sx-.jpg|thumb|Bailey finds out Ben is trapped inside the bar.]]\nShe cried over the ultrasound pictures before heading home. While she was trying to get a hold of Ben, she came across Joe's bar, where the Station  crew was working to extract a car that had crashed into Joe's bar, trapping everyone inside. [[Dean Miller]] informed her that Ben was among the people inside though not hurt. She deduced some of her staff were trapped, too, and pressured Dean to get them out. He told her she was wasting his time by barking orders at him while she was not his Chief. He made her step back behind the tape. The crew got everyone out. Ben was unharmed and hugged his wife. He admitted he was blaming himself for the miscarriage as he figured it happened due to the stress that his job was causing her. She told him it was not his fault, pointing out that it happened when he wasn't on duty. She then decided to go back to work and had him update her on her injured residents.<ref>[[I Know This Bar]], x (S)</ref>\n\nTogether, they arrived in the ambulance bay as the trauma doctors took in the residents. Bailey granted Ben privileges to help out. Inside, she retreated in a supply closet to gather herself. She found Levi crying in there. She pulled him up and told him their friends needed them. They headed out to work. Owen and Richard came to help out, too. Ben checked if Bailey was okay but she just stated she had operated on her residents before. Richard told her Ben had called him, implying he knew about the miscarriage, but she only told him to help out wherever he could. Together, they operated on [[Taryn Helm]], who had an internal bleed. She froze as she had to open up Taryn's chest to get better visualization so Richard swiftly took over from her. They saved her together and lingered in the OR afterward. He informed her all the residents had made it through their surgeries. She was relieved and finally let the grief over her miscarriage sink in. She told Richard she had handled losing her best surgeons and friends but couldn't handle this loss of her daughter. She had a hard time accepting that, unlike she and her colleagues had done for injured residents, there was nothing she or anyone else could try to save her. As she said she could only stand there and let the loss happen, she broke down in Richard's arm. Later, Richard and Meredith came by her office with tissues and doughnuts to comfort her. Meredith said she felt lonely when she had her miscarriage so she knew Bailey needed some company.<ref>[[Help Me Through the Night]], x</ref>\n\nBailey took some personal time to grieve the loss.\nOn her first day back, Andrew updated her on all the injured resident. As he took her to [[Suzanne Britland]], they ran into Tom, who commented on her taking time off while the majority of the residents were out. Bailey told him she had other services cover their absence and joined Andrew in Suzanne's room. Suzanne had developed a mysterious condition after an appendectomy. Suzanne crashed in the CT machine due a cardiac tamponade but they managed to bring her back. She and Andrew assured Suzanne later that they would find out what was going on. Bailey had Andrew create the war room and reach out to other doctors to get their opinion. Later, she ran into Tom, who again commented on her taking a vacation. She then told him she was grieving her miscarriage. He sympathized with her, having been through two miscarriages with his ex-wife. He said it is not as easy to get over as people make it seem, which is why he had developed a habit of lighting a candle on what would have been the kids' birthdays. Bailey took his advice and lit a candle in the chapel.<ref>[[A Hard Pill to Swallow]], x</ref>\n\nA few days later, Bailey had to go tell [[Joey Phillips]], whom Ben had rescued the day before, that he would have to be separated from his siblings, who had been placed in the foster system. She overheard that Tom was doing interview with Pac-North staff to determine who would be hired at Grey Sloan. Bailey wanted to make recommendations but he turned her down, knowing she would recommend the people she had impulsively fired. Afterward, she checked in on the residents in the war room on Suzanne's case and told them to go shower. Finally, she went to see Joey and delivered the bad news. She tried to ease the pain by promising to call social services and find out as much as she could about his siblings' situations. She was told that they try to keep siblings together, though Joey wasn't reassured by that as his siblings weren't his actual siblings but rather kids who had run away from their foster home together. As she and Jo operated on Joey's arm to restore blood flow, Bailey brought up his history of bouncing around the foster system after his parents died in a car accident. Despite being a straight-A student who had taken care of his siblings on his own for months, Jo doubted that he would ever be adopted as  year olds are generally viewed as adults who can fend for themselves. After surgery, the two of them watched Joey sleep. Jo hated how he had nowhere to go, though she was hopeful that he would turn out okay like she and Alex had. Later, Bailey sat down with Meredith and they talked about her breaking up with Andrew and having grown up. Jackson came to inform them that Richard had refused to return to Grey Sloan under Koracick's terms. They gathered the top attendings, who all agreed to quit unless Tom agreed to their terms. Tom conceded.<ref>[[Save the Last Dance for Me]], x</ref>\n\nOn Richard's first day back, Bailey told him to train the new set of residents from Pac-North. She admitted that was her way of comforting him with his marriage ending soon. She also invited him to dinner but he just walked off. Later, Meredith came into Bailey's office as she was having hot flashes. She voiced her concerns over Andrew's behavior regarding Suzanne's case. Bailey called him into her office and told him Meredith would be taking over the case from him so he could finally sleep. Meredith's first decision was putting Suzanne back on her medication, which Andrew and [[Lauren Riley|Dr. Riley]] had stopped as they believed it was masking her symptoms. Andrew aggressively objected to the decision, but Bailey told him to walk away before saying something he would come to regret. Eventually, Andrew found the right diagnosis and Meredith set up the treatment. Later, [[Cormac Hayes]] informed Bailey that Joey was refusing to do his PT. Bailey arranged a visit from his siblings, who assured him their foster homes weren't bad. She ordered pizza for the kids. As she left the room, she was told by a resident that Richard had let them go home, despite it being not even  o'clock. She sat down with Richard, who told her that those residents weren't Grey Sloan caliber. Having them there felt like Catherine had won. She understood and wanted to help him. He told her he was bone tired, which she said sounded like depression. He said he would be okay and left.<ref>[[A Diagnosis]], x</ref>\n\nAs a snowstorm hit Seattle, Bailey continued to spend time with Joey in his hospital room to help him study for his GED. She was mad upon finding out Andrew had taken off on foot to retrieve a donor liver at [[Seattle Presbyterian Hospital|Seattle Pres]] and got upset with Link for discharging Joey in the middle of a blizzard. She knew Joey had declined to talk to a social worker about his options. She dropped by Joey's room and he told her that, having turned eighteen, he had decided he didn't want to risk ending up with crappy foster parents again. She pointed out he could also end up with a great family that could help him get his high school diploma and find a career that he loved. He didn't think that was in store for him. To prove him wrong, she took him on a tour of the hospital to point all different kinds of jobs. In the ER, they came across Owen and Teddy rushing to save a pregnant woman. Bailey and Joey comforted the woman's wife. Joey followed Bailey as she went to get an update and witnessed how the doctors had managed to save both the woman and her baby. As they watched one mother with her baby in the NICU, Joey admitted he was impressed. Bailey then blurted out that Joey should come home with her, having an extra room and extra love to give. She told him about her son and her husband. He agreed to her offer and they hugged. That night, Ben came home with dinner and was surprised to see Joey in his living room wearing his clothes. Bailey told him they should talk.<ref>[[Snowblind]], x</ref>\n\nHer unilateral decision angered Ben, who went to sleep on the couch. The next morning, Bailey found a letter from Alex in her mail. He wrote that he wouldn't be returning to Grey Sloan. He thanked her for being a great teacher who also let him grow up. As Alex brought up his difficult past and his turning into the guy that Bailey had trusted to run her hospital and keep her secrets. He also wrote that he had decided to stay in Baldwin City to complete the family Izzie had started by using their embryos to have twins. He asked Bailey if she would be willing to write a recommendation so he could apply for a job of Chief of Peds at Shawnee Memorial. He ended his letter by thanking her again, which he knew was small and lame compared to what she had done for him. Ben came home and found Bailey with the letter in her hand. She informed him that Alex had left everyone behind to be a father. She then said it was a matter of luck that Alex became the person that he is today. He survived his home and foster homes and turned into a father and fine surgeon, all by chance. She didn't want Joey's future to be a matter of chance. Ben then agreed to keep Joey, saying that he had just wanted for them to talk it over. Bailey apologized and they agreed neither of them would make big decisions again without consulting the other.<ref>[[Leave a Light On]], x</ref>\n\nAt work, Bailey found Richard objecting to having his furniture from Pac-North moved into his office. He left to go teach a skills lab, leaving Bailey to handle the dispute with the movers. She arranged for his old furniture to be moved into his office instead but he got mad at her for assuming what he wanted. He told her he would handle it and started throwing stuff on the ground as she left. In the ER, Andrew asked Bailey if he could treat patients now that he had agreed to start seeing a counselor. She denied his request, which surprised him, as he thought she would need the help with Richard handing off his entire service. That was news to Bailey, though she stuck with her decision regarding Andrew. She went to see Richard in his empty office. He apologized and said the slightest things set him off lately. He then formally told her he was stepping back from surgery. He wanted to start something new and said having his old furniture reminded him of his old self and cluttered his mind. Bailey argued that the hospital needed him but he simply said he wanted to step away while at the top of his game. She sat down with Meredith in the attendings' lounge, where Meredith was missing Alex cheering her up after a hard day. Bailey related to the feeling. She recalled Richard's speech to the interns and how she dreamed of being the last one standing. However, now that she was the last one standing, the feelings of victory had worn off and she just felt lonely sometimes. She then informed Meredith that Richard was stepping back from surgery.<ref>[[Life on Mars?]], x</ref>\n\nAndrew convinced Bailey that he was ready to return to work and she allowed him to treat patients again starting with shifts in the clinic. On Meredith's busy pro bono surgery day, Bailey was paged to the clinic by Andrew, who suspected his patient was a human trafficking victim. He made his case stating that Cindy's supposed aunt was answering his questions for her. While Bailey thought he sounded crazy, she went to assess the situation herself. She deemed Cindy and Opal were actually family and told Andrew he was off the case. She also sent him home and told him to meet her in her office the next morning. However, Andrew was persistent and took Cindy to surgery to keep her away from Opal, who ended up finding Cindy anyway. Andrew then went off the rails and physically blocked Opal from getting to Cindy. He drew a crowd as he yelled at Opal to get away. A [[Hospital Codes|code violet]] was called. As his colleagues, including Bailey, arrived, he asked them to form a human chain around Cindy to protect her. Instead, his colleagues formed a human chain around him, indicating they thought of him as the danger, while he yelled at them in an attempt to make them see things his way. Security took him to Bailey's office, where Andrew quit his job rather than accept a suspension. After a talk with Meredith, he agreed to take the suspension if Bailey agreed to call the human trafficking hotline. Bailey agreed and made the call. She was told not to scare the suspects away but found that Opal and Cindy had disappeared, making her fear that Andrew had been right.<ref>[[Give a Little Bit]], x</ref>\n\nBailey gathered with some other staff in a conference room at Grey Sloan to watch a livestream of Richard's presentation on his PATH pen at the Surgical Innovation Conference in Los Angeles. They all witnessed as he gave an unfocused talk about a cure for cancer with a messy presentation with simple hand-drawn pictures. Maggie and Cormac escorted him off the stage and called .<ref>[[Love of My Life]], x</ref>\n\nBailey, Meredith, and Amelia assembled a war room to find out what was going on with Richard. Bailey ordered several tests before gathering other doctors. Bailey presented a list with diagnoses that needed ruling out or had been ruled already. During a talk with Richard, they found out he thought Catherine had been at the Conference with him. They added hallucinations to his symptoms. Later in the day, Bailey found Andrew in Richard's room. She reminded him of his suspension but he claimed it was a social visit. She also had him forward her the list that Lauren had sent him. Catherine pushed the doctors to work her. Maggie and Meredith did some cognitive tests on him, which went horribly bad. Maggie was convinced he had some type of rapidly-progressive dementia, though they had yet to find a cause. They returned to Richard's room and found him gone. They spread out to find him. Meredith found him in the OR about to cut himself open. She guided him back to his room. He thought he was at Seattle Grace and wanted to start rounds with the interns. He mentioned Adele, which greatly worried his doctors.<ref>[[Sing It Again]], x</ref>\n\nThe doctors switched off keeping him company. While playing cards, Richard blanked and stopped playing. As he further declined, the doctors kept looking for the reason behind the decline. After a week, Catherine decided it had been enough and she wanted to take Richard home. However, as they were discharging him, Richard mentioned his feet and hands were numb, convincing the doctors to perform an EMG, which revealed that his whole body was breaking down, thus ruling out dementia. The search for a diagnosis continued. Meredith and Bailey went to do a nerve biopsy but Andrew came barging in, knocking over the instrument tray to force them to stop and listen to him. He suspected Richard was suffering from cobalt poisoning caused by his hip replacement. Meredith drew some blood, which confirmed Andrew's suspicion. Andrew asked to scrub in on the hip replacement. Bailey initially denied his request but Meredith pointed out he had made an incredible save, convincing Bailey to let Andrew scrub in to just watch. Bailey went to fetch Link, who was with Amelia giving birth, and convinced him to go perform the surgery. Amelia then asked Bailey to stay with her. Honoring their Pregnancy Club, Bailey stayed with her and helped her through the delivery, much like George had done for her. Later, Link arrived in the room and Bailey showed him his son. She left the new parents and went to check up on Richard in the ICU. He was stable but still unconscious. He later woke up with normal cognitive function.<ref>[[Put on a Happy Face]], x</ref>\n\n\nMiranda Bailey has two completely different sides, sometimes she is extremely loving and kind, others she is tough and keeps true to her nickname ''the Nazi''. She usually gives advice to others, being very direct.\n\nAlthough known for her strict personality, Bailey has an excellent bedside manner.\n\nAs a resident, Bailey was well-known amongst the attendings for being no-nonsense and unafraid to call them out for what she perceives to be ineptitude. She took time to warm up to new attendings and famously disliked [[Derek Shepherd]], [[Erica Hahn]], [[Mark Sloan]], and [[Arizona Robbins]] for various reasons after working with them for the first time.<ref>[[Wish You Were Here]], x</ref>\n\n\n\n[[Tucker Jones]]\nShe married Tucker Jones c.. They had been married for ten years and trying to conceive for seven when Miranda announced her pregnancy with their first child. Her son, [[William George Bailey Jones]], was born during a [[It's the End of the World|bomb scare]] at [[Seattle Grace Hospital|Seattle Grace]] while [[Tucker Jones|her husband]] was in surgery with [[Derek Shepherd|Dr. Derek Shepherd]], having crashed his car on the way to the hospital. [[George O'Malley]] helped her through labor, and she thanked him by naming her son William George Bailey Jones (although he is nicknamed \"Tuck\" after his father).\n\nDue to her working as a surgeon, Bailey rarely spent time at home, putting a strain on their marriage and following an incident where Tuck was hurt at home, their relationship was strained even more and although they stayed married, Tucker went on dates.\n\nOn discovering Miranda had applied for a pediatric surgery fellowship, Tucker gave her an ultimatum: the fellowship or their marriage. Miranda decided to leave her husband, believing a marriage should never come to an ultimatum, but also declined the fellowship.\n\n[[Sam Bennett]]\nWhile she was still married, he flirted with her.<ref>[[Before and After]], x</ref> When she came to L.A., he almost kissed her. She stopped him and returned home before anything could happen between them.<ref>[[Right Here, Right Now]], x (PP)</ref>\n\n[[Ben Warren]]\nAfter her divorce from Tucker was finalized, Bailey started seeing Ben, an anesthesiologist.<ref>[[Valentine's Day Massacre]], x</ref>\n\nBut after the shooting at Seattle Grace, she broke off her relationship with him, saying she had to put herself back together.<ref>[[With You I'm Born Again]], x</ref>\n\nWhen drunk, she confessed that she still missed Ben.<ref>[[Slow Night, So Long]], x</ref>\n\nDuring their time apart, Bailey dated another man, but after Ben found out, he decided to fight for her and things ended between Bailey and Eli.<ref>[[Love, Loss and Legacy]], x</ref>\n\nAfter things ended with Eli, she got back together with Ben.\n\nBen tried to propose to her through a crossword puzzle which didn't work out like he planned, and in the end Miranda herself asked him to marry her twice.<ref>[[Migration]], x</ref>\n\nOn the day they were supposed to get married, Bailey got caught up with [[Adele Webber]] when she and Richard found out that Adele was coughing up blood and had been rushed to the hospital. They turned the limo that was taking them to the wedding around and went to the hospital instead.<ref>[[Run, Baby, Run]], x</ref>\n\nBailey and Meredith operated on Adele, before returning to her wedding and tying the knot with Ben.<ref>[[Things We Said Today]], x</ref>\n\nAfter their marriage, Ben had gotten a surgical internship at UCLA and had to leave. Their marriage was strained while he was at UCLA, but Ben came to Seattle to vist Miranda every once in a while. Later, Ben quit his job because he felt he didn't see Miranda or Tuck, his stepson. Miranda was not very happy at first, but he did not want to give up surgery and got a job at Grey Sloan Memorial. \n\nBen operated on a man in the psych ward with a clipboard and operated on a pregnant women without proper consent in a hall and she died. He was put on probation for  months by Miranda. Instead of not doing any work, he acted as an attending anesthesiologist which angered Miranda because she felt that he wasn't taking his probation seriously, but she couldn't do anything about it, as she wasn't in control over the anesthesiologist department. \n\nHe later became a firefighter, which scared Miranda as he was the one running into the fire, not running away. Because of the stress of his job, one day when he was going to work, she told him to drop her off at Seattle Presbyterian hospital. She told him that it was a meeting and blew him off, so he just dropped her off and drove to his job. \n\nWhen he was told that she was having a heart attack, Ben dropped his hot dogs and ran to the hospital, freaking out. He was with her when she woke up, as was Maggie Pierce and Richard Webber. Ben told her that he would quit for her but Miranda told him not to, as his job did stress him out, but she knew that this was what he wanted to do. \n\n[[Eli Lloyd]]\nEli, a nurse, asked her out, and the two dated for a while, even to the extent of sleeping together in the on-call room, something which Miranda never actually thought she would do, given her stellar reputation.\n\nAfter Ben returned, she dumped Eli. Even before Ben returned, Miranda admitted she wasn't looking for a long-term relationship with Eli.\n\n\n[[Meredith Grey]]\nMiranda had a strained relationship with Meredith in the beginning because of Meredith's relationship with Derek, but they soon became friendly. They also worked on a medical trial to try to cure diabetes together, although Bailey refused to allow her to help at first because of what happened with Derek's Alzheimer's trial. Eventually, Bailey became close with Meredith, even demanding that Meredith be a bridesmaid in her wedding to [[Ben Warren|Ben]]. After the wedding, they remained close.\n\n[[Cristina Yang]]\nBailey said that Cristina was the one intern she didn't have to worry about.\n\n[[Izzie Stevens]]\nIzzie was not her favorite in the beginning. Then when Izzie cut Denny's L-VAD wire, Bailey really had a disliking for her. When Izzie got cancer, Bailey softened up. Bailey once accused her of being too \"attached\" to her patients. \n\nWhen Izzie went under for brain surgery for her cancer, she had been knitting a scarf earlier. Before Izzie went down, she told Bailey that the scarf was for her. \n\n[[George O'Malley]]\nBailey said [[Heart-Shaped Box|George was her favorite]] of her interns. She also named [[William George Bailey Jones|her son]] after him. He coached her through her labor and delivery, allowing her to work through the stress of her husband's car accident.\n\nWhen George told her he was joining the army, Bailey freaked out, and with the help of other doctors, they staged an \"intervention\" to stop him from going. Owen told them that it was his choice, but they started blaming Owen for him joining the army because he encouraged George a lot with trauma surgery and talked about his experiences in the army. \n\n[[Alex Karev]]\nShe thinks Alex was made to be a peds surgeon. After learning of Alex's past from his younger brother, Bailey says she is impressed Alex became a doctor, due to his troubled upbringing. She also remarks on how impressing her is not an easy feat.\n\n[[Richard Webber]]\nWebber has been her mentor since she was a resident, and has encouraged her to become the person she is today. Bailey looks up to Webber. \n\nOthers\nThrough the rest of that residency year, Bailey had to adjust to becoming a parent and reconciling this with her desire to continue her career as a surgeon. Her professional confidence was shaken when [[Izzie Stevens]] cut Denny Duquette's [[Ventricular assist device|LVAD]] wire and Denny subsequently died after his heart transplant; Bailey felt that she wasn't in control of her interns and that the incident was ultimately her fault. She was criticized for the events at a Morbidity and Mortality conference, with one colleague questioning outright her competence at juggling career and motherhood. While her confidence has been somewhat restored since then, she still feels bad about not spending enough time with her son, once making a late-night call to sing \"God Bless the Child\" to him. During her pregnancy, she was upset that her interns had driven away two residents and no one wanted them. When she returned to work, she was making sure that her colleagues knew that she hadn't gone soft because she had become a mother.\n\nFollowing severe injuries to her son and several arguments over the state of their marriage, Bailey and her husband separated because her husband believed that she placed her job at the hospital before her family and that it led to Tuck's injuries. Bailey's relationship with [[Erica Hahn]] is quite strained. Although Erica saved her son's life, she temporarily stopped the surgery until Bailey left and when Bailey asked Erica for help on a surgery, the whole day Erica was quite negative and kept putting Bailey down.\n\n\nMiranda Bailey, a graduate of [[Wellesley College]], is an [[attending]] [[General Surgery|general surgeon]]. She says she was the only female intern in her year, but she was the best and she won the first solo surgery. She was also previously in charge of the five interns Meredith, Cristina, Izzie, Alex, and George (although Alex was not originally hers). Her colleagues used to refer to her as \"The Nazi\" because of her tough personality and blunt attitude although she behaves almost in the exact opposite way with patients and has a great bedside manner.\n\nAlthough she was often harsh with her interns, she has been shown to provide both support and advice when they need it; practicing \"tough love.\" For instance, Bailey stayed by Cristina during her pregnancy scare and her initial recovery; she also held Izzie's hand when Izzie was giving bone marrow for her daughter. She cares about her patients and is a committed surgeon. When she first learned about Meredith Grey and Derek Shepherd she became brisk with her but it was to prove Meredith had no favor. She protected her while she was looked at by all the Seattle Grace when Derek choose Addison over her, she admitted he had put himself between two remarkable women.\n\nDisillusioned by how little she can help patients as a surgeon, Bailey decided to open a free clinic at Seattle Grace. She faced initial difficulties getting support from the attendings, but after talking with the Chief, managed to get their agreement to work there. The Denny Duquette Memorial Clinic has since opened, paid for using part of the $. million bequeathed to Izzie by [[Denny Duquette, Jr.|Denny Duquette]], and Bailey is satisfied that the clinic will change people's lives for the better. She competed for the post of Chief Resident, but she found out she lost to [[Callie Torres]]. [[Richard Webber|Dr. Richard Webber]] has indicated that she could eventually become Chief of Surgery.\n\nMiranda became a th-year resident and decided to be Callie's \"number two,\" as Torres was lacking in performance as Chief Resident. The Chief saw Bailey pick up the slack, and delegate exceptionally well, and eventually realized that Miranda was covering for Callie. He fired Torres from the position and told Bailey that he made a mistake in not giving her the job in the first place. He also apologized for taking Dr. Bailey for granted. At this Miranda broke down in tears hugged the Chief. This is an example of the emotional baggage the \"Nazi\" carries and shows one of her very rare emotional moments. Miranda helped save the life of a white supremacist paramedic despite his racist treatment of her. When closing his stomach after the surgery, she comments to George that the incision will need to be aligned better, thus ruining the paramedic's large swastika tattoo on his stomach. During the surgery, she declared that she didn't want to be called the Nazi anymore.\n\n[[Image:x-.JPG|thumb|left|px|Bailey pregnant.]]\n\nDr. Bailey was nearing the end of her surgical residency in [[General Surgery]], and Richard Webber had planned for her to become a general surgery attending. Although for a while she claimed she was growing tired of appys and gall bladders and nothing excited her but while treating a child that almost died, she wanted to stick with general surgery. Unfortunately, she had been assigned to another child. While treating the child, both Dixon and Robbins said she was a true pediatric surgeon because of her disregard of rules, her personal interest in patients and taking the time to explain surgeries to the patients and the children. Privately, she told Arizona how she felt when her son Tuck was admitted and said, because of how she felt, it would make her bad for pediatric surgery. But in contrast, Arizona told her that in her opinion it made her uniquely qualified. Eventually, she decided to pursue a pediatric surgery fellowship, despite the Chief's disagreement. Armed with letters of recommendation from [[Derek Shepherd|Shepherd]], [[Mark Sloan|Sloan]], [[George O'Malley|O'Malley]], and a disappointing letter from [[Richard Webber|the chief]], she is very excited about [[Addison Forbes Montgomery|Addison's]] letter of recommendation, labeling her the \"the most promising peds surgeon I've ever had the pleasure of working with\". Even though Arizona claims the Chief is the major factor in the decision, the implication of Addison's referral should make a much larger difference than any other doctor she could have, as Addison is a world-class neonatal surgeon, hopefully outranking most other letters of recommendation Bailey has.\n\nBailey eventually gains the pediatric surgery fellowship, and even the Chief signs on and agrees with it, but Bailey is unable to take the position and asks for a job as a General Surgery attending, after making the decision to leave her husband, as a fellowship for  years of long hours is not healthy for a single mother.\n\nAs a general surgery attending, Bailey spearheads an initiative to reduce post-operative fistula formations. After introducing a new protocol that involves the removal of a drain on day  versus day , the formation is reduced by %.\n\nWith Richard stepping down as Chief of Surgery, Miranda appeared livid, when Owen Hunt was ushered into the position, however, she eventually supports this decision. Bailey later admitted that she thought she would have eventually become Chief of Surgery after him.<ref>[[This is Why We Fight]], x</ref>\n\nAlong with stepping down from his position, Dr. Webber passed on his clinical trial on diabetes to her. Along the way, Richard kept insisting that Bailey have [[Meredith Grey]] help her, which she refused because she partly blamed Meredith for Richard's downfall. Eventually, Bailey hit a rough patch in her own research and begun shutting out Webber from their lab of mice. Though she employed [[April Kepner]] to assist her, it was not until Meredith began working on the case that the problem was finally discovered. Meredith discovered that parts of her mother's research were wrong and that the first few devices installed in their first patients would eventually become ineffective. After [[Teddy Altman|Teddy's]] husband [[Henry Burton]] dies, the trial was not mentioned again.\n\nBailey later pursued\uaa new project of genome mapping that will arm doctors the necessary information to treat diseases at the source rather than treating the symptoms as they arise. A while after, because of defective gloves, she unintentionally infected three of her patients with a staph infection and was investigated by the CDC. While her name was eventually cleared and her infection was eradicated and all three patients died, she overheard Richard telling a patient that the one doctor who caused the infection had been isolated. This affected Bailey greatly, causing her to lock herself in her genome lab, shutting out the other doctors, particularly the board and Richard, for a day while she obsessively mapped her own genome over and over again. She was drawn out only by her husband, Ben, but she still refused to perform surgeries, until she had to operate on Meredith.\n\nAfter Owen decided to step down as Chief of Surgery, Richard suggested Bailey as his successor to the board, but Catherine didn't want him to just give her the position. They agreed on her bringing in one outside candidate,\ua[[Tracy McConnell|Dr. Tracy McConnell]], but Bailey convinced the board to choose her by talking about how passionate she was about the hospital. As of now, Bailey is one of the few female Chiefs of Surgery.\n\n\n*Bailey was the only female intern in her year. She also won the first solo surgery.\n*Bailey states in [[Deny, Deny, Deny]] that her cystic fibrosis patient [[Jeremiah Tate]] has been her patient for at least five years. However, she was later established as being a th-year resident at the time.\n**At the time of the episode airing, Bailey's year of residency had not been established, though it had been originally implied she was a th-year, as she discussed fellowship decisions during her pregnancy in the same season and was in charge of the OR in the [[Season  (Grey's Anatomy)|first season]]. Late in the [[Season  (Grey's Anatomy)|third season]], Bailey was established to be a th-year surgical resident, and the first three seasons take place in one year, following the [[Timeline|timeline being retconned]]. \n***However, Bailey states in [[The Time Warp]] (which takes place early  when [[Meredith Grey|Meredith]] is a third-year resident and Bailey an attending after finishing residency in ) that she began her internship in . This would have made her a resident for five years during Meredith's intern year, somewhat corroborating the original comment in [[Deny, Deny, Deny]], but it would also mean she did residency for six years.\n*Bailey states to Derek she has been married for ten years in the Season  episode [[Bring the Pain]]. She and Richard both later recall in Season 's [[I Was Made for Lovin' You]] that Richard and his wife [[Adele Webber|Adele]] attended her first wedding. If not a timeline mistake, this means Webber had not met Bailey on her first day of internship but rather has known Bailey for at least  years at that point (likely when she was a college student). It is possibly an unexplained storyline, as Richard also recalls later in Season 's [[Run, Baby, Run]] that Bailey was a \"child\" when she married Tucker, but is now an \"adult\" marrying Ben. \n*Bailey's father [[William Bailey|William]] in [[Holidaze]] says her \"cousin said something to her husband in front of your niece, who said something to your younger niece, who said something to your mother\". It is later revealed Bailey's only sibling died as an infant, so she would not have any biological nieces. Bailey's father was likely referring to her then-brother or sister-in-law (Tuck's sibling)'s two daughters, as he is upset about their impending divorce.   \n*Bailey believed in Santa until the age of eleven.\n*She knows a lot about Sci-Fi, notably [[Star Wars]], and is a collector of Judy dolls, seeing as how she could identify each doll and their accompanying accessories.\n*She hates bad liars.<ref>[[Who's Zoomin' Who?]], x</ref>\n*Bailey was always nicknamed ''The Nazi'', but the nickname stopped when a [[Shane|racist patient]] with a tattoo of a swastika who came in for a surgery refused to let her operate on him alone.\n*Bailey often says ''Va-jay-jay'' instead of saying ''vagina''.\n*Bailey has changed her hairstyle more than any other character.\n*The reputation of Nazi precedes Bailey, and the \"Nazi\" is said to have \"''balls the size of Texas''\".\n*[[Sandra Oh]] originally auditioned for the part of Bailey, not Cristina.\n*Her original character description was \"Tiny, blonde, with curls.\"- in reference to the Nazi's preference of Aryans, who had blonde hair and blue eyes.\n*She has arachnophobia, the fear of arachnids such as spiders and scorpions.\n*Her new nickname is \"BCB\", which means Booty-call Bailey because of her frequent \"contacts\" with [[Ben Warren]] whenever he came to [[Seattle Grace Mercy West Hospital]] from LA.\n*Bailey officiated [[Callie Torres]] and [[Arizona Robbins]]' marriage.<ref>[[White Wedding]], x</ref>\n*She refers to the hospital shooting as the worst day of her life.\n*[[Derek Shepherd]] and [[Meredith Grey]] named their son [[Derek Bailey Shepherd]] in her honor.\n*Bailey played the oboe while in high school and also took dance classes.\n*She likes extra crumb topping on her macaroni.\n*She enjoys extra thick strawberry milkshakes.\n*She likes waffles.<ref>[[I Was Made for Lovin' You]], x</ref>\n*She's afraid of snakes, large spiders, and sharks.<ref>[[Got to Be Real]], x</ref>\n*She is the first female [[Chief of Surgery]] at Grey Sloan Memorial Hospital or any of its predecessors.<ref>[[Walking Tall]], x</ref>\n*Although not stated directly in dialogue, Bailey is [[Board Certification|board certified]] in [[Board Certification#American Board of Surgery|general surgery]], as [[George O'Malley|George]], during his second-time as an [[Internship|intern]], was calculating Bailey's required OR time to sit for boards during her fifth and final year of [[Resident|residency]].\n*During her fourth year of [[Resident|residency]], Bailey applied for five [[Fellow|fellowship]] programs, including Seattle Grace's; however, this has not been brought up since as Bailey considered a [[Pediatric Surgery|pediatric surgery]] fellowship the following year, which she subsequently turned down, in favor of being a general surgery [[Attending|attending]] when she completed her residency.\n*Bailey is the only character to have said Preston Burke's middle name (Xavier) on-screen.\n*She refers to her interns as her \"babies.\"\n*Bailey lost her virginity to her ex-husband, [[Tucker Jones]].\n*Bailey would like to have her way with Idris Elba.\n*When Bailey appointed [[Meredith Grey|Meredith]] [[Attending#Department Head|Head]] of [[General Surgery]], it was implied that Bailey was the unofficial department head of general surgery when she was an attending under [[Richard Webber]] and [[Owen Hunt]].<ref>[[Walking Tall]], x</ref>\n*She's '\".<ref>[[I Choose You]], x</ref> Hence, she has been known to stand on a stool when performing surgery.\n*Her favorite places to have sex in the hospital are the OR galleries after-hours, a spare patient room on the fourth floor, and the library.<ref>[[Notes from the Nurses' Station]]</ref>\n*She drinks her coffee black.\n*Bailey was the first character to appear in every Grey's Anatomy Universe show. She was the only one until [[Amelia Shepherd]] made an appearance on the ''[[Station ]]'' episode [[Born to Run]].\n*She and her family live at  Hawthorne Ave. Seattle, Washington .<ref>[[Leave a Light On]], x</ref>\n*She is the character with the most appearances in the Grey's universe.\n*She does not have any pets because she thinks they smell like feet.<ref>[[(Don't Fear) the Reaper]], x</ref>\n\n\n<gallery position=\"center\" spacing=\"small\" widths=\"\" orientation=\"landscape\" bordersize=\"none\" hideaddbutton=\"true\">\nMirandaBailey.png\nxMirandaBailey.png\nxMirandaBailey.png\nxMirandaBailey.png\n</gallery>\n\n{{GalleryLink}}\n\n\nThese episodes are Bailey-centric or are otherwise very informative about her life.\n*[[It's the End of the World]]\n*[[As We Know It]]\n*[[Forever Young]]\n*[[Lay Your Hands on Me]]\n*[[There's No 'I' in Team]]\n*[[Invasion]]\n*[[Right Here, Right Now]]\n*[[State of Love and Trust]]\n*[[The Time Warp]]\n*[[Push]]\n*[[Sanctuary]]\n*[[Death and All His Friends]]\n*[[Migration]]\n*[[Run, Baby, Run]]\n*[[Things We Said Today]]\n*[[Sleeping Monster]]\n*[[Walking Tall]]\n*[[There's a Fine, Fine Line]]\n*[[You Can Look (But You'd Better Not Touch)]]\n*[[(Don't Fear) the Reaper]]\n*[[Breathe Again]]\n*[[Let's All Go to the Bar]]\n*[[Help Me Through the Night]]\n*[[Fight the Power]]\n\n\n:'''[[George O'Malley|George]]:''' Oh, Dr. Bailey, I can see the top of his head, he's got a lotta hair! Oh, he's cute.\n:'''Miranda:'''\uaO'Malley?\n:'''[[George O'Malley|George]]:'''\uaYeah?\n:'''Miranda:'''\uaStop lookin' at my va-jay-jay.\n:'''[[George O'Malley|George]]:'''\ua[''looks away''] Yes, ma'am.<ref>[[As We Know It]], x</ref>\n\n----\n:'''Miranda:''' He was dying and I created something out of thin air. I took a virus that kills into something that heals. And I saved his life.<ref>[[Everything I Try to Do, Nothing Seems to Turn Out Right]], x</ref>\n\n----\n:'''Miranda:''' On their death bed, nobody wishes they'd worked more. That's the traught little phrase people tried out when they want to play hookey, or spend too much money, or shame working parents for missing their kids' soccer game for a board meeting. On your death bed, no one wishes they'd worked more. Tell that to the people who love their work. It's not about whether you spend your life in a boardroom, your bedroom, or a beach with a mai tai in Maui, when you look back on your life, the only thing that matters is: Did you spend it doing what you love, with the people you love? Were you happy? Did you make the most of this beautiful, terrifying, messed up life? Did you let go of all the things that held you back? So you can hold on to what matters most.<ref>(Don't Fear) the Reaper, x</ref>\n\n----\n:'''Miranda Bailey:''' I have five rules. Memorize them. Rule number one: Don't bother sucking up. I already hate you. That's not gonna change. Trauma protocol, phone list, pagers, nurses will page you. You will answer every page at a run. A run! That's rule number two. Your first shift starts now and lasts  hours. You're interns, grunts, nobodies, bottom of the surgical food chain. You run labs, write orders, work every second night until you drop, and don't complain. On-call rooms. Attendings hog them. Sleep when you can where you can, which brings me to rule number three. If I'm sleeping, don't wake me unless your patient is dying. Rule four: The dying patient better not be dead when I get there. Not only will you have killed someone, you woke me for no reason. We clear? (Meredith raises her hand) Yes?\n:'''[[Meredith Grey]] :''' You said five rules. That was only four.\n:'''Miranda Bailey:''' Rule number five: When I move, you move.<ref>[[A Hard Day's Night]], x</ref>\n\n\n{{Miranda Bailey Appearances}}\n{{Scrollbox}}\n\n[[de:Miranda Bailey]]\n[[fr:Miranda Bailey]]\n[[es:Miranda Bailey]]\n[[it:Miranda Bailey]]\n\n{{DEFAULTSORT:Bailey, Miranda}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:Webisode Characters]]\n[[Category:Doctors]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (ID)]]\n[[Category:Patients (Genetics)]]\n[[Category:Patients (OT)]]\n[[Category:Patients (Cardio)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Ben Warren", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Firefighter Infobox\n|image = Sx-.jpg\n|name = Benjamin Warren\n|status = Alive\n|alias = *The Gas Man\n*Gramps\n*Benji\n*Pops\n*Father Warren\n*Mr. Bailey\n*New Stephanie\n*Plastics Posse ''(along with [[Jackson Avery|Jackson]])''\n*The Old Dogs ''(along with [[Richard Webber|Richard]])''\n*Dad\n|title = M.D.\n|marital = [[Miranda Bailey]] ''(wife)''\n|children = *Miscarried daughter ''(with [[Miranda Bailey|Miranda]])''\n*[[Joey Phillips]]\n*[[William George Bailey Jones]] ''(stepson)''\n*[[Pruitt Arike Miller]]\n|siblings = *Sister\n*[[Rosalind Warren]]\n|parents = *[[Mr. Warren]] \u\n*[[Mrs. Warren]] \u\n|other family = *[[William Bailey]] ''(father-in-law)''\n*[[Elena Bailey]] \u ''(mother-in-law)''\n|job = '''Current'''<br>Firefighter<br>\n'''Former'''<br>\n[[Attending]] [[Anesthesiology|Anesthesiologist]]<br>\n[[General Surgery|Surgical]] [[Resident]]<br>\n|workplace = '''Current'''<br>\n[[SFD Station ]]<br>\n'''Former'''<br>\n[[Mercy West Medical Center]]<br>\n[[Seattle Grace Mercy West Hospital]]<br>\n[[UCLA Medical Center]]<br>\n[[Grey Sloan Memorial Hospital]]\n|first appearance = *'''[[Grey's Anatomy|GA]]:''' [[State of Love and Trust]]\n*'''[[Station |S]]:''' [[Stuck]]\n|count = \n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], and [[Season  (Grey's Anatomy)|]]\n*'''[[Station |S]]:''' [[Season  (Station )|]], [[Season  (Station )|]], [[Season  (Station )|]], [[Season  (Station )|]], [[Season  (Station )|]], and [[Season  (Station )|]]\n|portrayed by = *[[Jason George]] ''(adult)''\n*[[KJ Powell]] ''(younger)''\n}}\n'''Ben Warren''' is a firefighter at [[SFD Station |Station ]] of the [[Seattle Fire Department]]. He is married to [[Miranda Bailey]]. Ben was previously a [[General Surgery|surgical]] [[Resident|resident]] at [[Grey Sloan Memorial Hospital]] and was initially an [[Attending|attending]] [[Anesthesiology|anesthesiologist]] prior to changing his career to surgery, and later to a firefighter.\n\n\n\nBen grew into an adrenalin-chasing teenager. One day, he went on a joyride with his friends Michael and Danny with the latter's father's car. While out driving, Michael asked Danny to let him ride for once. Danny was hesitant but Ben dared him to allow it, which lead to Danny giving in. While Michael was speeding, Danny stood up in the backseat to experience that feeling that the other two had described as amazing. Out of nowhere, a deer crossed the road right in front of them. The car swerved and slammed into a tree. Danny was thrown out and Ben and Michael found him unconscious with an open skull fracture. Michael drove him to the hospital while Ben tried to get him to wake up in the backseat. Danny ended up in a persistent vegetative state. Guilt-ridden, Ben sat by Danny's beside for days until Danny's mother told him that she hoped that this accident had made him start thinking about his actions and that he would never do anything to make his mother go through what she was going through now.<ref>[[Indoor Fireworks]], x (S)</ref>\n\nAs a result, Ben changed himself to get rid of his adrenalin-chasing habits and learned to like crosswords. He got into med school and ended up choosing anesthesiology so he would be able to wake people up, unlike Danny.\n\n\nBen initially was an attending anesthesiologist at [[Mercy West Medical Center]] and transferred to Seattle Grace Mercy West Hospital when the two hospitals merged. During a surgery performed by [[Meredith Grey]] and [[Miranda Bailey]], [[Leslie Wilson|the patient]] woke up on the table and Bailey yelled at Ben to put her back under. Bailey put all the blame on Ben and said that at Seattle Grace, they could always trust the \"gas man\" to keep the patients under while the surgeons did the real work. He set out to investigate and discovered she had a condition that caused her to metabolize the anesthetics more rapidly than normal, which is why she woke up. He found Bailey and asked for an apology, though he let that go when he noticed how rattled Bailey was about the patient refusing to let Bailey touch her again. Leslie had be operated on again as she had a rebleed so Meredith took over from Bailey. During the surgery, Ben knew how to properly keep her under. He brought up Bailey's speech about anesthesiologists being lazy and she told him that she yells at people when she gets scared, which was the closest he'd get to an apology.<ref>[[State of Love and Trust]], x</ref>\n\nBen became interested in Bailey and asked her out to dinner on Valentine's Day to make up for the fact that one of their surgeries was pushed because of a massive trauma. She told him she was too busy with surgery. Callie and Arizona got involved playing Cupid and they got Ben re-assigned to Bailey's new surgery. Arizona joined them in the OR and steered the conversation towards dating. She told Ben that Bailey had almost become a pediatric surgeon until she changed her mind, hinting that Bailey could be persuaded to change her mind about the date. After surgery, Ben congratulated Bailey on her saving the patient. She then told him she didn't want to talk to him because she liked him and his being around her made her go stupid. However, she did agree to go out to dinner with him the next day.<ref>[[Valentine's Day Massacre]], x</ref> The first date went well. A few days later, he found her preparing for a speech at lecture day. He complimented her and although she told him to go away, she enjoyed being flattered.<ref>[[The Time Warp]], x</ref>\n\nSome time later, he told her she was having dinner with him that night for their third date. She had a yoga class scheduled but he convinced her to let that go. Callie got into her head about the third date meaning sex, so while at his apartment, she started lecturing him about her not doing things on a timeline. He interrupted her lecture and said lecturing wouldn't work on him because he wasn't too scared to interrupt her like the people at work. He told her they would have a nice dinner with conversation and swore that he didn't expect sex, because he, too, found the third date early for that. She confessed she hadn't had sex with anyone other than her ex-husband. He didn't mind and appreciated that she, like him, didn't get into that too fast. She asked him what he thought was the right time. While he thought they would know when they were there, he suspected somewhere between date  and . She cautiously asked if he was afraid they'd end up just being friends. He was confident that wouldn't happen since none of them started this looking for friends. He then kissed her and they had a nice evening.<ref>[[Push]], x</ref>\n\nThey continued to date for months. While back at his apartment, she started lecturing him about what he couldn't do to her at the hospital in order to keep her personal and professional lives separated. He got undressed in front of her and told her she could either lecture him or let him take her to his bedroom. She chose the second option. The next day, Mark and Derek found out because of the two of them were humming the same song on the elevator. Bailey later caught Ben flirting with a nurse and spent the day being cold towards him. He found her at the end of the day and told her that he flirted with Liz so she would do him little favors, which made his job more fun. Also, he brought his lazy flirting for Liz so he could save the good flirting for Bailey. She told him she was going through a tough divorce and didn't have time for games. He assured her he was in it for real and they left the hospital holding hands.<ref>[[Shiny Happy People]], x</ref>\n\nDuring the shooting at the hospital, Ben was out playing golf with his phone turned off, so he didn't find out about the shooting until after it was over. Bailey was heavily traumatized from her experience and packed up to go visit her mother with her son. Ben came by her house and found her getting into a cab. She ignored his question about when she'd be back and left. She returned after a month. He tried to talk to her after her work day and she told him that while he was a perfect man, she was too busy holding herself together with tape and glue to be with him now. Since he missed the shooting, he couldn't understand what she was going through and that made it too much for her to be with him. He understood and told her to take care of herself.<ref>[[With You I'm Born Again]], x</ref>\n\n\nFor the rest of the year, Ben stayed out of Bailey's way by bringing a guy named Pierre coffees so he wouldn't assign Ben to Bailey's surgeries.<ref>[[Love, Loss and Legacy]], x</ref>\n\nAt one point, [[Eli Lloyd|nurse Eli]] and Ben got into a conflict because Eli yelled at one of Ben's residents for messing up a routine epidural. Derek broke up the fight and told Ben that they should fight over Bailey on his own time but Ben didn't even know Bailey was dating Eli. In surgery, Ben told Derek the news had upset him so much that he couldn't concentrate during a meeting. Derek then invited him to take out his anger by helping him build the deck at his house. While doing that, Ben vented his anger to Owen about Bailey blowing him off over not being ready for a relationship only to start dating Eli months later. The next day, Ben saw Eli and Bailey together with Tuck. He and Derek agreed they looked happy so Ben let them be. He came out to Derek's deck to blow off steam again in the evening.<ref>[[What is It About Men]], x</ref>\n\nHowever, Ben decided he wouldn't avoid her anymore and they soon ended up on the same surgery again. He approached her and asked her if that would be a problem. She said no. He was happy to hear that because he was done paying off Pierre with lattes if she was now being held together by a male nurse rather than tape and glue. After the surgery, Ben couldn't fully hide his anger about her sleeping with Eli after she basically told him to wait for her. Bailey said a relationship like they had was too much for her to handle and added that what she was doing with Eli was nothing like what they had. Ben asked her what she was doing with Eli then but she ignored the question and told him to take it up with Pierre if he had a problem working with her. After work, Ben shortly greeted Bailey as he walked past her on his way to his car. She came after him and told him he would soon hear things about her breaking up with Eli. She wanted to clarify that that didn't have anything to do with him. He saw right through her lie and smiled as he said he'd see her tomorrow.<ref>[[Love, Loss and Legacy]], x</ref>\n\nA few weeks later, Ben ended up in Bailey's OR again. He had heard about [[Henry Burton]] dying and brought that up, but she snapped that she'd rather talk about her living patients. Ben diagnosed malignant hyperthermia when Bailey's patient on the table started to deteriorate. He acted quickly to get the patient to cool down, which saved the kid's life. Bailey and Ben waited for the patient's temperature to decline sufficiently for the procedure to continue, during which Bailey complimented Ben's quick diagnosis. Afterward, they ended up in an empty cafeteria and she apologized for being rude to him when he mentioned Henry earlier. He was already used to her lashing out, which is what she does when bad things happen to her. It meant she needed space, which is why he sat down at a different table. She said she didn't just lose a patient, she lost a friend. He was sorry to hear that. She then told him she wouldn't mind if he didn't give her quite so much space, after which he moved to her table and held her hand while he finished his crossword puzzle.<ref>[[Suddenly]], x</ref>\n\nThey started their relationship again and after two weeks, Ben asked her to move in. She didn't give him an answer so he maneuvered himself onto her surgery so he could talk to her about it. Bailey recruited Meredith to flood her with questions so she could teach instead of talking to Ben about moving in. Ben saw through that trick and steered the conversation towards living together, citing Meredith and Derek as an example. Bailey pointed out that Meredith's tampering with Derek's trial nearly destroyed both her professional and personal life, which got her to admit that she wanted to keep her personal and professional lives separated. Ben commented he would just like for her to be the first thing he would see in the morning and then let it go. When Meredith left for lunch, Bailey told Ben that she didn't want to complicate what they had by rushing it. He told her his life was happening right now and that he wanted to share all of it with her, every day. If she didn't want that, he thought they weren't right for each other. She still didn't agree, which he took as his answer. After the break, Ben again pointed out Meredith had a perfect balance between her professional and personal life. The patient made it through and Ben joked they could go have a drink to celebrate if only she were to let joy into her life. She snapped and said she wanted to focus at work in order not to make mistakes. After the surgery, Bailey told Ben her whole life fell apart when she got divorced and she had worked hard to get back on her feet. She was scared of her relationship with him blowing up again, which would cause her to get knocked off her feet again. He said they could be scared together in the same house and take it one step at a time, starting with her bringing her toothbrush over. She reminded him she had a son. Ben liked him and assured her that he wanted the whole package. She then agreed to take it one step at a time.<ref>[[This Magic Moment]], x</ref>\n\nBen set up an elegant dinner for her them on Valentine's Day. That morning, he checked if they were still on for tonight as she had a habit of cancelling for a surgery. She told him she had rearranged her entire schedule to be out on time and even brought heels in the back of her car. However, she got drawn in when her patient was found to have a second tumor in a yet-to-be-discovered location. She had Ben push the reservation to  PM but by the time she made it out of the OR, it was :. She ran into Ben, not having realized the time until then, and apologized for ruining their Valentine's Day. She started a lecture about how he couldn't fault her for saving lives. She then noticed he was in a suit. He told her Valentine's Day wasn't over yet and took her to the cafeteria, where he had set up a romantic dinner for the two of them. He had been planning it for weeks as he knew they would never make their reservation. He told her he was very good at romance. She agreed and they shared a toast.<ref>[[All You Need is Love]], x</ref>\n\nAfter working on opposite schedules for weeks, Ben and Bailey agreed to watch a game together, though Ben hadn't planned on actually watching the game since Tuck was at his father's. However, Bailey had to cancel because Callie and Arizona asked her to come to girls' night to cheer up Teddy after Henry's death and her falling out with Owen. Bailey initially wanted to ditch the women for her evening with Ben but she showed up anyway.<ref>[[Support System]], x</ref>\n\n\nBen got offered an internship at UCLA. He accepted and moved to Los Angeles to start. At the beginning, Ben and Bailey weren't sure it would work out, but both Miranda and Ben kept their relationship alive only seeing each other every now and then.\n\n\nBen quit his job at UCLA because he felt he never saw Miranda or his stepson, so he came back and surprised her, saying he quit his job. Miranda was not so thrilled right away because she did approve of him giving up surgery, but, it was later revealed that he did not want to give up surgery and he became a surgical resident again at GSM.\n\n\nWhen a case came in of two sisters, one of whom had developed three kinds of cancer in her lifetime, Richard told the residents to do research on Li-Fraumeni, as that's the condition the girl had. They did the research and developed a treatment plan, but [[Rory Williams]] had already died.<ref>[[You've Got to Hide Your Love Away]], x</ref>\n\n\nAfter Ben opened up a man in the psych ward and operated on a pregnant lady without proper consent and surgical equipment, he was put on probation for  months. He attained privileges as an attending anesthesiologist during his probation.\n\n\nBen was one of the many doctors who helped evacuate patients amidst the hospital explosion. When asked about [[Stephanie Edwards|Stephanie Edwards']] whereabouts, he recalled seeing her before the explosion and led a team of firefighters inside the actively burning hospital to find her. After searching, he found a trace of blood on the stairs leading up to the roof of the hospital, where they were able to locate and save Stephanie and [[Erin Miller|Erin]].\n\n\nBen claimed he was happy with surgery but wanted something more. Later he admited to Miranda that he had been accepted into the Seattle Fire Academy. Miranda was not amused but later supported Ben in his decision.\n\n\n[[Tiffany (Stuck)|Tiffany's]] house caught on fire when her laptop cord sparked on her bed while she was in the bathroom. Station  responded to the fire. Pruitt sent Maya and Andy in to do search and rescue while Dean, Jack, and Travis put out the fire. Maya and Andy quickly found Tiffany and brought her outside, where she said Charlie was still inside. Having extinguished the fire, they searched for Charlie and quickly found a puppy. Dean carried Charlie out and handed him over to a grateful Tiffany.<ref>[[Stuck]], x (S)</ref>\n\nWhile fighting an apartment fire, Jack and Pruitt got separated when Jack entered a kid's room to look for a child. When he came back out, he couldn't find Pruitt because of the smoke. He had to tell Andy he couldn't find her dad and she and Maya came to help look for him. They found him on the floor, unconscious and pulseless. They tried to take him out, but they noticed the fire was choking, so they couldn't go out of the apartment. Once Andy got a pulse on her father, they strapped him to Jack and the four of them jumped out the window onto landing pads. Pruitt was then taken to [[Grey Sloan Memorial Hospital]], where he had surgery and then was diagnosed with mesothelioma. He knew he had to step down as Captain immediately. He said Jack could be in charge until they filled the job. When Andy protested that, he promoted her to lieutenant and said they could share the responsibilities until a new captain was officially chosen.<ref>[[Stuck]], x (S)</ref>\n\nStation  got called out to Stratford Middle School, where someone had pulled the fire alarm. [[Principal Linsley]] met them and said it was likely a false alarm. They said they'd won as quickly as they could to clear the building and get the kids back inside. They went through the building and found the alarm that had been pulled. They turned off the alarm and went continue their sweep, but Ben found Tuck still inside the building. He followed Tuck and saw that he was the one who had pulled the alarm. He needed to get Ben to the school for his friend Ava, who was pregnant and in labor. He did everything he knew to do, but still needed help. Ben and Vic delivered Ava's baby and after a brief complication when the amniotic sac didn't rupture, Ava and the baby were both healthy and stable.<ref>[[Invisible to Me]], x (S)</ref>\n\nWhen a crash caused a tanker to overturn, Station  responded. Dean and Travis had to pry [[Shawn (Invisible to Me)|Shawn]] out of his car while Vic and Ben worked on the truck driver, who had gotten out of the cab and fallen. They noticed it was hot around them just as Andy realized it was an ethanol fire. It was surrounding Ben and Vic and they didn't have enough foam to put it out. Vic and Ben couldn't get out without leaving the truck driver there to die. They got him as wet and cool as they could as they treated him and then conserved their air while the rest of the team tried to figure out how to get them out. Andy eventually decided to back the truck over the flames to get them out and drive it back out.<ref>[[Invisible to Me]], x (S)</ref>\n\nDean and Ben responded to an Aid call at The Langham. They found [[JJ Lau|JJ]] on her floor after she fell off a ladder. Her smoke alarm was still going off, so Dean broke through the ceiling and released smoke into the apartment. He picked up JJ and carried her out of her apartment.<ref>[[Invisible to Me]], x (S)</ref>\n\nThey called the rest of the team in to help and started an evacuation. When the team arrived, they went up to the roof. They located the flame under the roof and created a ventilation hole, despite Jack wanting to make a strip. The hole wasn't sufficient to make the fire die down, so Andy authorized them to cut a strip. The strip worked and the fire started to die down. They got off the roof less than a minute before the roof collapsed.<ref>[[Contain the Flame]], x (S)</ref>\n\nStation  also responded to a medical call. [[Dallas]] called the police after her brother and friends wouldn't wake up when she pulled them out of the pool. They'd made ice cream with liquid nitrogen and poured the rest in the pool to make it look cool. They were able to get the kids all breathing again, but then Jack suddenly jumped into the pool. He emerged with another kid that Dallas thought had gone home. They got her breathing as well and Dallas went to give them numbers to contact parents, but she had trouble breathing and vomited. She was dry drowning. She was put in an ambulance and taken to the hospital.<ref>[[Contain the Flame]], x (S)</ref>\n\nThe team responded to a fire at a B&B on Sunken Meadow Road. Ben and Vic laid out the hoses, but before they could take them into the fire, a neighbor drove over one and popped it. They went to get a replacement line, but it turned out to be unnecessary because the fire was small and contained to the stovetop. They later returned to the Inn when the fire reignited and engulfed the building in flames. When a fire reignited in her face, Vic started to have a panic attack and Ben pulled her out while Andy doused the flames. Outside, Vic's ear was treated where it had been burned. Inside, Andy heard popping. She tried to go toward where she heard Deborah, but there were exploding wine bottles between them. They looked for the fuel that was feeding the fire to stop it off while Andy ran past the bottles to get to Deborah. Andy tied off her leg above a wound and then helped her out, using a tray as a shield from the glass. They were able to turn off the gas to the house, to keep it from reigniting. Once they got Deborah out, they realized she'd inhaled some glass. They couldn't intubate, so they did a crike and got her breathing again. Then they took her to the hospital. When Ben later came to Vic and offered to help her, she denied any trouble, saying she was still a rookie and something like that could damage her reputation forever.<ref>[[Reignited]], x (S)</ref>\n\nThe team was called out for a fire, but it turned out to be a small e-cigarette fire and they were back at the station quickly.<ref>[[Shock to the System (S)|Shock to the System]], x (S)</ref>\n\nThey were later called out again for a car accident involving downed electrical wires. They found [[Marshall]] trapped in his car with live wires around him. They moved the wires as they waited for the power to be shut off so they could get Marshall out of the car. However, when Vic noticed a fuel leak under his car, they were rushed, knowing that if a power line hit the gas, it would burst into flames and kill Marshall. So they coached him through hopping and landing with both feet simultaneously outside the car. Then he had to hop a few more times to safety. As he went to hop, a line snapped behind him, startling him, so he landed on his face instead of on his feet. The power was shut off soon after, but he was electrocuted severely. They attempted to resuscitate him, but they quickly realized the damage was too severe, so they had him call his wife, who was pregnant with triplets, one last time and tell her he loved her and their babies.<ref>[[Shock to the System (S)|Shock to the System]], x (S)</ref>\n\nWhile Jack and Andy were taking The Incinerator test, they left Travis in charge as he had seniority. He took his role very seriously. When they were called out to an intersection, they couldn't find the emergency. Suddenly, Vic noticed [[Piper]] calling out to them from here she was stuck in a pothole in the middle of a crosswalk. When a truck didn't notice her and was heading in her direction, Vic put herself between Piper and the truck and covered them. The truck swerved at the last minute and missed both of them. Travis was very cautious about making sure no one else fell in. They quickly discovered that the asphalt was digging into Piper's leg, keeping her trapped. They'd have to dig around her to free her. They dug for a while, but eventually, they had to pull Piper out when her leg started to swell. She was then taken to the hospital. At the end of the shift, Vic confessed to the others that she had developed a fear of fire since the tanker incident. The team decided to help her without telling Jack and Andy, who would be obligated to report it.<ref>[[Stronger Together]], x (S)</ref>\n\nA fire started at Flanner's restaurant and quickly spread to the rest of the strip mall. Station  was called the respond. Jack rushed in to evacuate people, followed by Ryan, despite Ryan not wearing turnout gear. They evacuated all the survivors they could quickly while Maya, Dean, Vic, and Travis set up the lines to douse the fire. Once the structure became too unstable to continue, they prepared to start the water and ended evacuations. They then noticed a woman on the balcony holding a baby. Jack took the ladder from the engine over to her, but it took time and so Ryan asked the woman to toss down her baby, so she'd be ready to jump to Jack when he got close enough. After some hesitation, she tossed down her baby and he caught it. Then she was able to jump onto the ladder with Jack and was taken safely to the ground. After the fire burned itself out, Ben was put on cleanup.<ref>[[Let It Burn]], x (S)</ref>\n\nWhile Andy was captain, they were called out to respond to Peter, who accidentally ran into a dumpster. On their way to the hospital, they came across a party bus that had crashed. Andy left Jack to monitor Peter while they helped the party bus victims. While they were waiting, Peter offered up the gurney he was on for them to use, so Jack left briefly to take it to them. While he was gone, Peter ransacked the ambulance looking for morphine. During the ensuing struggle with Jack, Peter put his hand through a pane of glass and degloved his finger. Jack, with Dean's help, was able to restrain him and bandage his hand before they were able to take him to the hospital.<ref>[[Every Second Counts]], x (S)</ref>\n\nDespite being on an active call, Andy decided to have her team stop to help the victims of a crashed party bus because the responding station was still eight minutes away. They had to free [[Susan]], who was impaled on a piece of the bus, and [[Carla]], who was pinned under the bus, while also treating [[Mary (Every Second Counts)|Mary]] and the other six victims who were free. They were able to get everyone out and stabilized before station  arrived to take over. Afterward, Ben was interviewed by Ripley as part of the process to decide who would be captain of Station . He asked Ben about the situation with Peter and the party bus crash. At the end of Ben's explanation, Ripley applauded Ben's honesty in the situation.<ref>[[Every Second Counts]], x (S)</ref>\n\nThe station responded to a fire at the house of [[Audrey (Hot Box)|Audrey]] and [[Oliver (Hot Box)|Oliver]]. The fire started in a fireplace and was mostly contained to that area of the house. In order to put out the fire, they needed to go through the garage to get to the innermost part of the house. Audrey tried to get them access, but her blistered finger meant the pad couldn't read her print. Dean was sent to put the override code in, but he forgot the code and couldn't radio out because his radio was on the wrong channel, so after two failed attempts, the others were locked in the garage with no way out. Outside the garage, they had trouble getting access to the house as the windows wouldn't shatter. They broke several chain saws trying to get through. With no ability to vent the fire, it continued to spread. Vic called Pruitt, who had experience getting people out of a garage. When he learned Andy was trapped along with others, he came down to the scene. Since the windows of the house wouldn't shatter, they used sledgehammers to break the wall underneath and vent the fire. It still wasn't enough to cool down the garage, so to give the trapped people more time, Travis had all hoses redirected to spray the garage, hoping to cool it down even a small amount. The trapped were freed when they used the water heater to cause an explosion and compromise the door just enough to give them access.<ref>[[Hot Box]], x (S)</ref>\n\nBen came into work one day and learned that he'd reached an important milestone. He'd walked into and out of fifty fires. He was given a key to the aid car and permission to drive it. Station  anxiously waited to be called in on the skyscraper fire. While they waited, they checked their supplies. When they were finally called in, they responded to the fire and went to base camp to receive their assignments. Most of the team was sent to relieve station  working on the active fire, but Ben and Travis were kept for triage and Maya and Vic were sent above the fire to do crowd control at a law firm where they were keeping civilians held in place. Ben and Travis treated patients with minor burns at triage and sent them out. When Jack and Dean found combustibles on a floor above the fire, a rapid evacuation was started. In order to release the civilians from the top floor, Ripley sent Ben and Travis to clear the black smoke out of the stairwells so they could walk down. They did so, but when the fire jumped floors and broke out the window, Travis became impaled on a shard of glass. With the radios not working, Ben dragged Travis down the stairs. On the stairs, they ran into Molly, who had been trampled by a panicked mob. Her lung was collapsed. Travis told Ben to take Molly downstairs and save the life he could save. Then there was an explosion in the building.<ref>[[Not Your Hero]], x (S)</ref>\n\nBen dragged Molly down the stairs toward the bottom. She suddenly started struggling to breathe even more than before, so Ben put her down. He then used the needle from the EpiPen in her first aid kit to re-inflate her lung. He then started to carry her down the stairs to keep the needle stable. Once she was outside, he put her on a gurney and took her to the aid car and took her to the hospital. He handed her off to Bailey, who took her into surgery. Travis arrived with Vic and Dean moments later, but when he asked about Travis, Vic angrily brushed him off. They all went to the waiting room to see how Molly and Travis would come out. When [[Grant (Station )|Grant]] arrived, he was also upset to learn that Ben had left Travis alone. They continued to wait and were told that Travis's repair would be extremely difficult. Ben also learned that Molly didn't survive her surgery, which upset him. In the end, Travis pulled through and spent the next several weeks recovering.<ref>[[No Recovery]], x (S)</ref>\n\n\nSix weeks after the skyscraper fire, the team gathered at the station to meet their new captain. Ripley introduced them to [[Robert Sullivan]], who immediately established himself as a strict, by the book boss. He said he wanted to improve station 's efficiency and wanted to start immediately.<ref>[[No Recovery]], x (S)</ref>\n\nStation  was called out to help when [[Max Forrester]] fell into a storm drain after disappearing from the hospital. Ben, who had been left behind at the station due to a burn on his hand, was aided by Travis and Pruitt as he located plans for the storm drains' paths to see where Max was most likely to have gone. Station  had a feed down a drain that showed a handprint, giving them a clue where he'd gone. They quickly moved downstream from that location and Maya prepared to jump in to grab Max. However, her oxygen tank wasn't working, so they went to get a replacement tank. While she was gone, Andy heard Max's voice down below them. Over Maya and Sullivan's objections, Andy jumped down into the drain to try to get to him. However, the flow of water picked up and while she was pulled underwater, Max was swept away by the water. Since they'd lost that chance to get him, they had only one more access point down the line. When they arrived, they learned that the opening was smaller than they expected, too small for an adult to fit down to get him. When they heard Max down below them, they considered using a jackhammer to widen the opening, but Ben found that there was a gas line near them and it's too risky. Since they couldn't get an adult down into the drain, they decided to send down a loop for Max to grab. Max was scared to let go and jump to the loop, even when his father told him to. His father finally told him that his mother was dying and encouraged him as he jumped and grabbed the loop. Max was then lifted to safety.<ref>[[Under the Surface]], x (S)</ref>\n\nStation  was called to the apartment of [[Evelyn]] after her downstairs neighbors were worried about her after her floor started collapsing into their apartment and she didn't answer her phone. When they heard creaking behind her door, they broke the lock, which showed that there were stacks of things filling her apartment, which was compromising the floor. They heard Evelyn calling out for help, but weren't able to get in because forcing the door open more could cause them to fall and cause more damage. Sullivan sent Dean to get support beams and Travis and Vic to evacuate the floor below them just in case. Evelyn said she had fallen and was having a hard time catching her breath. She'd recently had heart surgery. Andy wanted to wait for the structural engineers, but Sullivan said one person needed to go in. He wanted Ben to go in, but asked for Maya's input. Maya suggested sending in Andy instead because she's lighter and has more experience. When Andy reached Evelyn and gave a report on her status, Ben talked her through doing draining the blood around Evelyn's heart. Andy then put her on the stretcher and got her out. The floor started to crack more as Andy went to leave and Sullivan pulled her to safety as the floor collapsed beneath her. Andy was upset to know that if she'd had her way and they waited for the engineers, Evelyn would have died.<ref>[[Home To Hold Onto]], x (S)</ref>\n\nStation  was called out to a structure fire. When they arrived, they started a perimeter sweep to see if anyone might be inside and prepared to start fighting the fire. When Maya learned that the hydrant was dry because the building was scheduled for demolition, she suggested that once they cleared the building, they could use the water in the engine to drown the surrounding buildings and let it burn. Jack then saw signs that there were squatters inside. Just then a kid came out of the building with [[Zoe]]. He was handed off to be seen and Zoe tried to re-enter the building. Andy stopped her, saying she needed to be treated, too, but Zoe said there were five more kids inside. They found [[Sean (Lost and Found)|Sean]] and he was evacuated and treated. Andy then noticed a sprinkler system and said they needed to locate the valve. Zoe thought she knew where it was and showed Andy the way to it. Andy reached the valve just as Travis and Ben noticed that what was coming out of the sprinklers was flammable. She didn't get the warning in time and turned on the sprinklers, which caused fire to engulf the building. Dean and Vic ended up trapped with two kids and Andy ended up trapped with Zoe as well. Vic and Dean shared their oxygen with the kids until an exit was made and they were able to evacuate. Ben, Travis, and Andy remained trapped. Water was then finally available and they doused the building as quickly as they could. Everyone was evacuated and treated for smoke inhalation.<ref>[[Lost and Found]], x (S)</ref>\n\nTravis, Dean, and Ben responded to the call when [[Hannah Sherwood]] got her hand caught in her garbage disposal. She'd reached down there when her wedding ring had fallen in and got her hand caught. She turned it off quickly, but then decided to wait for help instead of trying to pull her hand out. Travis said he'd disconnect it and then take it apart to release her hand. While they were work, Hannah noticed that her daughter had gotten a tattoo and asked one of them to check it out to see if it was infected. Dean did and put antibiotic ointment on it. Travis was finally able to free Hannah's hand and they told her to follow up with the hospital in a few days.<ref>[[Last Day on Earth]], x (S)</ref>\n\n\nAfter separating from Miranda, Ben wanted to feel a sense of togetherness, so he planned \"Friendsgiving\" with Jack at Dean's houseboat and invited the rest of the team. However, while they were still preparing the meal, the team was called away due to accidents from the windstorm.\n\nAt the station, they went over storm protocols and gathered extra supplies to be ready. Andy and Sullivan were soon after called out for a car accident, then Greg, Ryan, Pruitt, and Grant surprised the team by bringing Friendsgiving to the station. Meal prep continued, but another call came in and Ben, Dean, Travis, Maya, Vic, and Ripley headed out to cover it, leaving Jack alone at the station. On their way to the call, a tree branch went through the windshield of one of the engines and a fallen tree blocked the road for the other. Ripley and Vic stayed behind to cut up the tree while Maya led the rest of the team to the emergency on foot. They arrived to find [[Jimmy (Weather the Storm)|Jimmy]] trapped in his car in a collapsed carport. They worked to open up the car enough to free him. Just as they were about to get him out, they noticed that the house, where his wife, mother, and twin newborns were, had caught on fire. Travis and Ben went into the house to evacuate the family. Travis easily found and removed Mary, but Ruth was in the nursery with both babies. Ben took them and told Ruth to follow him. He got out of the building and handed off the babies, but then realized Ruth hadn't come out with him. He went back after her, but got trapped until the engine finally arrived with more supplies and they were freed. The fire was then extinguished. It was then announced that Seattle Fire Department wasn't taking calls anymore and everyone should seek shelter immediately, so the team returned to the station and sat down to eat. At the table, Ripley announced that Maya would be a lieutenant soon and he already put her in for a transfer to station .<ref>[[Weather the Storm]], x (S)</ref>\n\nAfter noticing what was happening with Jack, Pruitt called out the rest of the team for not getting him help, knowing they'd all noticed that something was off about him. Dean used the ruse of cleanup duty to get Jack to go to the kitchen, where they held an intervention. He lashed out at them, but was interrupted by Ripley, coming to tell them they were taking calls again and their first call was search and rescue for Andy and Sullivan as no one had heard anything from them in over an hour. They all suited up. Ripley was called back to headquarters, so Pruitt stepped in as captain. Pruitt then benched Jack, left Travis to keep an eye on him, and called Maya up as lieutenant. They left to start the search. With difficulty, they found them and rescued them, but not before Shannon died.\n\nFour months later, Pruitt presented Andy with a Medal of Valor. They then had a party in her honor. At the party, Ben told Dean he was happy to be home with his wife, and prepared to make changes to keep her happy, which may include quitting firefighting.<ref>[[Crash and Burn]], x (S)</ref>\n\nAfter months of rehab, Sullivan was finally ready to go back to work. He met with Pruitt, who had acted as interim captain, and received reports from Pruitt. Pruitt criticized him for missing Jack's PTSD and not seeing that regular drop-ins weren't coming in anymore. This inspired Sullivan to take Ben and Jack for a wellness check on a drop-in Pruitt specifically mentioned. They went to his house and did an exam. He revealed that Sullivan was the reason he stopped checking in. His car was busted, leaving him unable to pick up his medications. Ben then heard regurgitation in his heart. He didn't want to go to the hospital, but he collapsed trying to fight them off. Sullivan distracted him with a game of chess as they worked to get him stable while they waited for an aid car. He stabilized, then checkmated Sullivan. After they sent him to the hospital, they remembered that he mentioned his car wasn't working, so they went to his garage and fixed it.<ref>[[I Fought the Law]], x (S)</ref>\n\nBen, Dean, and Travis had planned to work together to repaint Travis's place. As they prepared to leave, Sullivan talked his way into an invitation to join them. With Sullivan there, they painted in virtual silence. When Sullivan started dancing while painting, they were disturbed, but he explained that when a month ago, you couldn't move your legs, you dance when a song comes on that makes you want to dance. The rest of them started to dance as well.<ref>[[Crazy Train]], x (S)</ref>\n\nOne day, an RV crashed into the side of station . Andy was surprised to see a young girl climb out of the driver's seat. [[Ellie (Baby Boom)|Ellie]] said her mother was shaking and wouldn't stop, so she tried to hit the brake, but hit the accelerator instead. Maya and Ben found her mother inside still seizing. To prevent further damage to the building, Travis disconnected the fuel in the vehicle. Then they worked to expand the exit to get Ellie's mother out. They freed her, but struggled to get her to stop seizing. While they worked on her, Andy took Ellie to the conference room to talk to her and keep her calm. As her mom was ready to be moved, she said she didn't want to go to the hospital with her because she felt she was always messing things up. Shortly afterward, she collapsed from low blood sugar. She was given glucose and quickly woke up, but still worried about her mom having another seizure and her not being able to help. Andy then sent Ellie to the hospital to be with her mom, while they dealt with the damage to the station caused by the crash and subsequent explosion.<ref>[[Baby Boom]], x (S)</ref>\n\n\nWhen Ripley passed out on a sidewalk and was taken to the hospital, Sullivan, Ben, and Andy came to the hospital to check on his condition. Andy and Ben were surprised to learn that he'd been buying flowers for Vic when he passed out. After being banished from his room, they waited in the hospital waiting area. They were shocked when his lab results came back, showing his condition was much worse than previously believed and he had fled the hospital in search of Vic.<ref>[[What I Did for Love]], x</ref>\n\n\nAfter reuniting with Bailey, he decided he wanted to try something that would be less stressful for her and thought it might be time to move on from being a firefighter.<ref>[[Crash and Burn]], x (S)</ref> When Pruitt heard about this, he suggested that Ben try out for Medic One, an elite paramedic team.<ref>[[I Fought the Law]], x (S)</ref> Despite his medical training, Ben wasn't sure he'd be good enough to make it.<ref>[[Crazy Train]], x (S)</ref>\n\n\nBailey unexpectedly became pregnant, but then sadly lost the pregnancy.\n\n\nAfter months of quarantining mostly separately, Ben and Bailey finally got some alone time when [[Rosalind Warren|Roz]] took the boys out for a hike. They had sex and while cuddling afterward, Bailey felt a mass in Ben's testicle. She demanded they go see a urologist right away. Since he refused to go to [[Grey Sloan Memorial Hospital]], she did some research and got them an appointment at [[Clark Kabir|Kabir Urology Clinic]]. Based on the labs and ultrasound, Dr. Kabir strongly suspected a mixed germ cell tumor, for which Ben's job put him at an increased risk. He proposed to perform an orchiectomy and analyze the tissue afterward rather than a biopsy, since that type of tumor could quickly metastasize. On the drive home, Ben revealed he wasn't sure what to tell the boys. Bailey was firm about telling them the truth, which would show them it is okay to be vulnerable. Ben confessed he wasn't ready to have the surgery yet, but Bailey reminded him of the mortality rate for Black men with cancer and said she couldn't handle any more loss after the year she had had. After his conversation with the boys, Joey joined him in the kitchen and asked him questions about the procedure. Ben picked up on his interest in medicine and said he and Bailey would help cover the cost if he were to decide to go to med school, much to Joey's delight.<ref>[[I Guess I'm Floating]], x (S)</ref>\n\nShortly thereafter, news about George Floyd's death spread across the country. Ben found out on his phone at the station and joined his crew-mates in the lounge as they watched the news report on television in horror. Maya brought in [[Diane Lewis]] to grief counsel her team. Ben was the first to seek her out and opened up his fears as a Black man in America and the struggles of raising Black sons in the current political climate.\n\nBen along with Dean, Vic, and Robert attended the annual Black Firefighters Coalition where [[Battalion Chief Gregory]] gave a speech about working his way up to create lasting equity from within. Ben and Vic criticized him for being all talk and no actual change. Later, Ben witnessed how Dean jumped into the ocean after Gregory, who had fallen over the railing after clutching his chest. Ben grabbed a life vest and throw ring and jumped after Dean. Together, they tried to perform CPR on Gregory to no avail while the boat sailed off into the distance. Ben concluded there was nothing they could do for Gregory anymore. They realized they had drifted about a mile from where they had gone overboard, meaning they would be hard to find, and neither of them had a working phone on them to contact people on the boat. Dean refused to let go of Gregory's corpse and they floated around aimlessly waiting for help to arrive. As they drifted around, Ben urged Dean to fight so he could push through with his lawsuit and make the world a better place for Pru. He then revealed his cancer diagnosis and Dean found he was hesitant to have the surgery, which he called Ben out for. Dean freaked about dying again, which would mean that he would die without telling the one woman he wanted to be Pru's mother how he felt about her. Ben was shocked to find out he was in love with Vic. They held hands to float together like sea otters do. As the hypothermia set in, Dean asked Ben to raise Pru with Bailey if he were to die. Ben agreed to do so and reminded Dean that he was not alone in anything, that his village was also Dean's and that they would always support him and fight his fight alongside him. A boat then approached but it sailed past them without noticing them. The waves it created forced Dean to let go of Gregory's body, after which Ben helped Dean to stay afloat. Ben then envisioned Joey graduating from med school and thanking Ben, who couldn't be there but without whom he could never have done it. As they watched a plane fly over, Dean reminded Ben of their deal and said he couldn't use his legs anymore, which Ben attributed to the hypothermia. Dean was glad Ben had jumped into the water after him, even though it was stupid, so he didn't have to do this alone. He then said he needed to let go of Ben to give him a chance to survive. The two of them then finally passed out. Their bodies washed ashore, where the coast guard found them. Vic, Sullivan, and Bailey arrived at the scene just as the two men regained consciousness. As they were carried to the aid cars, they held hands.<ref>[[I Guess I'm Floating]], x (S)</ref>\n\n\n\n[[Miranda Bailey]]\nHe initially clashed with Bailey when their patient woke up on the table while Bailey was operating, which she blamed him for. He later came to Bailey with medical proof and said that it wasn't his fault that the patient woke up. In the second surgery, Bailey said that when she is scared she yells, and that is why she was so mad at him. Ben thought of it as an apology and accepted it.\n\nThey dated for nine months, but after the shooting, Bailey broke up with him, saying she needed to put herself back together. They started dating again after [[Eli Lloyd]] broke things off with her because he was well aware she still loved her ex. They later got engaged and eventually were supposed to get married, but on the way to the wedding Adele Webber was rushed to the ER, and Miranda and Richard went to the hospital. Later they got married. They honeymooned in the Bahamas.\n\nDuring a day off, Miranda told Ben she needed to talk to him. She told him about how even with stepping down temporarily as Chief and changing her diet and exercise, her blood pressure was still too high. She asked him for a sabbatical from their marriage, saying she needed time to get her health in order. He left their home after giving her a last kiss.<ref>[[Do a Little Harm...]], x (S)</ref>\n\nAfter getting back in check with her mental health, Bailey went to Ben and told him that she realized it was her mental health that was the problem, not her physical and she wanted him to come home. He said that she had hurt him really bad, but eventually, he forgave her and showed her this by starting to build the treehouse he promised her after her heart attack. They agreed that they were in it together.<ref>[[Girlfriend in a Coma]], x</ref>\n\n\n[[Rosalind Warren]]\nBen was very close to his brother growing up. They shared rooms for most of their lives, even into adulthood. The relationship was strained when Rosalind came out as transgender. Ben didn't really mind that his brother would soon be his sister and accepted her, but he hated the fact that she had kept it from him all those years while they shared basically everything else.\n\n\nDr. Ben Warren was a fifth-year [[General Surgery|surgical]] [[Resident|resident]] at [[Grey Sloan Memorial Hospital]] before he decided to be a firefighter at [[SFD Station ]].\n\nHe originally worked as an [[Attending|attending]] [[Anesthesiology|anesthesiologist]] at [[Mercy West Medical Center]] prior to the merger with [[Seattle Grace Hospital]]. He kept his position as an attending anesthesiologist when he transferred to the merged [[Seattle Grace Mercy West Hospital]]. During his tenure at Seattle Grace Mercy West Hospital, Dr. Warren was the anesthesiologist on most of [[Miranda Bailey|Dr. Miranda Bailey's]] surgical cases and a few on [[Derek Shepherd|Dr. Derek Shepherd's]] cases. He also supervised [[Resident|anesthesiology residents]].\n\nAfter the events of the hospital shooting, Dr. Warren considered a [[Specialties|specialty]] change into [[Surgery|surgery]] and applied to [[UCLA Medical Center|UCLA's]] [[General Surgery|surgical program]]. At the end of the [[Timeline#Grey's Anatomy Season |- residency year]], Dr. Warren was accepted and soon after, relocated to Los Angeles and began his surgical career as an [[Internship|intern]]. Throughout his intern year, Dr. Warren commuted between Los Angeles and Seattle to spend time with his [[Miranda Bailey|wife]] and [[William George Bailey Jones|step-son]]. During his visits, he was granted privileges at [[Grey Sloan Memorial Hospital]] by [[Chief of Surgery]] [[Owen Hunt]] and acted as a [[Attending|consulting]] anesthesiologist.\n\nDuring his second-year, Dr. Warren resigned UCLA's [[Resident|surgical residency program]] to move back to Seattle and be closer to his family. He then returned to his former position on the staff as an attending anesthesiologist at Grey Sloan Memorial Hospital. However, he missed surgery so much that he decided to continue his residency at Grey Sloan Memorial, taking [[Heather Brooks|Heather Brooks']] place in the program.\n\nHe took an interest in [[Plastic Surgery|plastic surgery]] with [[Jackson Avery]] as his mentor, unwillingly forming the new Plastics Posse. However, when he was on Arizona's service due to Richard's switching around, she noticed his talent and requested him on her service.\n\nDuring his fourth year, Dr. Warren was suspended for six months from the surgical residency program by the chief of surgery. His suspension was due to performing unsupervised surgery beyond his scope of authority exacerbated by a perceived error in judgment leading to the death of two patients. He practiced his former specialty of anesthesiology while being suspended. His suspension was lifted by Bailey after he saved April and her daughter.\n\nNearing the end of his fourth year, Ben decided to apply for the Fire Training Academy and started working out every chance he could get. He was accepted and enrolled in the Medic One Program to become a qualified EMT, a requirement for Seattle firefighters. The Medic One Program allowed for his career change to be branded a fellowship in order not to completely disrupt his career as a surgeon, allowing him to return to the hospital at any moment if he sees fit. As part of the Program, Ben did ride-alongs with paramedics.\n\n\n*During [[What is It About Men]], [[Derek Shepherd|Derek]] asks Ben about his time as a fifth-year [[Resident|resident]]. This is an error as the [[Resident|residency program]] for [[Anesthesiology|anesthesiology]] is only four years.\n*While a [[General Surgery|surgical]] [[Resident|resident]] at UCLA, Dr. Warren retained privileges as an [[Attending|attending]] [[Anesthesiology|anesthesiologist]] at [[Grey Sloan Memorial Hospital]] whenever he visited Seattle.\n*Ben appears to make it a point to try and stay out of his colleagues' personal lives.\n*He has a self-proclaimed impressive running whip stitch technique.\n*His family is \"all about Halloween.\"<ref>[[Thriller]], x</ref>\n*He snores and occasionally talks in his sleep.<ref>[[The Bed's Too Big Without You]], x</ref>\n*He had a crush on Thalia Hall in th grade.<ref>[[The Great Pretender]], x</ref>\n*He was the first prominent anesthesiologist in Grey's Anatomy.\n*When he was a surgical resident, the other residents made fun of him for being older than most residents.\n*Before [[Carina DeLuca|Carina]] joined the main cast of Station-, Ben was the only doctor to be the main cast.\n*He had a fear of fires. After going inside a burning building to locate and save [[Stephanie Edwards|Stephanie]] and [[Erin Miller|Erin]], he got over his fear and became a firefighter.\n*When he was a surgical resident, his lab coat had Ben Warren embroidered on it, while his official name is Benjamin. Other characters with shortened names, such as Jo and Callie, have their official name embroidered on their lab coats.\n**This is also the case with [[Lexie Grey|Lexie Grey's]] lab coat and later [[Tom Koracick|Tom Koracick's]].\n*Ben is one of the handful of characters that has a [[Specialties|dual-specialty]]: [[Anesthesiology|anesthesiology]] and [[General Surgery|general surgery]]. He joins other characters with dual-specialties such as [[Addison Forbes Montgomery|Addison Montgomery]], [[Mark Sloan]], [[Jackson Avery]], [[Sam Bennett]], [[Jake Reilly]], and [[Arizona Robbins]].\n*He loves fantasy basketball.<ref>[[I Want a New Drug]], x</ref>\n*His email password is hothotmiranda.\n\n\n<gallery widths=\"\" position=\"center\" orientation=\"landscape\" bordersize=\"none\" spacing=\"small\" hideaddbutton=\"true\">\nxBenWarren.png\nxBenWarren.png\nxBenWarren.png\nSxBenWarren.png\n</gallery>\n\n{{GalleryLink}}\n\n\nThese episodes are Ben-centric or are otherwise very informative about his life.\n*[[The Great Pretender]]\n*[[There's a Fine, Fine Line]]\n*[[It's Alright, Ma (I'm Only Bleeding)]]\n*[[Come on Down to My Boat, Baby]]\n*[[You Really Got a Hold on Me]]\n*[[Shock to the System (S)|Shock to the System]]\n*[[Indoor Fireworks]]\n*[[I Guess I'm Floating]]\n*[[Comfortably Numb]]\n\n\n:'''Ben (to [[Miranda Bailey|Miranda]]): '''Now, woman, I am naked and I look good. Are you going to sit there and lecture me or are you going to let me take you into my bedroom and have my way with you?<ref>[[Shiny Happy People]], x</ref>\n\n\n{{Ben Warren Appearances}}\n{{Scrollbox}}\n\n[[de:Ben Warren]]\n[[fr:Ben Warren]]\n[[es:Ben Warren]]\n\n{{DEFAULTSORT:Warren, Ben}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:Doctors]]\n[[Category:Firefighters]]\n[[Category:Patients]]\n[[Category:Patients (Oncology)]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (Urology)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "William George Bailey Jones", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|name = William George Bailey Jones\n|image = SxEditWilliamGeorgeBaileyJones.png\n|status = Alive\n|alias = *Tuck\n*Little Tuck\n*Dr. Crazy Person\n*Mini-Nazi\n|siblings = *[[Joey Phillips]] \n*[[Pruitt Arike Miller]]\n|parents = *[[Miranda Bailey]]\n*[[Tucker Jones]]\n|grandparents = *[[William Bailey]]\n*[[Elena Bailey]] \u\n*Grandmother\n|other family = *Stepmother\n*[[Ben Warren]] ''(stepfather)''\n*[[Rosalind Warren]] ''(aunt)''\n*Aunt\n*[[Mr. Warren]] \u ''(step-grandfather)''\n*Mrs. Warren \u ''(step-grandmother)''\n|first appearance = *'''[[Grey's Anatomy|GA]]:''' [[As We Know It]]\n*'''[[Station |S]]:''' [[Invisible to Me]]\n|count = \n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], and [[Season  (Grey's Anatomy)|]]\n*'''[[Station |S]]:''' [[Season  (Station )|]], [[Season  (Station )|]], [[Season  (Station )|]], [[Season  (Station )|]], and [[Season  (Station )|]]\n|portrayed by = *[[BJ Tanner]] ''([[Season  (Grey's Anatomy)|S]]-present)''\n*[[Marcanthonee Jon Reis]] ''([[Season  (Grey's Anatomy)|S]])''\n}}\n'''William George Bailey \"Tuck\" Jones''' is the son of [[Tucker Jones]] and [[Miranda Bailey]].\n\n\n\n[[Image:x-.JPG|thumb|left|[[Miranda Bailey|Bailey]] in labor.]]\nWilliam George Bailey Jones was delivered by [[Addison Forbes Montgomery|Dr. Addison Shepherd]] during a bomb scare at [[Seattle Grace Hospital|Seattle Grace]] while [[Derek Shepherd|Dr. Derek Shepherd]] was operating on Tucker, who crashed his car on the way to the hospital for the birth. [[George O'Malley]] helped coach Bailey through her labor, and she thanked him by naming her son William George Bailey Jones (although he is nicknamed \"Tuck\" for his father). ''(\"[[As We Know It]]\")''\n\n\nWhen Tuck was still very young, his mother brought him into the hospital with her. She took him into an OR gallery, where they observed part of [[Jake Burton|Jake Burton's]] surgery. She took him out of the gallery when Jake coded. ''(\"[[Yesterday]]\")''\n\nOnce her maternity leave ended, she had to bring Tuck into the hospital with her because the nursery was full and Tucker was out of town. When she got paged into surgery, she had Cristina babysit him. ''(\"[[Band-Aid Covers the Bullet Hole]]\")''\n\nTucker took a year off work so that he could take care of Tuck at home. Miranda always felt bad about not having enough time to spend with him so she started to call them from the hospital, once making a late-night call to sing \"God Bless the Child\" to him. ''(\"[[Staring at the Sun]]\")''\n\nOnce, he flooded his house after sticking a toy down the toilet.\n\n\n[[File:BabyTuck.jpg|thumb|left|px|Baby Tuck]]\nOne day, Tuck went to his mother's office in search of her and a bookshelf fell on him. Tuck was rushed to the ER so they could assess his injuries. They ran a full trauma panel and took him for a CT. The CT revealed that his stomach was in his chest and his colon was ruptured. They took him into surgery. When Bailey came into the OR while they were operating, Erica stopped and refused to continue until Bailey left. In order to get her to leave, Cristina agreed to hold Tuck's hand. The surgery was successful, but there was still fluid in his chest, so they didn't know how soon he'd be able to breathe on his own. Desperate to help her son, Bailey invited a faith healer, [[Elizabeth Archer]], to do a healing ritual on Tuck. Afterward, he started breathing on his own and was able to be extubated. ''(\"[[Lay Your Hands on Me]]\")''\n\n\nWhen he was fourteen months old, he punched someone in his day care named Harrison over a graham cracker. Bailey had to bribe the director to keep Tuck there with medical perks for some of the staff and supplying fruit slices. Tucker told her it had happened numerous times before. ''(\"[[Losing My Mind]]\")''\n\n\nAfter the hospital shooting, Tuck went with his mother to see his grandparents for a month. ''(\"[[With You I'm Born Again]]\")''\n\n\nWhile his mom was treating [[Holly Wheeler]], a kidnapping victim, she came to collect Tuck from the hospital daycare to find he was not there. She had been deeply disturbed by the circumstances under which Holly had been abducted from the street by her kidnapper and she jumped to the conclusion that the same had happened to Tuck. It turned out that he had been taken to see a nurse as he had a nose bleed and was reunited with Miranda just after she insisted that another teacher call a 'Code Pink'. ''(\"[[The Girl with No Name]]\")''\n\n\nTuck attended his mother's wedding to [[Ben Warren]]. ''(\"[[Things We Said Today]]\")''\n\n\nTuck told Ben he wanted to be a mad scientist for Halloween, so Ben spent a lot of time helping him create the perfect costume and the two of them decorated the house to look like his lab. ''(\"[[Thriller]]\")''\n\n\nHis mother and Ben took him to an amusement park. He was an inch too short to ride one of the rides, so he tried to scam the ticket taker. He wanted to stuff his shoes with his socks to make himself look taller. He threw a fit when his mom wouldn't let him. ''(\"[[You're Gonna Need Someone on Your Side]]\")''\n\n\nTuck was sent home from school after punching a kid in his class. Bailey let him sit in her office, not wanting to bring the hammer down on him after spending all day doing so with her employees. Ben convinced her to tap him in and he used a \"scare straight\" attempt, showing Tuck [[Andrew DeLuca|Andrew's]] scans and lying to say that Andrew was blind in one eye and Alex was in jail for punching him. It was effective and Tuck handed his phone over to his mother for two weeks and promised to apologize to the kid and never do it again. ''(\"[[I Ain't No Miracle Worker]]\")''\n\n\nDuring a teacher work day, Tuck and his friend, [[Rocco]], didn't have school, so they came to the hospital. Ben was supposed to sign Tuck up for Science Camp, but he forgot, so Maggie offered to do a science camp with the kids instead. They enjoyed the science she showed them and asked how she did it. ''(\"[[Personal Jesus]]\")''\n\n\nAfter treating [[Eric Sterling]], Ben and Bailey knew it was time to give Tuck The Talk. They taught him how, as a Black person, to deal with interactions with the police, telling him to be polite and respectful, even when others aren't. They told him his only job was to make it home safe at the end of the day, so he could become everything he wanted to be. ''(\"[[Personal Jesus]]\")''\n\n\nTuck had a history presentation to give at school, so he got dressed up. He was embarrassed by his mother taking a picture of him on the drive to school because his tie wasn't straight. He later told his mother the presentation went well and he got a standing ovation from all the teachers. ''(\"[[(Don't Fear) the Reaper]]\")''\n\n\nTuck pulled the fire alarm at his school to get Ben there as quickly as possible with no questions. He needed Ben's help because his friend [[Ava Linsley]] was in labor. Tuck then helped Ben and Vic deliver Ava's baby. To keep Tuck from getting in trouble, Ben told him to turn his sweatshirt inside out and cleaned his hands with a wipe so no one would know he had pulled the alarm. ''(\"[[Invisible to Me]]\")''\n\n\nOn Dia De Los Muertos, Tuck decorated a sugar skull and told his mom about the day. ''(\"[[Flowers Grow Out of My Grave]]\")''\n\n\nAfter learning that Tuck was \"talking to\" a girl, Ben and Bailey decided they needed to talk to him about dating and consent and condoms. Ben offered to do it as his father had done for him. He took Tuck for burgers and explained to him that consent is necessary and if at any point, anyone he's with isn't having fun, everything stops. ''(\"[[Silent All These Years]]\")''\n\n\nTuck visited Ben at the station and had a meal with him and the rest of the team. When Tuck left abruptly, Ben tried to stop him, but Tuck called him out on not having much time for them lately because of his Medic One training. At the end of the day, while driving Tuck home, he told him the story of what happened with [[Elliot (The Dark Night)|Elliot]] and his daughter. Tuck agreed that it really sucked. Inspired by Elliot, however, Ben decided to spend the night outside with Tuck looking at the stars. ''(\"[[The Dark Night]]\")''\n\n\nWhen [[Joey Phillips]] was discharged without anywhere to go, Bailey took him to her house, where he played video games with Tuck. ''(\"[[Snowblind]]\")''\n\n\nBen came home after a long shift to find Joey and Tuck playing basketball together. He then joined their game. ''(\"[[Something About What Happens When We Talk]]\")''\n\n\nTuck and Joey came with Bailey to the spaghetti dinner fundraiser to help raise money for Pruitt's funeral. They ate voraciously, then discussed their mutual desire to go down the fire pole, which Ben said they couldn't do. When they cleared their plates, they asked if they could go get more, which Ben said they could. ''(\"[[The Ghosts That Haunt Me]]\")''\n\n\nAt the start of the Covid- pandemic, Ben's sister Rosalind came to live at her brother's house to watch Tuck and Joey while Ben and Bailey both quarantined due to their work. Both boys enjoyed this change and wanted Rosalind to continue to stay with them. Rosalind brought them down to the hospital one evening to clap for the healthcare workers at the hospital along with the firefighters of station . ''(\"[[Nothing Seems the Same]]\")'' ''(\"[[All Tomorrow's Parties]]\")''\n\n\nWhen [[Lorelei]] the tiger escaped into Seattle and was eventually trapped in the barn at station , Tuck and Joey FaceTimed Ben so they could see her. ''(\"[[Wild World]]\")''\n\n\nBen came home one day after living at the station since the start of the pandemic. He said he'd tested negative for the virus, but then told them that Bailey's mother had died. Tuck lashed out at him, saying Ben wasn't his dad, before fleeing to his room and refusing to speak to anyone. Ben drew him out of his room by cooking spaghetti. Tuck apologized and asked him how he and his mom deal with seeing people die so often. Ben explained that while sometimes they could only do damage control, sometimes, they're the answer to someone's prayers. And helping that person can do more than save a life. They can restore someone's faith, which strengthens his own. He then said they'd get through this by showing up for each other. ''(\"[[Out of Control]]\")''\n\n\nAfter the death of George Floyd, protests cropped around the country, including many in Seattle. Joey and Tuck asked Ben if they could join the protests, saying they wanted to march for themselves and for Rosalind. Ben finally agreed and they marched along the rest of Station . ''(\"[[Get Up, Stand Up (Station )|Get Up, Stand Up]]\")''\n\n\nTuck attended the party Ben and Bailey threw at the station for Pru. ''(\"[[Crawl Out Through the Fallout]]\")''\n\n\n\nHis parents tried to conceive for ten years unsuccessfully when his mother was surprised to find she was pregnant.\n\nHis parents then divorced when he was three. By a few years later, his parents had both remarried. He gets along really well with his stepfather\ua[[Ben Warren]]\uaand even calls him dad.\n\n\nHe is friends with [[Ava Linsley]] and they are in debate club together. ''(\"[[Invisible to Me]]\")''\n\n\n*George had a very close relationship to Tuck, as a result of him supporting Miranda during labor. He offered himself to take care of Tuck or entertain him whenever Tucker and Miranda were about to have a fight in the hospital.\n*Tuck dressed as a mad doctor for [[Thriller|Halloween]].\n*He plays the French horn. He was terrible at it at first, but Bailey didn't allow him to quit, and now he's first chair.<ref>[[Sledgehammer]], x</ref>\n*He's in the school debate club.<ref>[[Invisible to Me]], x (S)</ref>\n\n\n\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nxWilliamGeorgeBaileyJones.png|[[As We Know It]]\nxWilliamGeorgeBaileyJones.png|[[Yesterday]]\nxWilliamGeorgeBaileyJones.png|[[What Have I Done to Deserve This?]]\nxWilliamGeorgeBaileyJones.png|[[Band-Aid Covers the Bullet Hole]]\nTuck.png|[[Crash Into Me, Part ]]\nxWilliamGeorgeBaileyJones.png|[[Lay Your Hands on Me]]\nxWilliamGeorgeBaileyJones.png|[[Where the Wild Things Are]]\nTuck.png|[[The Becoming]]\nxWilliamGeorgeBaileyJones.png|[[Losing My Mind]]\nxWilliamGeorgeBaileyJones.png|[[Freedom, Part ]]\nxWilliamGeorgeBaileyJones.png|[[Beat Your Heart Out]]\nxWilliamGeorgeBaileyJones.png|[[Sympathy for the Parents]]\nTuck.png|[[With You I'm Born Again]]\nTuck.png|[[The Girl with No Name]]\nxWilliamGeorgeBaileyJones.png|[[Things We Said Today]]\nxWilliamGeorgeBaileyJones.png|[[Thriller]]\nxWilliamGeorgeBaileyJones.png|[[I Ain't No Miracle Worker]]\nxWilliamGeorgeBaileyJones.png|[[Personal Jesus]]\nxWilliamGeorgeBaileyJones.png|[[(Don't Fear) the Reaper]]\nSxWilliamGeorgeBaileyJones.png|[[Invisible to Me]]\nxWilliamGeorgeBaileyJones.png|[[Flowers Grow Out of My Grave]]\nxWilliamGeorgeBaileyJones.png|[[Silent All These Years]]\nSxWilliamGeorgeBaileyJones.png|[[The Dark Night]]\nxWilliamGeorgeBaileyJones.png|[[Snowblind]]\nxWilliamGeorgeBaileyJones.png|[[Leave a Light On]]\nSxWilliamGeorgeBaileyJones.png|[[Something About What Happens When We Talk]]\nSxWilliamGeorgeBaileyJones.png|[[The Ghosts That Haunt Me]]\nSxWilliamGeorgeBaileyJones.png|[[Nothing Seems the Same]]\nxWilliamGeorgeBaileyJones.png|[[All Tomorrow's Parties]]\nSxWilliamGeorgeBaileyJones.png|[[Wild World]]\nSxTuckJones.png|[[Out of Control]]\nSxWilliamGeorgeBaileyJones.png|[[Get Up, Stand Up (Station )|Get Up, Stand Up]]\n</gallery>\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\n</gallery>\n\n\n{{William George Bailey Jones Appearances}}\n{{Scrollbox}}\n\n[[de:William George Bailey Jones]]\n[[es:William George Bailey Jones]]\n[[fr:William George Bailey Jones]]\n\n{{DEFAULTSORT:Jones, William George Bailey}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:Patients]]\n[[Category:Patients (Cardio)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Neuro)]]\n[[Category:Patients (Ortho)]]\n[[Category:Patients (Peds)]]\n[[Category:Patients (Trauma)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Mr. Warren", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = xMrWarren.png\n|name = Mr. Warren\n|status = Deceased\n|marital = [[Mrs. Warren]] \u ''(wife)''\n|children = *[[Ben Warren]]\n*Daughter\n*[[Rosalind Warren]]\n|other family = *[[Miranda Bailey]] ''(daughter-in-law)''\n*[[William George Bailey Jones]] ''(step-grandson)''\n|only appearance = [[Things We Said Today]]\n|seasons = '''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]]\n|portrayed by = [[Kelly LaMarr]]\n}}\n'''Mr. Warren''' was the father of [[Ben Warren]].\n\n\nMr. Warren attended his son's wedding to [[Miranda Bailey]].\n\nHe later died of colon cancer. [[Ben Warren|Ben]] and [[Rosalind Warren|Rosalind]] spread his ashes after his death. ''(\"[[The Great Pretender]]\")''\n\n\n\nHe has at least three children with [[Mrs. Warren]]: [[Ben Warren|Ben]], [[Rosalind Warren|Rosalind]], and another daughter.\n\n\n*He hated funerals and instructed his kids to spread his ashes in the woods, which they did. His hate for funerals presumably stems from having lost his wife after a long battle against an unspecified illness at a relatively young age.\n\n{{DEFAULTSORT:Warren, Mr.}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:Deceased Characters]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Rosalind Warren", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = SxRosalindWarren.png\n|name = Rosalind Warren\n|status = Alive\n|alias = *Roz\n|siblings = *[[Ben Warren]]\n*Sister\n|parents = *[[Mr. Warren]] \u\n*[[Mrs. Warren]] \u\n|other family = *[[Miranda Bailey]] ''(sister-in-law)''\n*[[William George Bailey Jones]] ''(nephew)''\n*[[Joey Phillips]] ''(nephew)''\n|first appearance = *'''[[Grey's Anatomy|GA]]:''' [[The Great Pretender]]\n*'''[[Station |S]]:''' [[Nothing Seems the Same]]\n|last appearance = *'''[[Grey's Anatomy|GA]]:''' [[All Tomorrow's Parties]]\n*'''[[Station |S]]:''' [[Get Up, Stand Up (Station )|Get Up, Stand Up]]\n|count = \n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]] and [[Season  (Grey's Anatomy)|]]\n*'''[[Station |S]]:''' [[Season  (Station )|]] and [[Season  (Station )|]]\n|portrayed by = *[[Benjamin Patterson]] ''([[Season  (Grey's Anatomy)|S]])''\n*[[V. Vieux]] ''([[Season  (Grey's Anatomy)|S]] and [[Station |S]])''\n}}\n'''Rosalind Warren''' is the sister of [[Ben Warren]].\n\n\n\nRosalind says she knew from the age of five that she was a girl. Despite this, she continued to live her life as a boy into adulthood, when she finally decided she wanted to live her life as her true self and be happy.\n\n\nRosalind went with her brother, Ben, after their father died to spread his ashes at a place where they frequently camped together, at his request.\n\n\nAfter his ashes were spread, Rosalind and Ben raced back up a hill. At the top of the hill, Rosalind was winded and eventually collapsed. She was rushed to the ER, where she refused to cooperate with the doctors, insisting that she was fine despite evidence to the contrary. A test revealed an enlarged spleen, which had to be removed, so [[Meredith Grey|Meredith]] scheduled surgery to do that, but Meredith was also concerned about Rosalind's hormones levels because she appeared male, but had the hormone levels of a young woman. She eventually admitted that she was starting to take hormones to live life as a woman.\n\nWhile waiting for her surgery, Rosalind started to cough up blood from a bleeding esophagus, which was caused by the off-shelf hormones she'd been taking. She was rushed into surgery to repair the bleeding and remove her spleen. After her surgery, her brother continued to reject her as a woman, asking why she didn't tell him sooner, as they've been close since they were kids. She tried to explain, but Ben stormed out.\n\n[[Miranda Bailey|Bailey]] brought [[Jackson Avery]] in for a plastics consult. Jackson introduced himself and asked for her name, saying he didn't figure she was sticking with Curtis. She told him she had chosen Rosalind and Jackson asked if he could call her that and then explained to her the steps for a healthy transition, saying the off-shelf hormones were done and anything she puts into her body is approved and regulated by the hospital from now on. And he also told her it was time to start seeing a therapist again. ''(\"[[The Great Pretender]]\")''\n\n\nWhen an earthquake struck Seattle, Ben was initially reluctant to call his sister because they still hadn't spoken after she came out to him. However, after spending the day working with [[Jackson Avery]], Ben called Rosalind, who had a bookshelf fall at her home, but was okay. ''(\"[[I Feel the Earth Move]]\")''\n\n\nAt the start of the COVID- pandemic, Rosalind came to live at her brother's house to watch their sons while Ben and Bailey both quarantined due to their work. Both boys enjoyed this change and wanted Rosalind to continue to stay with them. Rosalind brought them down to the hospital one evening to clap for the healthcare workers at the hospital along with the firefighters of station . ''(\"[[Nothing Seems the Same]]\")'' ''(\"[[All Tomorrow's Parties]]\")'' \n\nWhen Bailey's mother died, Rosalind was there when Ben broke the news to Tuck. She helped Ben to understand that him lashing out at Ben wasn't personal and was merely an artifact of his grief. She encouraged Ben to help him process his grief and talk about his feelings, unlike how he had dealt with his grief when his own mother died when he was a little older than Tuck. ''(\"[[Out of Control]]\")''\n\n\nAfter the death of George Floyd, protests cropped around the country, including many in Seattle. Joey and Tuck asked Ben if they could join the protests, saying they wanted to march for themselves and for Rosalind. Rosalind said she'd take the lead from Ben. Ben finally agreed and they marched along the rest of Station . ''(\"[[Get Up, Stand Up (Station )|Get Up, Stand Up]]\")''\n\n\nRosalind attended the party Ben and Bailey threw at the station for Pru. ''(\"[[Crawl Out Through the Fallout]]\")''\n\n\n\n[[Ben Warren]]\nRosalind is close to her brother, Ben. They shared a room for most of their lives, even into adulthood. Their relationship was strained when Rosalind came out to Ben as transgender. However, they have since rekindled their relationship and Rosalind even lived with Ben for a while. \n\n[[Miranda Bailey]]\nRosalind gets along well with her sister-in-law, Miranda, who in turn says that Rosalind is a sweetheart. When Miranda learned that Rosalind was transgender, she took the news in stride and supported Rosalind and tried to encourage Ben to be accepting and loving.\n\n\n*She was  at the time of her splenectomy.\n\n\n\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nxCurtisRosalindWarren.png|[[The Great Pretender]]\nSxRosalindWarren.png|[[Nothing Seems the Same]]\nxRosalindWarren.png|[[All Tomorrow's Parties]]\nSxRosalindWarren.png|[[Out of Control]]\nSxRosalindWarren.png|[[Get Up, Stand Up (Station )|Get Up, Stand Up]]\n</gallery>\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\n</gallery>\n\n\n{{Rosalind Warren Appearances}}\n\n{{DEFAULTSORT:Warren, Rosalind}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:Patients]]\n[[Category:Patients (General)]]\n[[Category:Patients (Cardio)]]\n[[Category:Patients (Plastics)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Trauma)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Mrs. Warren", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = SxMrsWarren.png\n|name = Mrs. Warren\n|status = Deceased\n|marital = [[Mr. Warren]] \u ''(husband)''\n|children = *[[Ben Warren]]\n*[[Rosalind Warren]]\n*Unnamed daughter\n|other family = [[Miranda Bailey]] ''(daughter-in-law)''\n|only appearance = [[Comfortably Numb]]\n|seasons = '''[[Station |S]]:''' [[Season  (Station )|]]\n|portrayed by = [[Hilary Ward]]\n}}\n\n'''Mrs. Warren''' is the late mother of [[Ben Warren|Ben]] and [[Rosalind Warren]].\n\n\n\nMrs. Warren married [[Mr. Warren]] and they had three kids together. When Ben was three years old, Ben called his mother into his room because he thought the Sandman was in his closet. That was the first time she saw his scared face. As a young boy, Ben told his mother he wanted to become the first Black President.\n\n\nAt some point, she got sick. She fought hard to stay alive for her children but ended up passing away at a relatively young age.\n\n\nWhile anesthetised to undergo an orchiectomy, Ben had vivid dreams about the surgery. He was awake and envisioned himself being the surgeon with [[Joey Phillips]] assisting him, all the while another Ben functioned as the anesthesiologist. Since the surgical duo did not want to remove his testicle and opted to remove his gallbladder instead, Mrs. Warren appeared and told Ben he was being foolish due to being scared. She told him to listen to his momma and cut out the cancer, so he could stay alive for his boys and his wife, just like she had done. Ben then realized that George Floyd had called out this to mother because he knew he was going to die. Mrs. Warren told Ben she was there for him and his sister. They shared a hug. Mrs. Warren then instructed Surgeon Ben to hand over the scalpel to was brave enough to cut. Joey then stepped up to the table and started the procedure while Mrs. Warren talked to distract Ben. She said he wanted to become President to fix what others couldn't, something he could still do this very day. Mrs. Warren then held out a bassin for Joey to drop the cancerous testicle in. She showed it to Ben and told him that that was not what made him a man; it would only have made him a dead man. She then proudly told her son that he did it.\n\n\n\nMrs. Warren and her husband had three kids: Ben, Rosalind, and an unnamed daughter.\n\n\n*She is the third parent to a main character to make their first appearance post-mortem, the first one being [[Gail Webber]] and the second one being [[Lucia DeLuca]].\n\n{{DEFAULTSORT:Warren, Mrs.}}\n[[Category:Characters]]\n[[Category:S Characters]]\n[[Category:S S Characters]]\n[[Category:Deceased Characters]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Joey Phillips", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|name = Joey Phillips\n|image = x-.jpg\n|status = Alive\n|siblings = *[[Ernie (House Where Nobody Lives)|Ernie]]\n*[[Sarah (House Where Nobody Lives)|Sarah]]\n*[[Frank]]\n*[[William George Bailey Jones]] \n*[[Pruitt Arike Miller]]\n|parents = *Parents \u\n*[[Miranda Bailey]] \n*[[Ben Warren]]\n|first appearance = * '''[[Station |S]]:''' [[House Where Nobody Lives]]\n*'''[[Grey's Anatomy|GA]]:''' [[Save the Last Dance for Me]]\n|count = \n|seasons = * '''[[Station |S]]:''' [[Season  (Station )|]], [[Season  (Station )|]], [[Season  (Station )|]], and [[Season  (Station )|]]\n* '''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]] and [[Season  (Grey's Anatomy)|]]\n|portrayed by = [[Noah Alexander Gerry]]\n}}\n'''Joey Phillips''' is the son of [[Miranda Bailey]] and [[Ben Warren]]. \n\n\n\nJoey was injured while searching an empty warehouse for a warm place for him and siblings to sleep. He told them not to go for help, fearing that they'd be split up, but [[Sarah (House Where Nobody Lives)|Sarah]] believed he was dying and showed Jack where Joey was. When they said Joey needed to go to the hospital, Joey objected, but when he became unresponsive, they took him anyway. They told his siblings where the hospital was and said they could run and meet the ambulance there. ''(\"[[House Where Nobody Lives]]\")''\n\nJoey became agitated when he learned that his siblings had been taken back into foster care. He tried to leave the hospital, but Jo caught him and told him explicitly what could happen if he tried to leave before he got treatment in order to convince him to stay. He later had surgery on his arm. ''(\"[[Save the Last Dance for Me]]\")''\n\nAfter his surgery, Joey was reluctant to do his PT. Cormac initially thought he was bored by it, so he brought in a video game that used the same motions and said he could play that instead. He told them he couldn't play video games or enjoy being safe and warm without knowing his siblings were okay, too. Bailey then made some calls and arranged for his siblings to come to the hospital for pizza and video games, which reassured him greatly. ''(\"[[A Diagnosis]]\")''\n\nWhile Joey was hospitalized, Bailey helped him study and they bonded. He also turned eighteen, but declined to meet with his social worker to discuss his options for continued foster care or group homes. Upset that he was being discharged during a blizzard with nowhere to go, Bailey invited him to come to her house and stay with her family, which he accepted. ''(\"[[Snowblind]]\")''\n\nJoey continued to live with them happily. ''(\"[[Leave a Light On]]\")''\n\n\nBen came home after a long shift to find Joey and Tuck playing basketball together. He then joined their game. ''(\"[[Something About What Happens When We Talk]]\")''\n\n\nJoey and Tuck came with Bailey to the spaghetti dinner fundraiser to help raise money for Pruitt's funeral. They ate voraciously, then discussed their mutual desire to go down the fire pole, which Ben said they couldn't do. When they cleared their plates, they asked if they could go get more, which Ben said they could. ''(\"[[The Ghosts That Haunt Me]]\")''\n\n\nAt the start of the Covid- pandemic, Ben's sister Rosalind came to live at her brother's house to watch Tuck and Joey while Ben and Bailey both quarantined due to their work. Both boys enjoyed this change and wanted Rosalind to continue to stay with them. Rosalind brought them down to the hospital one evening to clap for the healthcare workers at the hospital along with the firefighters of station . ''(\"[[Nothing Seems the Same]]\")'' ''(\"[[All Tomorrow's Parties]]\")''\n\n\nWhen [[Lorelei]] the tiger escaped into Seattle and was eventually trapped in the barn at station , Tuck and Joey FaceTimed Ben so they could see her. ''(\"[[Wild World]]\")''\n\n\nWhen Elena Bailey died of COVID, Ben came home for the first time since the start of the pandemic, saying he'd tested negative and then breaking the bad news to both boys and Rosalind. Tuck lashed out, fleeing to his room and refusing to speak to anyone, even Joey. Ben made spaghetti to draw him out. Joey then sat down with Ben and they talked about having lost people before. Joey talked about the difficulty of being separated from his foster siblings and Ben offered to have a barbecue at the end of the pandemic and inviting all of them over. ''(\"[[Out of Control]]\")''\n\n\nAfter the death of George Floyd, protests cropped around the country, including many in Seattle. Joey and Tuck asked Ben if they could join the protests, saying they wanted to march for themselves and for Rosalind. Ben finally agreed and they marched along the rest of Station . ''(\"[[Get Up, Stand Up (Station )|Get Up, Stand Up]]\")''\n\n\nWhen Bailey found a lump in Ben's testicle that a urologist determined was most likely cancerous, Joey immediately took an interest in the surgery he'd need to have to remove his testicle and hopefully all the cancer. This conversation led to a discussion of Joey's future and if he wanted to go to medical school. When he expressed concern over the cost, Ben easily said they could help with that. ''(\"[[I Guess I'm Floating]]\")''\n\nWhile Ben had his orchiectomy, he dreamed that Joey was helping a version of Ben himself operate. ''(\"[[Comfortably Numb]]\")''\n\n\nJoey shadowed Ben for a whole shift while he was on aid car to get an experience for his college essay. Their first call out was to an encampment like the one Joey had lived in prior to meeting Bailey. Joey quickly recognized their patient as [[Ameen Deng]], a friend of his with a heart condition. While Joey watched, Ben and Jack began treating Ameen. When he coded, Joey told them he was DNR, but without legal paperwork, Ben and Jack were forced to continue treatment over Joey's objections. The CPR was unsuccessful and Ben radioed to Grey Sloan to have a physician pronounce him dead remotely. The next day, near the end of the shift, Joey told Ben he'd finished his essay, which he'd written on the failure of emergency healthcare in the US. ''(\"[[Too Darn Hot]]\")''\n\n\nOne evening, while they were eating dinner amidst the dispute over Pru's custody, Ifeya called Bailey becuase Pru had woken up crying for her. With Joey and Ben's help, Bailey was able to soothe Pru to sleep over the phone. ''(\"[[A House Is Not a Home]]\")''\n\nWhen Ifeya and Bill agreed to allow Pru to live with Ben and Bailey, Joey happily helped them welcome her home. To help nurture her Nigerian culture, Joey found a Nigerian grocery nearby and began cooking with ingredients found there. ''(\"[[Cold Blue Steel and Sweet Fire]]\")''\n\n\nJoey attended the party Ben and Bailey threw at the station for Pru. ''(\"[[Crawl Out Through the Fallout]]\")''\n\n\nOn Halloween, Joey brought Pru to the Station  open house. He dressed as a referee while Pru was Megan Rapinoe, a change from the firefighter costume she'd originally planned to wear. ''(\"[[Demons]]\")''\n\n\n\nAfter his parents died in a car accident when he was five, he ended up in foster care. After several years, he was placed in a house with [[Frank]], [[Sarah (House Where Nobody Lives)|Sarah]], and [[Ernie (House Where Nobody Lives)|Ernie]]. When their foster father was arrested, they ran away together and started living on the streets. They were split up again when Joey was hospitalized and social services was called for the other three. ''(\"[[Save the Last Dance for Me]]\")''\n\n\n*He's the eldest of the siblings, at .<ref>[[Save the Last Dance for Me]], x</ref> He turned  during his hospitalization.<ref>[[Snowblind]], x</ref>\n*He's a straight-A student.<ref>[[Save the Last Dance for Me]], x</ref>\n\n\n\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nSxJoeyPhillips.png|[[House Where Nobody Lives]]\nxJoeyPhillips.png|[[Save the Last Dance for Me]]\nxJoeyPhillips.png|[[A Diagnosis]]\nxJoeyPhillips.png|[[Snowblind]]\nxJoeyPhillips.png|[[Leave a Light On]]\nSxJoeyPhillips.png|[[Something About What Happens When We Talk]]\nSxJoeyPhillips.png|[[The Ghosts That Haunt Me]]\nSxJoeyPhillips.png|[[Nothing Seems the Same]]\nxJoeyPhillips.png|[[All Tomorrow's Parties]]\nSxJoeyPhillips.png|[[Wild World]]\nSxJoeyPhillips.png|[[Out of Control]]\nSxJoeyPhillips.png|[[Get Up, Stand Up (Station )|Get Up, Stand Up]]\nSxJoeyPhillips.png|[[I Guess I'm Floating]]\nSxJoeyPhillips.png|[[Comfortably Numb]]\nSxJoeyPhillips.png|[[Too Darn Hot]]\nSxJoeyPhillips.png|[[A House Is Not a Home]]\n</gallery>\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\nSx-.jpg\n</gallery>\n\n\n{{Joey Phillips Appearances}}\n{{Scrollbox}}\n\n[[de:Joey Phillips]]\n\n{{DEFAULTSORT:Phillips, Joey}}\n[[Category:Characters]]\n[[Category:S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:S S Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:S Rescuees]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (General)]]\n[[Category:Patients (Ortho)]]\n[[Category:Patients (Peds)]]\n[[Category:Patients (Trauma)]]"}]}}}}