{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Jake Reilly", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = PPx-.jpg\n|name = Jacob Miguel Reilly\n|status = Alive\n|alias = *Pineapple Guy\n*Fiji Guy\n*Prince Charming\n*Zeus\n*Thor\n*Beckham\n|title = M.D., [[Fellow of the American College of Obstetricians and Gynecologists|F.A.C.O.G.]]\n|marital = *[[Lily Reilly]] \u ''(wife)''\n*[[Addison Forbes Montgomery]] ''(wife)''\n|children = *[[Angela Reilly]]\n*[[Henry Montgomery]]\n|siblings = Three sisters\n|parents = *Father\n*Mother \u\n|other family = *[[Bizzy Forbes]] \u ''(mother-in-law)''\n*[[\"The Captain\" Montgomery]] ''(father-in-law)''\n*[[Archer Montgomery]] ''(brother in-law)''\n|job = *[[Attending]] [[Reproductive Endocrinology and Infertility|Reproductive Endocrinologist and Infertility Specialist]]\n*[[Attending]] [[Obstetrics and Gynecology|OB/GYN]]\n*[[Attending]] [[General Surgery|General Surgeon]]\n|workplace = '''Current'''<br>[[Seaside Health and Wellness]]<br>\n'''Former'''<br>[[Johns Hopkins Hospital]]<br>\n|first appearance = [[...To Change the Things I Can]]\n|last appearance = [[In Which We Say Goodbye]]\n|count = \n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], and [[Season  (Private Practice)|]]\n|portrayed by = [[Benjamin Bratt]]\n}}\n{{Quote|Look, everything you were saying before. You\ure feeling it because this is right. You and me together is.. right. And I\um not gonna let you run away because you\ure scared, I told you before I stay and fight. And I fought for a year to be with you and that was hard because I like Sam, a lot. But, I knew the moment I met you, in that grocery, and then when you randomly appear on my exam table I knew again. And If I had to wait that was just what I was going to do. And so, I joined the practice, and waited, and waited, and waited. But I\um not gonna wait anymore because this is our time. We\ure supposed to be together. You and me. And I\um in love with you too, though I actually said it. |'''[[Jake Reilly]]''' to '''[[Addison Forbes Montgomery]]'''}}\n\n'''Jake Reilly''' is the [[Reproductive Endocrinology and Infertility|reproductive endocrinologist and infertility specialist]] at [[Seaside Health and Wellness]] and the husband of [[Addison Forbes Montgomery]]. Like his wife, Jake also has a double-specialty, practicing [[General Surgery|general surgery]].\n\n\n\nJake grew up with three younger sisters. Their dad left when he was  years old and their mother died when he was . College had to wait, as he didn't want to split up his family. He worked three jobs and eventually got a free ride to college, and afterwards put himself through med school. There have been many women in his life, but his first real love was Lily.\n\n\nBefore coming to Los Angeles, Jake was married to [[Lily Reilly]], a drug addict, who had a  year old daughter, [[Angela Reilly|Angela]]. After he met her, he soon adopted her daughter. One evening, Lily's drug dealer came to their home. Jake couldn't get rid of him, so he severely beat up the dealer. As a result, the police stepped in and Jake was arrested. His prints were taken and put into the system.\n\nJake frequently spent long hours at his office in order to unconsciously avoid Lily's drug addiction. Working was his way of escaping.\n\nLily died of an overdose and Jake was left alone to take care of Angela, whom he considers to be his own daughter.\n\n\nHe and Addison first met in the supermarket and flirted over pineapples. When they met again, they agreed to go on a date, but decided not to tell each other about who they were in order to make it more exciting. They kissed and flirted and he asked her to come to Fiji with him as a very long date, but standing in the airport after saying goodbye to Naomi, she decided not to go. However, Jake himself didn't go either because of a medical emergency.\n\nSoon after, they found out about their identities when he ended up being her fertility doctor.\n\n\nJake joined the practice to fill the hole left by Naomi. Initially, he felt like an outsider of the practice family. He was happy with that, as he found them to be sharing way too much with each other, but he gradually became part of the family as well.\n\n\n\nAddison proposed to Jake but he didn't say yes. She was embarrassed and hid out in the bathroom. Jake later talked to a hallucination of his dead wife [[Lily Reilly]], who understood he was old school and thought he was the one who had to propose. Lily convinced him that Jake could move on from her as their vows were till death. Jake then set up a romantic scene at Addison's house and asked her to propose again. She did and he accepted.<ref>[[The World According to Jake]], x (PP)</ref>\n\n\nDuring the pandemic, he took interest in model trains.<ref>[[With a Little Help From My Friends]], x</ref>\n\n\nJake is a doctor who is incredibly devoted to his patients. He's willing to spend his personal time with patients if that's what they require. He also tries not to judge about what his patients ask for, as he just considers it his job to make it happen if he can.\n\nHe describes himself as patient and understanding. There is however, a limit to his patience, as demonstrated when Addison wouldn't open up to him about [[Mark Sloan]]. \n\n\n\n[[Lily Reilly]]\nAt some point in his life, Jake met Lily Reilly. They married and he adopted her  year old daughter. However, Lily was a drug addict. Even so, Jake loved her and always hoped that she would choose him over drugs. He once found her on the floor of the bathroom, where she had overdosed on drugs. He performed CPR on her until the paramedics arrived. She died of an overdose.\n\nBefore Jake married Addison, he occasionally talked to Lily, who had already died, asking for advice about Angela. Eventually, her spirit left him, saying he no longer needed her because Addison loves him and makes him happy.<ref>[[The World According to Jake]], x (PP)</ref>\n\n[[Addison Forbes Montgomery]]\nWhen Addison's therapist told her to make a change in her life, she met Jake and they flirted over pineapples at the grocery store. They started seeing each other at a coffee shop. However, they both agreed to keep their identities in secret. Jake was going on vacation to Fiji and he asked Addison to come with him. She eventually accepted, but when at the airport, she realized it wasn't right to try to avoid Sam and the problems the practice was suffering.\n\n[[File:PPx-.jpg|thumb|left|Jake and Addison at their wedding.]]\nLater on, Addison started her fertility treatment only to find out that her doctor was Jake. He admitted he never left for Fiji. Flustered and embarrassed, she left his office.\n\nAddison was extremely startled when she saw that Jake had applied for the fertility specialist opening at Oceanside Wellness. She insisted that there was something wrong with him as a doctor, but he was the perfect candidate, so he was hired.\n\nLater, Addison decided to start fertility treatments again, and Jake was her doctor. He conducted two rounds of IVF on her. When both rounds failed, he helped her attempt to find a suitable surrogate.\n\nAfter Addison broke up with Sam for good, Jake told Addison that she wasn't ready for what he had to offer. He could love her, marry her, and make a baby with her, but she had to get ready. He couldn't have her pining after another man. Addison replied she could get ready.\n\nAfter Addison adopted Henry, Jake moved in with her to be Henry's loving father. A few weeks after, Addison proposed that they get married, startling him and prompting her to lock herself in the bathroom. He insisted he never said no. A few weeks later, Mildred interviewed Jake (a standard procedure when adopting a child) where she found out about Jake's criminal history. Addison wasn't upset about this because she said that her, Jake, and Henry were all supposed to be together, and the judge would see that.\n\nWhen Addison proposed to him one evening, he was stunned. He replied that marriage was a big step, and he wanted the two of them to be ready. Addison was humiliated, and locked herself in the bathroom. Their relationship was tested when Addison accused him of spending too much time with his patients. He shot back that everything was always about her. Fortunately, they got through it after Addison defended Jake to one of his former patients, [[Megan Stewart]].\n\nJake proposed to Addison and they married after Henry's adoption was finalized. He stated to Addison that he knew she was \"the one\" when he invited her to Fiji and again when he saw her sitting on his exam table for the first time.\n\n\nJake grew up as the oldest of four. He has three younger sisters. Their dad left when Jake was  years old, and their mother died when he was .\n\n[[Henry Montgomery]]\nJake is Henry's father. When Jake and Addison were dating, he acted like a father figure to Henry and had to meet [[Mildred Clemons]], the social worker, after he moved in with Addison to make sure he was a good figure in Henry's life. Addison, Jake, and Henry are all now a family.\n\n\nDr. Reilly graduated from [[Duke University School of Medicine]] and completed [[Resident|residencies]] in [[General Surgery|surgery]] and [[Obstetrics and Gynecology|OB/GYN]] at [[Johns Hopkins Hospital|Johns Hopkins]], as well as completing a [[Fellow|fellowship]] in [[Reproductive Endocrinology and Infertility|reproductive endocrinology and infertility]]. He is also [[Board Certification|double-board certified]] in [[Board Certification#American Board of Surgery|general surgery]] and [[Board Certification#Obstetrics and Gynecology|obstetrics and gynecology]]. He started to work at [[Seaside Health and Wellness]] after [[Naomi Bennett]] left the practice.\n\nBefore med school, Jake worked three jobs to pay for college: he was a bike courier, a short-order cook, and a bellman. At some point, he even sold his sperm.\n\n\n*He and Addison met while flirting over pineapples, which he hates.<ref>[[...To Change the Things I Can]], x (PP)</ref>\n*Before choosing fertility, he played around with idea of specializing in drug addictions.<ref>[[Who We Are]], x (PP)</ref>\n*When Jake is formally introduced, his lab coat shows, \"Jake Reilly, M.D., [[Fellow of the American College of Obstetricians and Gynecologists|F.A.C.O.G.]]\" with \"[[Reproductive Endocrinology and Infertility|Reproductive Endocrinology]]\" on the second line, embroidered in script font.\n*He and Sam played intramural basketball in college.\n*Jake is the best fertility doctor in the country, second only to [[Naomi Bennett|Naomi]].\n*At some point in his life, Jake sold sperm in order to get money to take care of his family and to go to college. Therefore, it's likely that he has biological children he doesn't know about.\n*During his interview at [[Seaside Health and Wellness]], [[Addison Forbes Montgomery|Addison]] specifically mentions he is [[Board Certification|board certified]] in [[General Surgery|general surgery]] and [[Obstetrics and Gynecology|OB/GYN]]; despite having completed a [[Fellow|fellowship]] in [[Reproductive Endocrinology and Infertility|REI]], subsequent episodes and promotional material for [[Private Practice]] has not stated him being board certified in REI: this cannot be assumed as there is an insufficient evidence by the show to support a board certification in REI.\n*He is a fan of Game of Thrones as he and his [[Henry Montgomery|son]] binged and subsequently argued over the show, much to the annoyance of his [[Addison Forbes Montgomery|wife]]. <ref>[[With a Little Help From My Friends]], x (GA)</ref>\n*During the Covid- Pandemic, He took up model railroading as a hobby.\n\n\n<gallery widths=\"\" position=\"center\" orientation=\"landscape\" bordersize=\"none\" spacing=\"small\" hideaddbutton=\"true\">\nPPxJakeReilly.png\nPPxJakeReilly.png\nPPxJakeReilly.png\nPPxJakeReilly.png\n</gallery>\n\n{{GalleryLink}}\n\n\nThese episodes are Jake-centric or otherwise very informative about his life.\n*[[Remember Me]]\n*[[Drifting Back]]\n*[[The World According to Jake]]\n*[[In Which We Say Goodbye]]\n\n\n:'''Jake:''' You're not ready for what I have to offer.\n:'''[[Addison Forbes Montgomery|Addison]]:''' I can get ready.\n:'''Jake:''' That would be nice.\n\n\n{{Jake Reilly Appearances}}\n{{Scrollbox}}\n\n[[de:Jake Reilly]]\n{{DEFAULTSORT:Reilly, Jake}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Doctors]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Angela Reilly", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPx-.jpg\n|name = Angela Reilly\n|alias = Ang\n|status = Alive\n|siblings = [[Henry Montgomery]] ''(half-brother)''\n|parents = *[[Jake Reilly]]\n*[[Lily Reilly]] \u\n|grandparents = *Grandfather\n*Grandmother \u\n|other family = *Three Aunts\n*[[Addison Forbes Montgomery]] ''(stepmother)''\n*[[Bizzy Forbes]] \u ''(step-grandmother)''\n*[[\"The Captain\" Montgomery]] ''(step-grandfather)''\n*[[Archer Montgomery]] ''(step-uncle)''\n|first appearance = [[The Letting Go]]\n|last appearance = [[In Which We Say Goodbye]]\n|count = \n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]] and [[Season  (Private Practice)|]]\n|portrayed by = [[Emily Rios]]\n}}\n'''Angela Reilly''' is the daughter of [[Jake Reilly]]. She is known to be in love with her professor from university.\n\n\n\nOn Angela's birthday, Jake came to have dinner with her. She confessed to him that she'd had sex for the first time, but he didn't want to talk about it. She wanted to tell him because she was so happy. It was nice feeling like she did.\n\nAt dinner, Angela interrogated Jake about his own love life. She figured out he liked someone and he told her about Addison. Angela said her mom would have wanted him to be happy.\n\nWhen Jake talked to Angela later, she said that she wanted to meet Addison at some point, though he said nothing was going to happen with them.\n\nAngela came to visit Jake at the office, where he introduced her to Addison. ''(\"[[The Letting Go]]\")''\n\n\nAngela started dating Eli, her human sexuality teacher. She introduced him to Jake when they met up at the movie theatre. Jake was surprised at the age difference.\n\nAngela and Jake later had lunch together and Jake expressed his disapproval at their relationship. She warned him not to make her choose because he wouldn't like her choice.\n\nAddison encouraged Jake to invite Angela and Eli over for dinner. After Jake threatened Eli during that dinner, Angela confronted Jake, saying she hoped Eli misunderstood and Jake didn't really threaten his life. She then left in anger. ''(\"[[The World According to Jake]]\")''\n\n\nAngela attended her father's wedding to Addison and served as his best man. When they danced at the reception, they talked about their argument and cleared the air.\n\n\nThree months later, Angela came to Jake and told him she was taking a semester off from school to go to Rome with Eli while he taught there. Later, before she left, she went to Jake, who apologized for his behavior and said that he only wanted her to be happy, even with Eli. He also said that no matter what, she'd be his girl. ''(\"[[In Which We Say Goodbye]]\")''\n\n\n\nEthan\nAngela dated her classmate Ethan for a period of time. Angela had sex for the first time with him. ''(\"[[The Letting Go]]\")'' Their relationship ended after a short period of time. Angela once said that Ethan was a stupid frat boy, and she was way too good for him. ''(\"[[The World According to Jake]]\")''\n\n[[Eli Wilson]]\nEli is Angela's professor at her college. They first met in his human sexuality class.\n\nAngela's father, Jake, disapproves of Eli because he is  years older than her. Despite the age difference, she says that she loves Eli. ''(\"[[The World According to Jake]]\")''\n\nShe later decided to go to Rome with Eli for a semester while he taught there. ''(\"[[In Which We Say Goodbye]]\")''\n\n\nJake Reilly\nJake is Angela's father. He adopted her after falling in love with her mother. They remain close long after her mother's death. She loves him deeply, despite the conflicts they sometimes have.\n\n\n\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPPxAngelaReilly.png|[[The Letting Go]]\nPPxAngelaReilly.png|[[The World According to Jake]]\nPPxAngelaReilly.png|[[In Which We Say Goodbye]]\n</gallery>\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\n</gallery>\n\n\n{{Angela Reilly Appearances}}\n\n{{DEFAULTSORT:Reilly, Angela}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Addison Forbes Montgomery", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = x-.jpg\n|name = Addison Adrianne Forbes Montgomeryp\n|born = [[Timeline|]]; [[Connecticut]]\n|status = Alive\n|alias = *Satan\n*Addison Shepherd\n*Ruler of All That Is Evil\n*The She-Shepherd\n*Red\n*Addie\n*McHotty\n*Gyno-Beast\n*Monty\n*Kitten\n*Meryl Streep of Maternal-Fetal Medicine\n*The Eggless Wonder\n*Mrs. McDreamy\n*McSlut\n*Wicked Witch\n|title = M.D., [[Fellow of the American College of Surgeons|F.A.C.S.]], [[Fellow of the American College of Obstetricians and Gynecologists|F.A.C.O.G.]]\n|marital = *[[Derek Shepherd]] \u ''(ex-husband)''\n*[[Jake Reilly]] ''(husband)''\n|children = [[Henry Montgomery]]\n|siblings = [[Archer Montgomery]]\n|parents = *[[Bizzy Forbes]] \u\n*[[\"The Captain\" Montgomery]]\n|grandparents = Grandfather\n|other family = *Three sisters-in-law\n*Mother-in-law \u\n*Father-in-law\n*[[Amelia Shepherd]] ''(ex-sister-in-law)''\n*[[Christopher Shepherd]] \u ''(godson)''\n*[[Susan Grant]] \u ''(stepmother)''\n*[[Angela Reilly]] ''(step-daughter)''\n|job = '''Current'''<br>\n[[Attending]] [[Obstetrics and Gynecology|OB/GYN]]<br>\n[[Attending]] [[Fetal Surgery|Fetal Surgeon]]<br>\n[[Attending]] [[Neonatal Surgery|Neonatal Surgeon]]<br>\n[[Attending]] [[Medical Genetics|Medical Geneticist]]<br>\nDirector<br>\n'''Former'''<br>\n[[Attending#Department Head|Head]] of [[Obstetrics and Gynecology|OB/GYN]]<br>\n[[Attending#Department Head|Head]] of [[Neonatal Surgery]]\n|workplace = '''Current'''<br>[[Seaside Health and Wellness]]\n'''Former'''<br>[[Seattle Grace Hospital]]<br>[[Oceanside Wellness Group]]<br>[[New York Hospital]]\n|first appearance = *'''[[Grey's Anatomy|GA]]:''' [[Who's Zoomin' Who?]]\n*'''[[Private Practice|PP]]:''' [[In Which We Meet Addison, a Nice Girl From Somewhere Else]]\n|last appearance = '''[[Private Practice|PP]]:''' [[In Which We Say Goodbye]]\n|count = \n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], and [[Season  (Grey's Anatomy)|]]\n*'''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], and [[Season  (Private Practice)|]]\n|portrayed by = [[Kate Walsh]]\n}}\n{{Quote|Then slowly, over time, everything changes. And you're no longer this young thing, and you don't believe in fairytales and \"perfect\" isn't in your vocabulary. And then suddenly, here is this man and he becomes so familiar to you that one day you find yourself looking at him thinking I could love this person for the rest of my life.|'''Addison Montgomery'''}}\n\n'''Addison Forbes Montgomery''' (formerly '''Montgomery-Shepherd''') is a double\uaboard-certified [[Obstetrics and Gynecology|OB/GYN]], subspecializing in [[Maternal-Fetal Medicine|maternal-fetal medicine]]/[[Fetal Surgery|fetal surgery]], a\ua[[Neonatal Surgery|neonatal surgeon]]\ua(one of the foremost in the country) and a\ua[[Medical Genetics|medical geneticist]]\uaat the\ua[[Seaside Health and Wellness]]. She is married to\ua[[Jake Reilly]]\uaand mother to [[Henry Montgomery]].\n\n\n\nAddison was born in [[Connecticut]] in  into a wealthy background with her brother [[Archer Montgomery|Archer]], father [[\"The Captain\" Montgomery|\"The Captain\"]]\uaand mother [[Bizzy Forbes|Bizzy]].\n\nWhen she was seven, she fell off her bike in the vineyard while going downhill because her tire came off. She flipped over the handlebars and scraped her face on the ground, but [[Archer Montgomery|Archer]] picked her up, told her it was going to be okay, and carried her the half a mile back home. This is how Addison has always seen her older brother, as the big brother who carried her home. \n\nFrom the age of eight, Addison was mixing her father, [[\"The Captain\" Montgomery|The Captain's]] drinks.\n\nWhen she was , Addison also had to deny her father's affair with his secretary, waiting for \"daddy\" while he was having sex in his office and then pretending she had fun getting ice-cream with her father. Her father also had affairs with (among others)  maids,  of Addison's nannies, Jolene her French tutor, and the chef. She only discovered in adulthood that it was her mother who had cheated first, with a woman but chose to stay married because she already had a family. The Captain knew but also stayed with her, but had affairs with other women.\n\nWhen she went to prom in high school, it was with Skippy Gold. Addison was a band geek with braces and a lisp, and she was forced to talk about ''[[Star Wars]]'' the whole night.\n\nAddison attended college at Yale University and medical school at [[Columbia University College of Physicians and Surgeons]] where she met her future husband,\ua[[Derek Shepherd]]; [[Sam Bennett]], a future boyfriend; [[Mark Sloan]], her future lover; and [[Naomi Bennett]], her best friend.\n\nAddison is entitled to a twenty-five million dollar trust fund and owns three properties: a\ua[[New York]]\uabrownstone, a house in\ua[[The Hamptons]], and a house at\ua[[Santa Monica]]. She now lives beside a beach in\ua[[Malibu]]\uanext door to an old friend,\ua[[Sam Bennett]].\n\n\nAddison cheated on her husband of over  years,\ua[[Derek Shepherd|Derek]]\uawith his best friend\ua[[Mark Sloan]]. Before this, Addison and Derek's marriage had been an unhappy one, as Derek had been putting in little effort. Derek even mentioned that the demise of their marriage was not her fault alone. They each owned their respective practices, putting a strain on their marriage. When he found Mark and Addison in bed together, he simply walked away.\n\nDerek then picked up his life in New York, sold his private practice, and relocated to Seattle. This is where he began his relationship with\ua[[Meredith Grey]], who later became his wife.\n\n[[File:xAddisonIntroduction.png|thumb|Addison introduces herself to Meredith.]]\nUpon Richard's request to help out with a patient, Addison visited Seattle. When she arrived at the hospital, she saw Derek fixing Meredith's coat in the lobby. Derek turned around and was shocked to see her, his expression enough for Addison to put the pieces together. She walked over and he asked her what she was doing here. She said he'd know if he had bothered to return any of her calls. She then introduced herself to Meredith as Derek's wife, much to Meredith's surprise. She guessed that Meredith was the woman who had been screwing her husband.<ref>[[Who's Zoomin' Who?]], x</ref>\n\nMeredith ran off, leaving the married couple to talk. She mentioned that his hair looked different, comparing it to Russell Crowe's. He asked her again what she was doing there. She returned the question, pointing out he had abandoned his entire life in New York City. She also brought up his new Seattle girlfriend, who was young, sweet, and in awe of his being a neurosurgeon, whom she summarized as the 'anti-Addison.' He told her to forget about winning him back. She made it clear that was not her intention and stated she was there for a TTTS case on Richard's request. She assumed Richard would have told him. She leaned in and told Derek that she'd always had a thing for Russell Crowe before walking off with a satisfied expression. She went to see Richard, with whom she had a joyful reunion, until Derek interrupted to vent his frustration. Addison left him to it.\n[[File:-.jpg|thumb|Addison and Derek discuss her requesting Meredith for her case.]]\nThe next morning, Addison specifically requested Meredith for the TTTS case. Together, they went to see the patient. In the room, Addison bombarded Meredith with questions. Once outside, Meredith said she could have answered the question had Addison given her the time to do so. Addison commented she was tough on everyone, not just the women sleeping with her husband. She gave Meredith further instructions. Later, Meredith interrupted Addison and Derek talking about her surgical skills to brief Addison about abnormalities found on the ultrasound. Due to signs of heart failure in the babies, they had to operate sooner than planned. Meredith watched closely as Addison worked her magic in the OR. As they checked on Julie after the surgery, Julie requested Meredith be thrown off her case since she had overheard Addison's comment about Meredith sleeping with her husband. Addison then clarified that she had cheated on Derek so the wronged woman here was Meredith, whom she said deserved an apology from Julie.<ref>[[Raindrops Keep Falling On My Head]], x</ref>\n\nAddison went to visit Richard in his room and found him in the company of Derek and Adele. Adele was delighted to see her and commented that she knew Addison and Derek would get back together, but Derek firmly said that adultery was enough to end their marriage. Later, Addison asked to talk to Meredith and inquired if Derek had told her why he had left her. Meredith said she had nothing to do with that situation. Addison was surprised and impressed to find out that Meredith had not taken Derek back. She added that there are two sides to every story and implied that her cheating on Derek with his best friend had been a desperate attempt to get his attention. At the end of the day, Addison ended up on an elevator with Derek. They shared what they had each told Meredith about their situation. Derek scoffed at the idea of Addison sleeping with Mark to get his attention. Addison replied that she was just scratching an itch by that point and Mark was just there, but it was preceded by years of them getting busy with their careers and lazy in their marriage. Derek made it clear he was not interested in Addison's explanation.<ref>[[Enough is Enough]], x</ref>\n\nLater, Addison moved into Derek's trailer, and the two attempted to reconcile. Addison asked Derek if they were even after she got poison oak from walking Meredith's dog in the woods. The two laughed over the incident. They divorced after Addison found a pair of women's underwear in Derek's pocket.\n\nAfter the divorce, Addison had to put Derek in a tiny box and make him petty and insignificant to get up in the morning.\n\n\nAddison had very little in Seattle after she and Derek divorced. Her marriage with Derek was over, her relationship with Mark had completely vanished, and her attempt at a relationship with [[Alex Karev]]\uafailed. She visited Los Angeles to see her friends [[Naomi Bennett|Naomi]]\uaand\ua[[Sam Bennett]], also because Naomi was a fertility specialist.\uaNaomi offered her a position at\ua[[Oceanside Wellness Group]].ꫝison returned to Los Angeles not long after that, taking Oceanside Wellness up on their job offer at their practice. One day, Addison searched through Naomi's files at the practice to read her file and found that her chances of becoming pregnant were worse than she'd previously imagined. She learned that her egg count was a mere two, and was heartbroken.\n\n\n[[Image:x-.jpg|thumb|left|Addison returns to [[Seattle Grace Hospital|Seattle Grace]]. ([[Piece of My Heart]])]] Later, Addison returned to [[Seattle Grace Hospital]] to treat a pregnant woman suffering from [[Piece_of_My_Heart#Medical_Notes|ectopia cordis]], in which the fetus's heart was growing outside of the body. Although she seemed somewhat happy to be back in Seattle, she made it clear that the visit wasn't permanent and she had every intention of returning to [[Oceanside Wellness Group]]. Addison also showed that the history between her, [[Meredith Grey|Meredith]], and [[Derek Shepherd|Derek]] was in the past as she was able to hug Meredith and be genuinely happy for them, unaware that they had broken up.\n\nDuring her stay, in which the surgeries on both mother and child were successful due to Addison, [[Mark Sloan|Mark]], and [[Erica Hahn|Erica's]] expertise, Addison was forced to realize that a lot had changed in her absence (particularly [[The Heart of the Matter|the breakdown of Callie and George's marriage]], [[A Change is Gonna Come|Meredith and Derek's break up]], and his [[Crash Into Me, Part |relationship with Rose]], as well as [[Lay Your Hands on Me|Bailey and Tucker's marital issues]].)\n\nWhen [[Richard Webber|the chief]] approached her and attempted to persuade her to stay at Seattle Grace, Addison told him that she now knew it was the right thing to leave and told him to fill her position. Before returning to Los Angeles, however, Addison went to [[Emerald City Bar|Joe's bar]] and warned [[Meredith Grey|Meredith]] that, even though she was now zen, she wanted to \"kick her ass\" for not fighting for [[Derek Shepherd|Derek]] and allowing his new girlfriend to have the happily ever after that she deserved.<ref>[[Piece of My Heart]], x</ref>\n\n\n[[File:PPx-.jpg|thumb]] Addison's status in the dating world remained uncertain as she had been stood up by [[Kevin Nelson|Kevin]] after she went to find him at the station, and remained unaware that [[Pete Wilder|Pete]] had gone to her house the same night. Sometime later, Addison and [[Naomi Bennett|Naomi]] found themselves at odds regarding Naomi allowing a couple to conceive a child through Naomi's fertility treatment who would act as an organ donor for their ill child. When the parents demanded Addison birth their child three months premature, an ethical debate raged between Addison and Naomi. Addison eventually learned Naomi agreed to help the couple due to the practice's financial trouble that she was concealing from the group. Despite Naomi's pleas, Addison told [[Sam Bennett|Sam]] that the practice was in trouble. At the same time, [[Kevin Nelson|Kevin]] returned for Addison to tell her that he stood her up to train for the SWAT team and the two flirted, leaving their future ambiguous.<ref>[[A Family Thing]], x (PP)</ref>\n\nArmed with the knowledge of the practice's struggles, Sam and Addison formed a hostile takeover of the leadership of the practice and each doctor worked to save the practice from extinction. Addison and Naomi's friendship, however, couldn't stand what Naomi saw to be a betrayal and Naomi cut her best friend out of her personal life, leaving only professional ties.<ref>[[Equal and Opposite]], x (PP)</ref>\n\nWith her 'family' at the practice in disarray, Addison took [[Charlotte King|Charlotte's]] offer to do some surgeries for [[St. Ambrose Hospital|St. Ambrose]], for her to relieve her frustrations which she claimed 'fall away' when she holds a scalpel. However, rushed off her feet and desperate to do nothing but cut Addison spent no time conversing with her patients and getting to know them. When a stressed and worried husband of a pregnant patient asked her what his wife's name was, and she was unable to answer, she realized that she had become the one who wasn't talking and decided to return to family at the practice for good, refuting Charlotte's offer to work at St. Ambrose full-time. This persuaded her to move forward with [[Kevin Nelson|Kevin]] as well as attempting to repair her friendship with Naomi.<ref>[[Nothing to Talk About]], x</ref>\n\n\n[[Image:x-.jpg|thumb|left|px|[[Derek Shepherd|Derek]] tells Addison and [[Archer Montgomery|Archer]] that the cysts are inoperable.]] Having landed in Seattle, a worried Addison was greeted by [[Richard Webber|Richard]] and [[Derek Shepherd|Derek]] as Archer was prepared for a diagnosis. Derek discovered eight cysts caused by the parasites and, having consulted specialists, revealed that they were inoperable as surgery would cause more harm than good. A reluctant Addison refused to give up on Archer and told Derek that she needed him to be a God. As she attempted to pray in the hospital chapel, Addison confessed to [[Callie Torres|Callie]] that she didn't believe God knew who she was, and so praying for a miracle was worthless. Her old friend then reminded her that she saves babies, and God knows who she is because of it. Having received the push from [[Sam Bennett|Sam]], Derek decided to do the surgery. Addison watched on tenterhooks as Derek attempted to remove the parasitic cysts. When removing the eighth and final one, it ruptured, allowing the parasite to dig further into his brain. Addison, however, faced much relief when the parasite was caught, extracted and Archer stabilized. To celebrate Derek's success the old friends visited the [[Emerald City Bar]], where they reminisced about [[Derek's Song|Derek's love song to Addison]]. Addison however, recognized that Derek was in her past, and, despite her gratitude, she had to once again make him petty and insignificant to move on with her life.<ref>[[Before and After]], x</ref>\n\n\nAfter Violet was attacked and gave\ua[[Lucas Wilder|her baby]]\uato\ua[[Pete Wilder|Pete]], Addison became one of the principal caregivers to Lucas. She filled the void left by his birth mother and was overjoyed at the prospect of having a baby of her own. However, after Violet recuperated, Addison told Pete to go back to her, and subsequently lost touch with Lucas. She was, once again, left without a child of her own.\n\n\nAs\ua[[Mark Sloan|Mark]]\uawanted the best care possible for his daughter\ua[[Sloan Riley|Sloan]]\uaand was unsure of\ua[[Elizabeth Chen|Elizabeth Chen's]]\uaabilities, he had Addison fly in for the surgery. When Addison was operating, she realized it would be riskier than she thought. She was confident she could continue successfully, but Mark insisted that she stop. However, he later traveled with Sloan to Los Angeles so Addison could perform it. She did so successfully.\n\n\nSince Callie and Addison were close friends, Addison flew back to Seattle, at\ua[[Richard Webber|Richard's]]\uarequest after hearing that Callie had been in a car accident. She later performed an emergency C-section on Callie and delivered her daughter,\ua[[Sofia Robbin Sloan Torres]], prematurely.<ref>[[Song Beneath the Song]], x</ref>\n\n\nAfter Naomi left, Addison went to therapy.\n\nThe night Pete had a heart attack, Addison sat with Lucas and kept him comfortable until Violet was contacted and returned from the airport. She assured him everything was going to be okay, as Sam and Amelia were the best people to take care of him. Despite Sam still not having changes his mind about having a baby, Addison decided to go ahead anyway and made an appointment with the best fertility specialist she could find in the city. That man turned out to be\ua[[Jake Reilly]], her anonymous date she met flirting over pineapples. She then wanted to quit, but Jake had no problem leaving their flirtation in the past. He promised her he'd give her a baby.<ref>[[God Laughs]], x (PP)</ref>\n\nNot long after, Jake turned out to be applying for Naomi's job at the practice. Addison, being in charge, was hesitant to hire him. Meanwhile, she informed Sam she was going off birth control, so she had him buy condoms. After Jake assured her he had no ulterior motive and promised not to flirt, Addison had to face that he was the best candidate and officially hired him. Addison told her therapist that she didn't need to tell Sam about her Fiji history with Jake, as they were broken up at the time, and admitted that she finally happy again.<ref>[[Breaking the Rules]], x (PP)</ref>\n\nAddison started looking for IVF specialists to start the process. Needing someone to talk to, she grew closer to Violet, who also needed someone to talk to about her marriage problems. Sam later realized he needed to be there for his girlfriend and offered to listen to her talk about IVF specialists, but she told him she was fine. In therapy, she said she became a better and more generous person because of Sam.<ref>[[Deal With It]], x (PP)</ref>\n\nHowever, Addison soon realized she must be crazy to compartmentalize Sam and the baby, starting to fear Sam was going to leave her. She took her concerns to Jake after he told her some more about himself and his youth to make her trust him, but all Jake could tell her was to listen to her instincts. At night, she told Sam what she was worried about. He knew she was, but kissed her to tell her he wouldn't leave. However, in therapy, Addison still said she came to realize that maybe love means wanting the other person to be happy, even if they can't be with you.<ref>[[Remember Me]], x (PP)</ref>\n\nAddison started the IVF process with fertility drugs and asked Jake to inject them as she wanted to stay sexy for Sam, so he couldn't do it for her. Addison tried to keep it secret in order not to become the office gossip, but that became difficult when she soon started suffering from mood swings and extreme emotional reactions to what was happening at the practice. Addison started thinking Sam was just dating her because she couldn't have children, but Jake assured her that was just the hormones. He did tell her she needed people on her side, as she couldn't go through it alone. She then told Sam that she started the IVF process with Jake's help. He once again stated he didn't want a new child because the experience of having a child is as awful at times as it is wonderful, so he was glad to have gotten through it with Maya. He assured Addison that didn't mean he stopped loving her, though. In therapy, Addison said she had to teach herself to have hope again.<ref>[[Step One]], x (PP)</ref>\n\nSoon after, Addison started looking for sperm donors, throwing out lots of candidates based on medical history alone. When she felt like she was drowning in files, Sam assured her she could make it happen. Addison asked her colleagues for help, but they all give her different advice. Addison received good news from Jake: they were able to retrieve  eggs, which needed to be picked that day. He'd contact a friend at the sperm bank to speed up the process, meaning they could fertilize the eggs that day. Sam came to support Addison when Jake would pick the eggs, but she was already under. She woke up with Sam by her side and started crying because she put herself in this position where a stranger was needed to get pregnant, all because she cheated. Sam convinced her the bad things didn't outweigh her good qualities, so she shouldn't punish herself. He advised her to pick the musician's sperm. She did pick him, and later that day, Jake fertilized the eggs with Addison watching.<ref>[[If I Hadn't Forgotten...]], x (PP)</ref>\n\nOver the three days the embryo had to grow in the lab, Addison kept checking on it. She wasn't allowed to have sex before the implantation, but Sam suggested they do \"other things\". She happily agreed to that. Meanwhile, Addison also met [[Ryan Kerrigan]]\uaand expressed her worries over Amelia, who assured Addison she was fine.\uaThe day after, Jake implanted the eggs. In therapy, Addison said she was thrilled and terrified that if all things went right, there could be an entire person with a full life ahead could be growing inside her. She was looking forward to sharing experiences with her child.<ref>[[Don't Stop 'Till You Get Enough]], x (PP)</ref>\n\nAmelia went missing for  days, and when she showed up at the practice to announce her engagement to Ryan, Addison was both angry and relieved at the same time. Since Charlotte was convinced Amelia was using, they staged an intervention at the practice. Amelia started attacking them one by one and hit Addison's weak spot when she attacked her about her infertility and past abortion. Addison threatened to report Amelia to the medical board, throw her out of her house and change the locks, and call in her family, but the only thing that actually got Amelia to stay and listen was the oxy she demanded. The doctors gave her the oxy, which Amelia snorted off the reception desk. Right when Amelia seemed to cave to her friends' talks and agreed to go to rehab, Ryan arrived. The doctors suggested they also help Ryan, but a quarrel ensued when Addison noticed Ryan was wearing\ua[[Mr. Shepherd|Amelia's father's]]\uawatch. Amelia aggressively forbade her from telling that story and soon left with Ryan, leaving Addison to feel like the intervention was a bad idea. However, the next morning, Addison received a call about Amelia, who was ready to go rehab.<ref>[[Who We Are]], x (PP)</ref>\n\nAddison helped her pack and drove her to the treatment center. Amelia, who has a great mother, had Addison think that even the best mothers' kids can go down the wrong path. Later that day, Addison received the news that she was not pregnant, but Jake assured her that didn't mean it was over. Sam seemed relieved about the news, so Violet agreed to hold her hand the next time she was going to try. Addison came up with a crazy plan that included a lot of fertility drugs. She wanted to try again with fresh sperm and fresh eggs, even though she had two frozen eggs left herself. Addison took Sam to therapy with her as he needed to face there would be a baby in her life soon, but he said that was not a problem yet and that he wanted Addison. Two weeks later, Addison collapsed at the practice as a side-effect to the hormone treatment. That made her decide that the embryo transfer would be it: she'd either be pregnant or not. After she was fully recovered, they did the transfer. On Thanksgiving, Addison did a pregnancy test.<ref>[[The Breaking Point]], x (PP)</ref>\n\n\nIn\ua[[If/Then|Meredith's dream]], Derek and Addison are still in an unhappy marriage and Addison is pregnant with their child, though the child is later revealed to be [[Mark Sloan|Mark's]]. Also, Addison is still part of the surgical staff at [[Seattle Grace Hospital]] and remains the [[Obstetrics and Gynecology|OB/GYN]] and [[Neonatal Surgery|neonatal]] [[Attending#Department Head|head]].\n\n\nMere hours after delivering a baby at [[St. Ambrose Hospital]], Addison got a call from her social worker saying that a birth mom had chosen her. She returned to the hospital, shocked to find that it was [[Judi]], the same woman whose baby she had delivered. Judi had decided she couldn't find a better mom for the baby, and that it must have been fate since Addison was the one who delivered the baby boy. Addison named him [[Henry Montgomery]].\n\n\nAddison lost her way during the pandemic. Two months into the first lockdown, Jake and Henry were bickering about Game of Thrones and Addison couldn't bare it anymore, seriously considering to leave Jake. She got up off the couch, got in her car, and started driving for two hours before she stopped and asked herself what she was doing. Addison started to over-indulged in wine. Henry became obsessed with video games and Jake took up a model train hobby, which truly delighted him much to Addison's surprise. She grew increasingly uneasy spending so much time at home and at one point even considered checking herself into rehab for her drinking habits. She went even darker and started daydreaming about going to sleep and never waking up, which comforted her. Eventually, she came up with a research project on uterine transplants and met [[Tovah Freedman]]. The drive to help Tovah motivated Addison to pull herself back together and get out of bed every morning.\n\nAs part of her research, Addison eventually travelled to Seattle to perform a uterine transplant on Tovah, who had her support system in Seattle. Addison reached out to Richard if there was an OR available for her and agreed to make her return a grand rounds teaching opportunity for the residents, whom he mentioned were behind. On the day of the surgery, Seattle was going through a heatwave.\n\nAddison arrived at the skills lab to introduce herself to the group of residents. En route to the patient, she explained her research and quizzed Levi on the pelvic anatomy. When he answered correctly, she allowed him to present the case and upon seeing a connection between him and the Jewish patient, she chose him to scrub in with her along with Richard. The other residents gathered in the gallery to observe and Addison kept them engaged with a multitude of questions. In the middle of the procedure, the HVAC system broke down. The temperature in the OR quickly rose yet Addison refused to close up the patient despite Richard's warning about the risk of infection. To work faster, Addison requested Meredith due to her experience with microvascular anastomosis of the abdomen. Meredith soon joined her in the OR and they congratulated one another on their professional accomplishments. As they operated, Addison asked Meredith what big thing was next for her. Meredith revealed that she had some idea but she needed to sort out things logistically and have a difficult conversation with Richard. After evacuating a clot, Meredith and Addison successfully finished the procedure. As they left the OR, they heard the residents gossiping about the tension between them.\n[[File:xMeredithComfortsAddison.png|thumb|Meredith comforts Addison after opening up to one another.]]\nHowever, once alone on the elevator with Meredith, Addison broke down crying because coming here made Derek's death all too real for her. Meredith said he was there and in her kids is well, whom she invited Addison to meet over dinner at her house. Addison then told Meredith to fight for this big project if she believed in it, stating Meredith had never been one to shy away to fight for what she loved.\n\nAfterward, Addison went to check on Tovah in the ICU. Everything was well. Richard congratulated her and Addison told him the residents were not as bad as he had made them out to be. He couldn't help but point out the difference between the current generation and Addison and Derek's generation, stating the current residents complained a lot. Addison pointed out they were simply standing up for themselves and refusing to be worked to death in a system that could be considered inhumane. She considered that progress and stated there was always room for improvement in the medical education system. He agreed and told her he was glad to see her again. Addison then finally met up with Amelia in the lobby. After a long hug, Addison told her about Meredith's invitation. Amelia took her home and introduced her to Zola and Bailey. Addison got emotional upon meeting them and sat down with them to have ice cream for dinner.<ref>[[Hotter Than Hell]], x</ref>\n\nThe day after, en route to the airport, Addison was notified that Tovah had had a seizure in the ICU. Addison rushed back to the hospital and enlisted Amelia's help to figure out what was causing the seizures. Addison was panicking because Tovah's sister had begged her not to participate in the trial and it could mean that they would have to remove the uterus, meaning all had been for nothing. As they awaited the MRI scan, Amelia confided in Addison as to why she had left Scout's father. Upon hearing that Amelia had struggled so hard during the pandemic, Addison relayed her own experiences, which comforted Amelia. Eventually, they found that the seizure had been due to neurotoxicity from the anti-rejection medication. They decided to switch the meds and start anticonvulsants. Addison needed Amelia to tell her that Tovah would be okay as she absolutely prioritized Tovah's life over her study. Amelia pointed out that Tovah had loved her husband so much that she entered Addison's trial, very much aware of the risks it entailed. Tovah recovered in the ICU and Addison happily informed her that there was still a chance for her to have her husband's baby. On her way out, Addison recalled her frustration with Jake and posed that a slight mental health crisis doesn't make for good decision making. Amelia stated she stayed with Link through the pandemic because she deemed herself crazy to leave a good guy but she wasn't feeling crazy now nor did she feel the need to get high; she realized she just didn't want a ring or more babies, so she thought it the kindest and sanest thing to let him go. Addison smiled and commented that Amelia was all grown up now.<ref>[[With a Little Help From My Friends]], x</ref>\n\n\nAddison is a very confident, smart, and poised woman. She can be described as cold and unforgiving, however, she is also quite warm and kind. She is also very concentrated and dedicated to her work, as she is considered the best in her field. Addison is sometimes difficult and uncompromising but she can be very kind and accepting.\n\nAddison describes herself as a worrier; she constantly worries about what's happening and what's not happening. Professionally, she is very confident, but not personally. She likes to think that worrying prepares her for whatever may happen.\n\n\n\n[[Derek Shepherd]]\n[[Image:x-.jpg|thumb|left|px|Derek and Addison attempting to give their relationship another try.]]\n\nAddison met her future husband, [[Derek Shepherd]], in [[Medical School|medical school]] in the summer. Their relationship grew and they eventually married. Derek once wrote [[Derek's Song|a song]] for her.\n\nAfter medical school, Addison and Derek became extremely successful in their respective fields and each began their own practice in [[New York]]. However, this strained their marriage.\n\nAddison was married to Derek Shepherd for eleven years before eventually sleeping with Derek's best friend, [[Mark Sloan]], which prompted Derek to leave [[New York]] for [[Seattle]] at the request of their old friend and mentor, [[Richard Webber]].\n\nAfter she and Derek initially separated, she tried to get over him, even hoping that dying her hair blond would help. She remained in New York and lived with Mark for two months, during which she became pregnant with Mark's child but she chose to have an abortion. The relationship ended when Mark cheated on Addison and [[Richard Webber]] brought her to Seattle Grace for a consult on a difficult case.\n\nAfter a period of antagonism between her and Derek (in which he continually referred to her as \"Satan\"), Addison decided to stay on as the [[Attending#Department Head|Head]] of Neonatal Surgery and OB/GYN at Seattle Grace, signing a two-year contract after she and Derek decided to make an effort to work things out. Addison was unaware that Derek still had feelings for [[Meredith Grey|Meredith]].\n\nWhen Addison discovered that her husband slept with Meredith at the hospital-sponsored prom, Addison (in a drunken haze) called Mark Sloan to Seattle. She and Derek agreed that their marriage was over and started divorce proceedings. She asked Mark to go back to New York, but he stayed, expressing his desire to continue their relationship.\n\nWhen the divorce was finalized, Addison dropped the \"Shepherd\" from her last name. Wanting to make a fresh start, Derek happily relinquished most of their shared properties (their [[Brownstone]] in [[Manhattan]] and a residence in [[The Hamptons]]) to her believing that she deserved it as his initial impression was that she had only had a one-night stand with Mark while he carried on an affair with Meredith.\n\n[[Alex Karev]]\nShe stayed in Seattle for a long while after and a possibility of a relationship between her and [[Alex Karev]] was hinted at when they kissed in [[Emerald City Bar|Joe's bar]]. She felt it was too strange though and he said he didn't care so the relationship was not brought ahead any further.\n\nDuring the  days that Mark and Addison were trying to remain celibate to give themselves a chance, she slept with Alex. However, despite Addison wanting more, he wasn't ready for that.\n\n[[Mark Sloan]]\n[[File:x-.jpg|thumb|left|px|Addison sleeps with Mark]] Addison and Mark originally met in med school. She cheated on her husband, Derek, with him. After Derek left for Seattle, Addison and Mark lived together for two months, during which time she became pregnant. She had an abortion, and Mark eventually cheated on her.\n\nAfter finding out Meredith and Derek slept together at the prom, she called Mark over to Seattle and slept with him again. Mark decided to move to Seattle in hopes of pursuing a relationship with Addison.\n\nOn the first anniversary of the day she discovered she was pregnant, Addison and Mark made a deal. If they both could abstain from sex for  days she would be willing to try a real relationship with him. She doesn't hold up her end of the bargain when she engaged in a sexual encounter with Alex at the hospital. Mark learned of this after witnessing them stumbling out of an on-call room. She was spared from confessing, however, when Mark selflessly lied to her by telling her he had broken their promise long before. He felt that although he had feelings for her, she shouldn't have to feel guilty.\n\nMark visited Addison in LA when his daughter, Sloan Riley, needed surgery. They had sex several times, which prompted Addison to ask Mark if he truly wanted to have a relationship with her because she could make it work. However, Mark was still in love with Lexie, so he apologized to Addison and turned her down.\n\n[[Pete Wilder]]\n[[File:x-.jpg|thumb|px|Addison and Pete kiss.]] When she left [[Seattle Grace Hospital]] for a [[Oceanside Wellness Group|private practice]] in L.A, she had a brief interest in her co-worker [[Pete Wilder|Pete]] (whom she kissed) but gave up on any potential romance between the two after Pete stood her up for a date.\n\nLater, Pete and Addison reconnected at a hospital event and went back to her house to have pizza and watch lame TV shows, and ended up having sex. They started a relationship that they described as \"helping each other\" and Addison decided to move on from [[Sam Bennett|Sam]] since he was seemingly happy with his new girlfriend, making them officially a couple.\n\nWhen Pete was sick and Addison was looking after Lucas, Pete said \"I love you, [[Violet Turner|Violet]]\" to Addison while on fever medication, leading Addison to confront Pete six weeks later. Pete states that he will always love Violet as she is the mother of his child, but he wants to be with Addison.\ua\n\nViolet returns from Costa Rica and Addison tells her that Pete will pick her because she is Lucas' mother.\ua\n\nLater on the porch, Sam tells Addison he is sick of doing the right thing and should do the wrong thing, and then kisses her as Pete walks in.\ua\n\n[[Kevin Nelson]]\n[[File:PPx-.jpg|thumb|Kevin and Addison sharing lunch in between surgeries.|xpx]] Addison was then asked out by [[Kevin Nelson]], a police officer. Unfortunately, her trust issues interfered with her and Kevin, issues that resulted in her jealously following Kevin after she thought he was having an affair and ending with her arrest by the SWAT team. Nonetheless, she confessed her issues to Kevin and they resumed their relationship.\n\nBut more troubles came when [[Archer Montgomery|Addison's brother]] came to visit and told Kevin that she was just \"enjoying him\". When he hadn't called Addison back; she had thought he was avoiding her, but would find out he had been shot. When her brother left; Kevin moved in with her while he was recovering. While Addison now had to deal with Charlotte who was opening up a competing practice on the fourth floor, she was more annoyed by [[Wyatt Lockhart|Dr. Wyatt Lockhart]], a doctor working for Charlotte's practice who steals a patient of Addison's and convinces Naomi to work for her. In the midst of this relationship, Addison and Kevin's different lifestyles get in the way of their relationship leading to him moving out. But Addison later calls him telling him she misses him, and they make up.\n\nHowever, Addison kisses Wyatt after seeing him for who he really is, not the arrogant, headline grabber she thought he was. Kevin repeatedly questions her where she was that night and believes she's lying, Addison claims she was working, and just as Kevin was finally able to drop the questioning, she admits she kissed another man, and they break up. As Addison goes to Wyatt to try a new relationship, she catches Naomi having sex with Archer instead.\n\n[[Noah Barnes]]\nNoah and Addison frequently met in the scrub room over three months, one of them always finishing surgery and scrubbing out and one scrubbing in, leading to their greeting of \"Finishing or starting?\". They both continued to flirt, not knowing each other's names, and eventually meet in the doctor's lounge where Noah asks for her name. Looking shocked, he quickly leaves.\n\nAddison later meets him as the husband of one of her pregnant patients, Morgan Gellman. Upon this discovery, Addison quickly removed herself from Morgan's case, as she was not comfortable with her feelings for Noah while she treated his wife, feelings which Noah reciprocates. Addison decides not to make a move in their relationship, refusing to be a homewrecker, after her past mistakes with her ex-husband and his best friend. Noah, however, asks her not to leave the case, as she is the best in her field and Morgan cannot lose another child (she had a string of miscarriages before seeing Addison), and he will keep his feelings for Addison in check. However, Noah cannot help the way he feels, and Morgan realizes her marriage is in jeopardy, asking Addison to save her child, as that is all that is keeping her and Noah together. She says she sees it in Noah's eyes, he's there, but he's not quite there. When Addison has to perform surgery on Morgan, Noah is not there for her and Morgan is willing to put off the surgery to have Addison find Noah and he eventually does go into the OR to be there for Morgan, with a push from Addison.\n\n[[Sam Bennett]]\nSam asked Addison out when they were in med school, but Addison declined because [[Naomi Bennett|Naomi]] was in love with him. When Addison moved to LA, she bought the house next door to Sam, leading to their developing friendship.\ua\n\nAddison and Sam kissed after a hiking experience gone wrong while discussing what would have happened had Addison said yes to Sam in med school. They kissed twice more and Sam propositioned Addison to develop their relationship, but Addison said no because Naomi was her best friend.\n\nSam dated another [[Pediatrics|Neonatal]] surgeon, leading Addison to date [[Pete Wilder|Pete]], although she still loved Sam, and she is seen constantly talking about him to Pete. Sam and Addison had an off and on relationship for a long time. \ua\n\nThe main reason for their relationship troubles was that Addison wanted a child, but Sam had Maya, and Maya's daughter, and didn't want more kids. After Addison adopted Henry, Sam seemingly accepted Henry. He even asked her to marry him after Addison and Jake had had sex.\ua\n\n[[Jake Reilly]]\nWhen Addison's therapist told her to make a change in her life, she met Jake and they flirted over pineapples at the grocery store. They started seeing each other at a coffee shop. However, they both agreed to keep their identities in secret. Jake was going on vacation to Fiji and he asked Addison to come with him. She eventually accepted, but when at the airport, she realized it wasn't right to try to avoid Sam and the problems the practice was suffering.\n\n[[File:PPx-.jpg|thumb|left|Addison and Jake at their wedding.]] Later on, Addison started her fertility treatment only to find out her doctor was Jake. He admitted he never left for Fiji. Addison, humiliated, left the office.\n\nWhen Jake interviewed for the fertility specialist opening at Oceanside Wellness, Addison was horrified because she recognized him as her former doctor. She was strongly opposed to the practice hiring him, but she ran out of excuses not to, as he was the perfect candidate for the job. Jake began working at the practice, and Addison made him not mention their previous encounters to Sam, who she was dating at the time of Jake's arrival.\n\nAddison began fertility treatments with Jake as her doctor. He helped her through her two failed IVFs and also to try to find a surrogate.\n\nShe once threw herself at him at an OB/GYN convention in Palm Springs. She was extremely drunk and stumbled into his hotel room, where she asked him if he wanted to sleep with her. He turned her down, saying that it was the alcohol talking and that she would regret it in the morning. When Addison woke the following morning, she remembered what had happened and was thoroughly embarrassed.\n\nJake once asked her if their relationship was purely physical because he cared about her, but she was sending him mixed signals. Addison confirmed that it was not just physical, but also emotional. Their relationship grew over time. When Jake was talking to his daughter, Angela, he told her that it wasn't Addison sending the mixed signals; it was him.\n\nAddison proposed to Jake shortly before Henry's adoption, and was thoroughly humiliated when he didn't answer; but after a talk with the ghost of his late wife, he accepted. They later got married.\n\n\n[[Image:x-.jpg|thumb|left|px|Addison and Callie.]] Since arriving at [[Seattle Grace Hospital]], Addison has made many friendships with other hospital staff, most notably [[Callie Torres]] and [[Miranda Bailey]] (Miranda's reasons being that Addison smells nice, she's polite, and she saves babies). Her friendship with the two ladies has often been based on the fact that they act as each other's confidantes. Callie and Addison often discuss their current relationships and love lives, which has ultimately led to a very close friendship between the two. Addison is also very good friends with fellow attending, [[Preston Burke]], and her ex-husband, [[Derek Shepherd]]. She had a good friendship with [[Mark Sloan]] and a father-daughter bond with [[Richard Webber]] as she is often portrayed to be very close to him. The only intern that Addison really bonded with was [[Alex Karev]] but she had no grudges against any of the interns and even hugged [[Meredith Grey|Meredith]] as a sign of acceptance of her relationship with [[Derek Shepherd|Derek]]. She helped inspire [[Izzie Stevens|Izzie]] to become a fighter again.\n\nAddison is believed to have had a good relationship with the Shepherd family, in particular, [[Nancy Shepherd]], but, pending Derek's revelation of the true extent of Addison/Mark's relationship, her closeness to the Shepherds is in doubt.\n\n[[Image:TheGang.jpg|thumb|left|px|Addison, Derek, Mark, Sam and Naomi at [[Emerald City Bar|Joe's]].]]\n\nAfter moving to [[Los Angeles|L.A.]], Addison returned to [[Seattle Grace Hospital]] to help with a patient whose fetus\us heart was growing out of its body. Upon her return, Addison didn't expect much change; but soon learned that since her departure a lot had changed - for example, the break up of [[Meredith Grey|Meredith]] and [[Derek Shepherd|Derek]] and his relationship with [[Rose]], Callie's divorce and the breakdown of Bailey's marriage. During her stay there she met [[Callie Torres|Callie's]] new friend [[Erica Hahn]] and mistakenly interpreted their friendship as a relationship. The mother and child both survived the surgery and Addison prepared to leave Seattle and return to L.A, telling [[Richard Webber|Richard]] that she needed to come back to see how much she liked her new life. She left, but not before finding Meredith and telling her that she wasn't allowed to let Derek get away.\n\nAddison betrayed Naomi by confronting Sam with something about the practice. Naomi dropped her friendship with Addison and refused to talk to her. Eventually, she and Naomi began to mend their friendship and at last came back to being best friends. Addison (despite her rocky start) got on well with her new colleagues and friendships were rekindled (as she was friends with Naomi and Sam years ago), friendships were started (Violet, Dell, and Coop) and even a short time relationship occurred (with her now friend, Pete). When Naomi left for New York, Addison and Violet became very close, discussing relationship woes and Lucas situations, and just generally they were pretty close. When Amelia came to L.A., she and Addison had a very sisterly relationship.\n\n\nAddison is considered one of the best surgeons in her field in the world, having patients travel across the country to receive medical and surgical care from her, helped by her excellent bedside manner. She formerly worked at [[Seattle Grace Hospital]], before her relocation to [[Los Angeles]] to join a private practice. When she relocated, her surgical practice became limited, with her practice being mostly obstetric work and occasional genetic counseling with Naomi. However, she does have surgical privileges at [[St. Ambrose Hospital]], allowing her to conduct her own surgeries, which is a right she exercises frequently. [[Charlotte King]] also calls on Addison to consult and take on complex medical cases from the hospital, which increases her OR time.\n\nShe completed her [[Resident|surgical residency]] under the supervision of her now good friend, [[Richard Webber]]. During her residency, Richard gave Addison a patient who would not survive, to teach Addison to not get too emotionally involved with her patients, as a result, Addison avoided Richard for almost a year. As an attending, she repeated the same trick with [[Izzie Stevens]] and one of the quintuplets the hospital was taking care of.\n\nDuring her [[Obstetrics and Gynecology|OB/GYN residency]], Addison was mentored by [[Vivian Carlsmith|Dr. Vivian Carlsmith]], a world-renowned OB/GYN , and pioneer in [[Maternal-Fetal Medicine|maternal-fetal medicine]]. Addison was Vivian's smartest student, eventually surpassing Vivian's skill.\n\nAddison's training also encompasses why she is regarded as one of the best surgeons in her field: she is [[Board Certification|board certified]] in [[Board Certification#American Board of Obstetrics and Gynecology|obstetrics and gynecology with her sub-specialty in maternal-fetal medicine]], board-certified in [[Neonatal Surgery|neonatal surgery]], and has completed a [[Fellow|fellowship]] in [[Medical Genetics|medical genetics]], specializing in cystic fibrosis. She is very open about her credentials and has relayed them to patients, co-workers, and subordinates that have doubted her abilities.\n\nSurgically, she is highly skilled in complex, often laparoscopic and open, obstetrical, gynecological, neonatal and [[Fetal Surgery|fetal]] surgeries. She is one of the few surgeons in the world who can separate fetal blood vessels and correct Twin-to-twin transfusion syndrome, which she has special expertise in. [[File:x-.jpg|thumb|xpx|Addison treats a patient at Seattle Grace Hospital.]] She was formerly the [[Attending#Department Head|attending surgeon]] in charge of a world-class [[Neonatal Intensive Care Unit|NICU]] and state-of-the-art OB/GYN wing at [[Seattle Grace Hospital]]. Although a highly successful and well-paid job, Addison left Seattle to go to L.A to join a private practice.\n\nWhen she arrived at the practice she was surprised to discover that Naomi, who gave her the job offer, didn't tell the rest of the staff about Addison. The other doctors showed Addison that she was clearly not welcome. On her first day in the practice, she performed surgery in an unsterilized delivery room only with the help of Alternative Medicine Specialist, Pete. On the end of the same day, they decided to vote on whether Addison should join the practice or not but Addison put her foot down and told them that she was going to stay even if they wanted her gone. Everyone was impressed by her speech and they decided not to vote after all.\n\n[[Image:PPSCast.jpg|thumb|right|px|The main staff of the Oceanside Wellness Group, and [[Charlotte King]], Chief of Staff at [[St. Ambrose Hospital|St. Ambrose]].]]\n\nWhen [[Richard Webber]] asked Addison to [[Piece of My Heart|return for a complex surgery]], she agreed, and at the end of the day, Richard attempts to get her back and letting her start the next morning. Addison declined the offer, being sure that leaving was the right thing to do. Similarly, when Naomi would not speak to Addison, Addison took several surgeries at [[St. Ambrose Hospital|St. Ambrose]] to relieve her frustrations. [[Charlotte King|Charlotte]] tried to woo her to the hospital with the surgeries but Addison declared the practice as her 'home'.\n\nNot long after moving to Los Angeles, Addison learned that [[Oceanside Wellness Group|the practice]] was failing financially so confronted Sam and the two formed a hostile takeover. In a bid to get the practice back to how it used to be Addison accidentally prompted a vote between [[Sam Bennett|Sam]] and [[Naomi Bennett|Naomi]], but was stunned when she was elected to lead the practice as Addison's leadership shone through.\n\nLater, Addison dissolved the practice, funded the change, and renamed it to [[Seaside Health and Wellness]].\n\n\n*She was  when she moved to [[Los Angeles]].<ref>[[Didn't We Almost Have It All?]], x</ref>\n*When Derek left her in New York, Addison dyed her hair blonde.<ref>[[Walk on Water]], x</ref>\n*Since moving to L.A, Addison describes herself as very zen. She buys aromatherapy candles and takes walks on beaches.\n*When she worked at [[Seattle Grace Hospital]], her salary made her one of the highest-paid surgeons in the Northwestern United States.\n*Addison performs abortions. She believes life only begins when the baby can survive outside the mother's body, thus at birth.<ref>[[Crime and Punishment]], x (PP)</ref>\n*During her education, Addison always hated neuroanatomy.\n*Addison's SGH ID badge stated her departments were [[Obstetrics and Gynecology]] and [[Neonatology]].\n*Addison sometimes wears reading glasses.<ref>[[Staring at the Sun]], x</ref>\n*She has a lucky [[Scrubs|scrub cap]].\n*Addison has a very close sisterly relationship with [[Amelia Shepherd]], as Addison took her to get her ears pierced, she did her hair for prom, and she explained to her how to use birth control when Amelia didn't know who to ask.\n*Before she was officially a part of the [[Seattle Grace Hospital]] attending staff, she wore salmon scrubs. Whether or not she owned these scrubs or if she was wearing the uniform color of OB/GYNs remains unclear. Kate Walsh stated in an interview that it was decided to let Addison wear the navy blue scrubs to make her more part of the attendings group.\n*Whenever Addison wants to tell something that she cannot tell, she stares at the person she wants to tell.\n*Addison and her family are WASPs - they only go to Church on Christmas, and she does not know how to pray.<ref>[[Before and After]], x</ref>\n*Addison rarely mentions being a WASP during her time as a series regular on Grey's Anatomy but talks about it quite often in Private Practice. However, when she mentions it in GA, she is referring to the Protestant aspect, whereas she mainly uses the term in PP to discuss the culture of her childhood and family, in the social group aspect.\n*It has been noted that Addison's qualifications are unrealistic for a practicing doctor in her late-s/early-s, as she has already gained a highly-regarded reputation at her character's introduction to the series. Since Derek and she attended medical school together and were both educated by Richard Webber, it is likely she completed a -year residency in general surgery followed by a -year fellowship in pediatric surgery focusing on neonatal and fetal surgical procedures, returning to complete a -year residency in obstetrics and gynecology followed by a -year fellowship in maternal-fetal medicine, with her (likely to be) -year fellowship in medical genetics following everything else. In reality, under the best circumstances, this would make Addison a minimum of  years old.\n**It has been indicated throughout seasons five and six of ''[[Private Practice]]'' that Addison first completed a residency in [[Obstetrics and Gynecology|OB/GYN]]. This would mean that she followed up with fellowships in maternal-fetal medicine and medical genetics, then completed a general surgery residency and finished with a pediatric surgery fellowship focusing on neonatal and fetal surgeries. If this is indeed the case, this creates a continuity-error with her being mentored by Richard, as stated in ''[[Grey's Anatomy]]'', as OB/GYN residents do not rotate in other surgical departments; this would be plausible if Richard were somehow involved in Addison's OB/GYN residency.\n*Addison appeared in every single episode of\ua''[[Private Practice]]'', except for\ua[[Two Steps Back]]\uaand\ua[[The Hardest Part]].\n*Although incorrect, [[Jake Reilly|Dr. Jake Reilly]] referred to Addison as a [[Neonatology|neonatologist]].<ref>[[Don't Stop 'Till You Get Enough]], x (PP)</ref>\n*Addison is the first and last character to be seen on ''Private Practice''. The first scene of the show is her talking to Richard about her resignation, and the last scene of the show is the group talking in the kitchen in the practice, with her face being the last one to be seen from inside the elevator before its doors close completely.\n*In one college semester, she took classes in organic chemistry, physics II, multivariable calculus, conversational French, introduction to the modern European novel, and tennis. She later had to retake tennis due to getting an incomplete.\n*She's one of only eight people in the world who can perform [[Obstetrics and Gynecology|OB/GYN]], [[Maternal-Fetal Medicine|perinatology]], and [[Neonatal Surgery|neonatal surgery]] on a world-class level.\n*She loves bacon cheeseburgers.\n*She has a cat named [[Milo (Cat)|Milo]], formerly owned by her patient [[Lillie Jordan]].\n*She wore a sea turtle scrub cap for her first solo surgery.\n*She used to have a pet hermit crab, but the air filter was noisy so she shut it off, and it died.<ref>[[Slip Slidin' Away]], x (PP)</ref>\n*Her fortune is about  million dollars.\n*She has a thing for Russell Crowe.<ref>[[Raindrops Keep Falling On My Head]], x</ref>\n*She is not a fan of bread.<ref>[[With a Little Help From My Friends]], x</ref>\n\n\n<gallery position=\"center\" spacing=\"small\" widths=\"\" orientation=\"landscape\" bordersize=\"none\" hideaddbutton=\"true\">\nAddisonMontgomery.png\nPPAddisonMontgomery.png\nPPxAddisonMontgomery.png\nPPxAddisonMontgomery.png\n</gallery>\n\n{{GalleryLink}}\n\n\nThese episodes are Addison-centric or otherwise very informative about her life.\n*[[Raindrops Keep Falling On My Head]]\n*[[Owner of a Lonely Heart]]\n*[[Time Has Come Today]]\n*[[The Other Side of This Life, Part ]]\n*[[The Other Side of This Life, Part ]]\n*[[In Which We Meet Addison, a Nice Girl From Somewhere Else]]\n*[[In Which Addison Finds the Magic]]\n*[[In Which Addison Has a Very Casual Get Together]]\n*[[In Which Addison Finds a Showerhead]]\n*[[Before and After]]\n*[[Ex-Life]]\n*[[The Hard Part]]\n*[[Home Again]]\n*[[Apron Strings]]\n*[[In Which We Say Goodbye]]\n*[[Hotter Than Hell]]\n*[[With a Little Help From My Friends]]\n\n\n:'''Addison (to [[Jake Reilly|Jake]]):''' I love you. And you're the last man I want to say that to. Let's get married.<ref>[[Apron Strings]], x</ref>\n\n----\n:'''Addison:''' Dr. Karev, I may be a board-certified OB/GYN, but I also have fellowships in maternal-fetal medicine and medical genetics, and I am one of the foremost neonatal surgeons in this country. When you can top that, you can mouth off. Until then, you will do your job and you will do it right, which at this point in time, means you keep your mouth shut unless I give you permission to open it. Understood?\n----\n:'''Addison:''' Hi, I'm Addison Shepherd.\n:'''[[Meredith Grey|Meredith]]:''' Shepherd?\n:'''Addison:''' And you must be the woman who's been screwing my husband.<ref>[[Who's Zoomin' Who?]], x</ref>\n----\n:'''Addison (to [[Derek Shepherd|Derek]]):''' There is a land called Passive Aggressiva and I am their queen.<ref>[[Begin the Begin]], x</ref>\n----\n:'''[[Cooper Freedman|Cooper]]:''' We're a team.\n:'''[[Violet Turner|Violet]]:''' We're partners, Naomi.\n:'''[[Sam Bennett|Sam]]:''' You can't just bring somebody in.\n:'''[[Pete Wilder|Pete]]:''' Without asking us.\n:'''[[Violet Turner|Violet]]:''' Yeah.\n:'''[[Sam Bennett|Sam]]:''' We're a democracy. We vote.\n:'''[[Pete Wilder|Pete]]:''' We vote.\n:'''[[Violet Turner|Violet]]:''' We vote or it doesn't happen.\n:'''[[Naomi Bennett|Naomi]]:''' You're right. We should've voted. I was wrong.\n:'''[[Violet Turner|Violet]]:''' Good. Okay, let's vote.\n:'''Addison:''' Whoa, whoa, whoa, whoa. Hold on a minute. Uh, I have been working here less than  hours, and in that time I discovered that I not welcome here, I learned I am a one-man gynie show, and I performed crazy McGyver surgery, and...Sam saw my booty. So...this has not been a great day for me. This day kind of sucked. But you know what I had one patient...one patient the entire day...and I loved it. So you want me gone? Too bad. I'm in. I'm putting my foot down. My foot's down. It's down. I'm not going anywhere. So...yeah. I thought I...I thought I had a big finish but...I don't. So...I'm done. No, no. I do have a big finish. If I hadn't been here today, if you'd had someone else, that girl would've died delivering her baby. I saved her life. I saved your asses. I'm a world-class neonatal surgeon. And I'm here to stay. Welcome to the new Oceanside Wellness. ''(Addison leaves)''\n:'''[[Naomi Bennett|Naomi]]:''' That's why I didn't tell you she was coming.<ref>[[In Which We Meet Addison, a Nice Girl From Somewhere Else]], x (PP)</ref>\n----\n:'''Addison:''' So, who's the new mystery woman that Derek's dating? Who is the unlucky McRebound? ''(laughs, while nobody answers)'' What? Is the whole Mc-thing over now? I'm sure things haven't changed that much around here.\n:'''[[Miranda Bailey|Bailey]]:''' Addison, the woman standing immediately to your right, the one handing you the surgical instruments.<ref>[[Piece of My Heart]], x</ref>\n----\n:'''Addison:''' I just need to say it once.\n:'''[[Mark Sloan|Mark]]:''' Go ahead.\n:'''Addison:''' Grandpa. ''(laughs)'' Grandpa, grandpa, grandpa.\n:'''[[Mark Sloan|Mark]]:''' Oh, okay. That was four times.<ref>[[Blink]], x</ref>\n\n\n{{Addison Forbes Montgomery Appearances}}\n{{Scrollbox}}\n\n[[de:Addison Forbes Montgomery]]\n[[fr:Addison Montgomery]]\n[[es:Addison Forbes Montgomery]]\n[[it:Addison Forbes Montgomery]]\n\n{{DEFAULTSORT:Montgomery, Addison Forbes}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Doctors]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (REI)]]\n[[Category:Patients (CAM)]]\n[[Category:Patients (Clinic)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Susan Grant", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPx-.jpg\n|name = Susan Grant\n|status = Deceased\n|marital = [[Bizzy Forbes]] \u\ua''(wife)''\n|other family = *[[Addison Forbes Montgomery]] ''(stepdaughter)''\n*[[Archer Montgomery]] ''(stepson)''\n*[[Henry Montgomery]] ''(step-grandson)''\n|first appearance = [[Blowups]]\n|last appearance = [[Blind Love]]\n|count = \n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]] and [[Season  (Private Practice)|]]\n|portrayed by = [[Ann Cusack]]\n}}\n'''Susan Grant''' was the assistant and secret lover of [[Bizzy Forbes]] for twenty years.\n\n\n\nSusan came along with Bizzy when she was summoned to Los Angeles to talk to Addison. Addison was shocked to find Susan kissing Bizzy and even more shocked to learn they'd been together for  years. ''(\"[[Blowups]]\")''\n\n\nBizzy called Addison in the middle of the night when Susan became sick. They then flew to Los Angeles to get Addison's help. ''(\"[[Just Lose It]]\")''\n\nSusan had stage IV ovarian cancer. Addison ran tests and then had to deliver the news that the cancer had spread and there was nothing she could do. Bizzy slapped Addison and commanded Addison to save Susan's life. Addison called in [[Eric Rodriguez]] and asked for his professional advice. He agreed that there was nothing there could do, but agreed to do some research and consult with colleagues. He suggested that Addison scope her. When Addison did the scope, she saw that the tumor had spread to her liver. She suggested not doing anything, but Bizzy kept pushing, so Addison suggested using the [[Da Vinci Surgical System]] to get angles she couldn't get with her own hands. Susan agreed to try it for Bizzy. Addison brought Eric in on the surgery to use hot chemo to kill the cancer cells left behind. They were able to remove the cancer and place her port for chemo. ''(\"[[If You Don't Know Me By Now]]\")''\n\nAfter her surgery, Susan was doing well and was discharged from the hospital. ''(\"[[Heaven Can Wait]]\")''\n\n\nBizzy, wanting to give Susan the wedding she wanted, had Addison plan an elaborate ceremony. When Addison went to check to see if Susan was dressed for the wedding, she discovered that Susan wasn't better. She knew that her cancer had come back and had chosen to be discharged anyway because she wanted her wedding. She said she'd signed a DNR and didn't want Addison to tell Bizzy. After the wedding, Susan collapsed. ''(\"[[Heaven Can Wait]]\")''\n\n\nSusan was rushed to the hospital, where they rushed to try to save her life. She was in septic shock. They were able to stabilize her and started antibiotics. She had an infection because the chemo had destroyed her immune system. Susan then developed a clot in her lungs, but because of her DNR, Addison was unable to do anything about it. Shortly after Bizzy arrived back at the hospital, Susan died. ''(\"[[Blind Love]]\")''\n\n\n\n[[File:PPx-.jpg|thumb|left|Bizzy and Susan at their wedding.]]\n[[Bizzy Forbes]]\nShe had a  year secret relationship with Bizzy.\n\nWhen Bizzy and Susan returned to Los Angeles, after Susan had surgery, Bizzy told Addison that she had divorced The Captain and was marrying Susan. ''(\"[[If You Don't Know Me By Now]]\")''\n\nAddison planned an elaborate wedding and the two married. ''(\"[[Heaven Can Wait]]\")''\n\nWhen Susan died, Bizzy killed herself. ''(\"[[Blind Love]]\")''\n\n\n*She is close in age to Addison.<ref>[[Blowups]], x (PP)</ref>\n\n\n\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPPSusanGrant.png|[[Blowups]]\nPPxSusanGrant.png|[[Just Lose It]]\nPPxSusanGrant.png|[[If You Don't Know Me By Now]]\nPPxSusanGrant.png|[[Heaven Can Wait]]\nPPxSusanGrant.png|[[Blind Love]]\n</gallery>\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPPx-.JPG\nPPx-.JPG\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\n</gallery>\n\n\n{{Susan Grant Appearances}}\n\n{{Scrollbox}}\n\n{{DEFAULTSORT:Grant, Susan}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Deceased Characters]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (Oncology)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "\"The Captain\" Montgomery", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPx-.jpg\n|name = \"The Captain\" Montgomery\n|status = Alive\n|title = M.D.\n|marital = [[Bizzy Forbes]] \u ''(ex-wife)''\n|children = *[[Addison Forbes Montgomery]]\n*[[Archer Montgomery]]\n|grandchildren = [[Henry Montgomery]]\n|other family = [[Jake Reilly]] ''(son-in-law)''\n|job = *Doctor\n*Lecturer\n|first appearance = [[Sins of the Father]]\n|last appearance = [[Home Again]]\n|count = \n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]] and [[Season  (Private Practice)|]] \n|portrayed by = [[Stephen Collins]]\n}}\n\n'''\"The Captain\" Montgomery''' is [[Addison Forbes Montgomery]] and [[Archer Montgomery|Archer Montgomery's]] father.\n\n\n\n\"The Captain\" married Bizzy Bradford Forbes when they were younger. Together they had Addison Forbes Montgomery and Archer Forbes Montgomery. For many years, Addison and Archer believed that their father cheated on their mother with many women, but eventually they found out she was a lesbian and had been seeing [[Susan Grant]] for many years while married to \"The Captain,\" who was in love with her.\n\n\nHe showed up suddenly in Los Angeles to visit Addison, who didn't want to see him. They'd had a fight the last time they were together and she said she didn't want to see him anymore. Despite this, they went to lunch. Addison later went to his hotel room and said that he wasn't her family. Her family was the other doctors in the practice. ''(\"[[Sins of the Father]]\")''\n\nHe and Addison had lunch together several times, though each was awkward until they started talking about a case she was working on. Addison later admitted to Naomi that most of their relationship was him lecturing her and her pretending not to already know what he was telling her. After talking to Violet about improving their relationship, he went to her and asked if he could watch her perform the surgery they'd talked about. She said it was okay and after watching her operating, he said her work was elegant. She then offered to let him come to her house, something she'd previously not allowed. After learning that he'd slept with Violet, who said he was gentleman, she confronted him, wondering why he could be a gentleman to other women, but not to her or Bizzy. After she left, he called Bizzy and told her to come tell the truth or he would do it himself. ''(\"[[The Parent Trap]]\")''\n\nBizzy came as requested\uaand brought her assistant, [[Susan Grant]]. After seeing the tension between Susan and The Captain, Addison believed The Captain had slept with her, but later she\uawalked in on Susan kissing Bizzy. The Captain said he was okay with the relationship꯬ause it's what they had chosen. Sam approached\uaThe Captain and Bizzy and told them to leave because he saw what having them there\uawas doing to Addison. As they left, Addison went to the airport to see them off and talk to Bizzy. ''(\"[[Blowups]]\")''\n\n\nAfter Bizzy died, she was brought back to Connecticut to be buried. After her memorial service, The Captain confessed to Pete that he believed Bizzy would come back to him after Susan died and they'd live out the rest of their lives together. ''(\"[[Home Again]]\")''\n\n\n\n[[Bizzy Forbes]]\nHe had two children with [[Bizzy Forbes|Bizzy Bradford Forbes]], but had many affairs. He was in love with her, but she was in love with [[Susan Grant]].\n\n[[Violet Turner]]\nHe slept with [[Violet Turner]] while visiting his daughter. She said they should do it more often and he said they could any time, but when he started to kiss her again, she became self-conscious about her scar, though he assured that it would fade and that it was a reminder that she survived and she deserved to do whatever she wanted for a while. ''(\"[[The Parent Trap]]\")''\n\nOther Women\nThe Captain had many affairs, some of them being three of their maids; four of Addison's nannies; Jolie, Addison's French tutor; and the chef, Louise. ''(\"[[Sins of the Father]]\")''\n\n\nHe is a doctor and lecturer.\n\n\n\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPPTheCaptainMontgomery.png|[[Sins of the Father]]\nPPTheCaptainMontgomery.png|[[The Parent Trap]]\nPPTheCaptainMontgomery.png|[[Blowups]]\nPPxTheCaptainMontgomery.png|[[Home Again]]\n</gallery>\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\n</gallery>\n\n\n{{\"The Captain\" Appearances}}\n\n{{DEFAULTSORT:Montgomery, \"The Captain\"}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Doctors]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Bizzy Forbes", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPx-.jpg\n|name = Beatrice Bradford Forbes\n|born = ; [[Connecticut]]\n|died = ; [[Los Angeles]], California\n|status = Deceased\n|marital = *[[\"The Captain\" Montgomery]] ''(ex-husband)''\n*[[Susan Grant]] \u ''(wife)''\n|children = *[[Addison Forbes Montgomery]]\n*[[Archer Montgomery]]\n|parents = Father \u\n|grandchildren = [[Henry Montgomery]]\n|other family = [[Jake Reilly]] ''(son-in-law)''\n|first appearance = [[Blowups]]\n|last appearance = [[Home Again]]\n|count = \n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]] and [[Season  (Private Practice)|]]\n|portrayed by = [[JoBeth Williams]]\n}}\n\n'''Bizzy Forbes''' was the eccentric mother of [[Addison Forbes Montgomery|Addison]] and [[Archer Montgomery]].\n\n\n\nAfter The Captain called her to come tell Addison the truth, she flew to Los Angeles. When Susan came there after her, Addison believed that the Captain was having an affair with Susan. However, Addison was shocked when she walked in on Bizzy and Susan kissing. Believing that The Captain pushed Bizzy to do it, Addison talked to Bizzy about facing it, but Bizzy corrected her that she and Susan had been together for  years. Bizzy said that Susan was the one thing she did for\uaherself among all the things she did for her children. Seeing how upset having her parents there made Addison, Sam came to her house and told them to leave. They did so, but Addison came to the airport to see them off and talk\uato Bizzy, though they only talked about\uathe bad\uaservice she'd received on the flight to Los Angeles. ''(\"[[Blowups]]\")''\n\n\nBizzy called Addison in the middle of the night when Susan became sick. They then flew to Los Angeles to get Addison's help. ''(\"[[Just Lose It]]\")''\n\nSusan had stage IV ovarian cancer. Addison ran tests and then had to deliver the news that the cancer had spread and there was nothing she could do. Bizzy slapped Addison and commanded Addison to save Susan's life. Addison called in [[Eric Rodriguez]] and asked for his professional advice. He agreed that there was nothing there could do, but agreed to do some research and consult with colleagues. He suggested that Addison scope her. When Addison did the scope, she saw that the tumor had spread to her liver. She suggested not doing anything, but Bizzy kept pushing, so Addison suggested using the [[Da Vinci Surgical System]] to get angles she couldn't get with her own hands. Susan agreed to try it for Bizzy. Addison brought Eric in on the surgery to use hot chemo to kill the cancer cells left behind. They were able to remove the cancer and place her port for chemo. ''(\"[[If You Don't Know Me By Now]]\")''\n\n\nBizzy, wanting to give Susan the wedding she wanted, had Addison plan an elaborate ceremony. When Addison went to check to see if Susan was dressed for the wedding, she discovered that Susan wasn't better. She knew that her cancer had come back and had chosen to be discharged anyway because she wanted her wedding. She said she'd signed a DNR and didn't want Addison to tell Bizzy. After the wedding, Susan collapsed. ''(\"[[Heaven Can Wait]]\")''\n\n\nSusan was stabilized in the ER, but she was in septic shock. They started antibiotics, but Susan developed a clot in her lung and because of her DNR, Addison was unable to do anything. Shortly after Bizzy returned to her bedside, Susan died. Bizzy worried about what she'd do next and Addison said she'd help her figure it out. However, when Addison came to see Bizzy, she found that she had killed herself. ''(\"[[Blind Love]]\")''\n\n\nBizzy requested that Addison give the eulogy at her funeral. Addison hid from everyone that Bizzy had committed suicide. Despite wanting to tell everyone her mother's true colors, Addison gave a glowing eulogy, talking about Bizzy's charity work and personal accomplishments. Before she was interred, Addison placed the urn with Susan's ashes in Bizzy's coffin. ''(\"[[Home Again]]\")''\n\n\n\nShe had a thing with another girl at summer camp when she was . ''(\"[[Blowups]]\")''\n\n[[\"The Captain\" Montgomery]]\nShe married The Captain, but even though she loved him, she was not \"in love\" with him. They stayed together because of their children, Archer and Addison. The marriage wasn't an easy one. The Captain knew that Bizzy's interest was not in him and therefore had many affairs to fill the void. \ua\n[[Susan Grant]]\n[[File:PPx-.jpg|thumb|Bizzy and Susan at their wedding.]]She had a  year secret relationship with her assistant, Susan.\n\nWhen Bizzy and Susan returned to Los Angeles, after Susan had surgery, Bizzy told Addison that she had divorced The Captain and was marrying Susan. ''(\"[[If You Don't Know Me By Now]]\")''\n\nAddison planned an elaborate wedding and the two of them married. ''(\"[[Heaven Can Wait]]\")''\n\nSusan died and Bizzy killed herself. ''(\"[[Blind Love]]\")''\n\n\nBizzy's relationship with her children wasn't an easy one. She wasn't a loving mother, but instead was very demanding of them.\n\nWhen Addison was able to treat Susan after working hard to come up with a solution, she was disappointed when Bizzy didn't even thank her. ''(\"[[If You Don't Know Me By Now]]\")''\n\nAt Bizzy and Susan's reception, Bizzy thanked Addison for planning it and said she'd done a beautiful job. ''(\"[[Heaven Can Wait]]\")''\n\nAfter Susan died, Bizzy blamed Addison for not doing enough to save her. While Bizzy packed up her things, Addison came and told her she loves her and was there for her as she figured out what was next. They made plans for the next day, but when Addison came by to get Bizzy, she found that she had killed herself. ''(\"[[Blind Love]]\")''\n\n\n*Bizzy refused to be called ''mom''.<ref>[[Tempting Faith]], x (PP)</ref>\n*She was  at the time of her death.<ref>[[Home Again]], x (PP)</ref>\n*In lieu of flowers, she asked for donations to the City Ballet or the garden club in her name.<ref>[[Home Again]], x (PP)</ref>\n*At her funeral <ref>[[Home Again]], x (PP)</ref> it's revealed that her first name is Beatrice\n\n\n\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPPBizzyForbes.png|[[Blowups]]\nPPxBizzyMontgomery.png|[[Just Lose It]]\nPPxBizzyForbesMontgomery.png|[[If You Don't Know Me By Now]]\nPPxBizzyForbesMontgomery.png|[[Heaven Can Wait]]\nPPxBizzyForbes.png|[[Blind Love]]\nPPxBizzyForbes.png|[[Home Again]]\n</gallery>\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPPx-.jpg\nPPx-.JPG\nPPx-.JPG\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\n</gallery>\n\n\n{{Bizzy Forbes Appearances}}\n{{Scrollbox}}\n\n{{DEFAULTSORT:Forbes, Bizzy}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Deceased Characters]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Henry Montgomery", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|name = Henry Montgomery\n|image = PPxHenryMontgomery.jpg\n|status = Alive\n|siblings = [[Angela Reilly]] ''(half-sister)''\n|parents = *[[Addison Forbes Montgomery]]\n*[[Jake Reilly]]\n|grandparents = *[[Bizzy Forbes]] \u\n*[[\"The Captain\" Montgomery]]\n*Grandmother \u\n*Grandfather\n|other family = *[[Amelia Shepherd]] ''(godmother)''\n*[[Archer Montgomery]] ''(uncle)''\n*Three aunts\n|first appearance = [[It Was Inevitable]]\n|last appearance = [[Full Release]]\n|count = \n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]] and [[Season  (Private Practice)|]]\n|portrayed by = *Harlow Danger Contreras\n*Karma Kerr\n}}'''Henry Montgomery''' is the son of [[Addison Forbes Montgomery]] and [[Jake Reilly]].\n\n\n\nHenry was born to his biological mother [[Judi]], who was a patient of Addison's and thought that she would be a perfect mother for her son. He was delivered by Addison herself only to be adopted by her just several hours later. ''(\"[[It Was Inevitable]]\")''\n\n\nWhen Henry was eight months old, Judi expressed desire to see Henry for the first time. She talked to Addison about him and visited. She visited him first at Addison's home and then the next day at the park. Addison was uncomfortable by the visits, but after talking to [[Vivian Carlsmith]] about her own experience giving up a child for adoption, she went to Judi and said Judi would always be welcome in Henry's home. ''(\"[[Apron Strings]]\")''\n\n\nAddison went to court and finalized Henry's adoption, despite a snafu when [[Mildred Clemons]] expressed concern about Jake's violent past. ''(\"[[Full Release]]\")''\n\n\n\nWhen he was still very young, Addison wondered about his life and how much of the person he'd become was already written into his DNA. Despite this, she told her therapist that she believed nurture trumped nature because Henry looked at her with love and knew she was his mom and no gene told him to do that. ''(\"[[True Colors (Private Practice)|True Colors]]\")''\n\n\n*[[Sam Bennett]] often takes care of him.\n*His godmother is [[Amelia Shepherd]], who was there when Henry was born.\n*Addison fed him donated breast milk from the milk bank.<ref>[[And Then There Was One]], x (PP)</ref>\n*When he was eight months old, he liked Tigger, mashed carrots, and all things orange.<ref>[[Apron Strings]], x (PP)</ref>\n*He's into drawing, spilling, and smearing and completely destroyed Addison's white walls and carpets.<ref>[[Bend & Break]], x (GA)</ref>\n*During her visit to Grey Sloan to perform a uterine transplant, Addison mentions that he is  years old.<ref>[[Hotter Than Hell]], x (GA)</ref>\n*He is a gamer and a fan of Game of Thrones.<ref>[[With a Little Help From My Friends|With A Little Help From My Friends]], x</ref>\n\n\n\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPPxHenryMontgomery.png|[[It Was Inevitable]]\nPPxHenryMontgomery.png|[[And Then There Was One]]\nPPxHenryMontgomery.png|[[True Colors (Private Practice)|True Colors]]\nPPxHenryMontgomery.png|[[Drifting Back]]\nPPxHenryMontgomery.png|[[Gone, Baby, Gone]]\nPPxHenryMontgomery.png|[[Aftershock]]\nPPxHenryMontgomery.png|[[Mourning Sickness]]\nPPxHenryMontgomery.png|[[Good Grief]]\nPPxHenryMontgomery.png|[[Apron Strings]]\nPPxHenryMontgomery.jpg|[[The World According to Jake]]\nPPxHenryMontgomery.png|[[Full Release]]\n</gallery>\n\n\n<gallery orientation=\"landscape\" position=\"center\" bordersize=\"none\" hideaddbutton=\"true\" spacing=\"small\">\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\n</gallery>\n\n\n{{Henry Montgomery Appearances}}\n\n[[de:Henry Montgomery]]\n\n{{Scrollbox}}\n\n{{DEFAULTSORT:Montgomery, Henry}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Archer Montgomery", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = PPx-.jpg\n|name = Archer Forbes Montgomery\n|alias = Archie\n|status = Alive\n|title = M.D.\n|parents = *[[Bizzy Forbes]] \u\n*[[\"The Captain\" Montgomery]]\n|siblings = [[Addison Forbes Montgomery]]\n|grandparents = Grandfather\n|other family = *[[Jake Reilly]] ''(brother-in-law)''\n*[[Henry Montgomery]] ''(nephew)''\n*[[Susan Grant]] \u ''(stepmother)''\n|job = *[[Attending]] [[Neurology|Neurologist]]\n*Author\n|workplace = '''Former'''<br>\n[[Pacific Wellcare Center]]\n|first appearance = '''[[Private Practice|PP]]:''' [[Tempting Faith]]\n|last appearance = '''[[Private Practice|PP]]:''' [[Home Again]]\n|only appearance = '''[[Grey's Anatomy|GA]]:''' [[Before and After]]\n|count = \n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]]\n*'''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]] and [[Season  (Private Practice)|]]\n|portrayed by = [[Grant Show]]\n}}\n\n'''Archer Forbes Montgomery''' is the brother of [[Addison Forbes Montgomery|Addison Montgomery]]. He is a famous neurologist and author.\n\n\n\nArcher was born in [[Connecticut]] into a wealthy background along with his younger sister, [[Addison Forbes Montgomery|Addie]], and mother, [[Bizzy Forbes]].\n\nWhen Addison was seven, she fell off her bike in the vineyard while going downhill because her tire came off. She flipped over the handlebars and scraped her face, but Archer picked her up, told her it was going to be okay, and carried her the half mile back home. This is how Addison has always seen her brother, as the big brother who carried her home. ''(\"[[Acceptance]]\")''\n\n\nArcher came to Los Angeles without telling his sister he was coming. She discovered him on her kitchen floor, having sex. He told her he was there for a winter launch party for his publisher. After the party, he took Naomi home and had sex with her, upsetting his sister and Sam, who punched Archer when he found out. During the party, Archer told [[Kevin Nelson|Kevin]], Addison's boyfriend, that he wasn't good enough for her, causing him to doubt their relationship. Addison confronted Archer on that and told him he needed to leave. ''(\"[[Tempting Faith]]\")''\n\n\nArcher returned to Los Angeles when he was hired to replace [[Wyatt Lockhart]] at [[Pacific Wellcare Center]]. ''(\"[[Nothing to Fear]]\")''\n\nHis first case in Los Angeles was [[Jane Williams]], a pregnant woman who had had a stroke. He and Addison disagreed about her treatment but ultimately worked together to save her life and her baby. After the case was finished, Addison said that she was glad he was there, but he needed to stay out of her personal life. ''(\"[[Second Chances]]\")''\n\n\nAfter Archer had a tonic-clonic seizure after having sex with Naomi, she took him to the hospital. He insisted that he was okay and left the hospital against medical advice after telling Naomi not to tell Addison. When Naomi pushed, he admitted he had an inoperable glioma in his brain. Naomi cracked and told Addison, who got Archer's scans. While he was looking at his scans, they noticed upward-gaze palsy, which wasn't consistent with his diagnosis, so they got another CT scan. When they saw multiple lesions, Archer diagnosed himself with neurocysticercosis. Addison wanted to call Derek to see if he could remove them. Archer wanted to try antiparasitics instead. Addison pleaded with him, saying she wanted to fix it because she didn't want to lose him. When he had another seizure, he was admitted to the hospital and given a paralyzing agent in an attempt to stop the seizures. When that didn't work, the neurologist wanted to induce a coma. Once Archer was in the coma, Addison called Derek to see if he could help. ''(\"[[Acceptance]]\")''\n\nArcher was brought to Seattle for Derek to operate on him. He had to be stabilized in the ER before being taken to CT, which revealed that the single cyst from his previous CT had multiplied and he now had eight. They were clogging the left ventricle. Derek said surgery wasn't an option and Archer was going to die. He consulted with two other surgeons who agreed that it was inoperable. However, Addison encouraged him to try harder and Sam suggested that he think about it as if there were only one and work on a plan to extract them one at a time. Archer didn't believe Derek could do it and didn't want to have the surgery, but Derek goaded him into agreeing to the surgery by calling him a coward. He removed the first seven cysts easily, but the eighth cyst ruptured in his brain and released the worm into his brain. Archer's heart stopped, but Derek insisted on finding the worm before starting compressions. He found the worm and Archer stabilized. He was stable in his room after surgery. ''(\"[[Before and After]]\")''\n\nArcher woke up after his surgery. Because his speech was still slurred and his vision was blurry, he was convinced that Derek missed something and demanded that he run a CT. Derek denied his request, saying his exam was normal. However, Archer went around him and the CT showed what looked like persistent cysts. He believed he was going to die, so he confessed to several embarrassing things. When Derek saw the CT, he came into Archer's room and explained the sacs had filled with fluid and would clear in a month. ''(\"[[Ex-Life]]\")''\n\n\nAfter Addison told Naomi that Archer was cheating on her, he decided to go back to New York. He left without saying anything to Naomi about it. ''(\"[[Wait and See]]\")''\n\n\nAfter Bizzy killed herself, the family gathered in Connecticut for a public memorial service and a private internment. The night before the memorial, Archer slept with Naomi. After the memorial, he got drunk. And at the internment, he cried. ''(\"[[Home Again]]\")''\n\n\n\nOn arrival in LA, Addison walked in on Archer having sex with a woman in her kitchen. ''(\"[[Tempting Faith]]\")''\n\n[[Naomi Bennett]]\nAfter his publisher's launch party, Archer took Naomi home and they had sex. ''(\"[[Tempting Faith]]\")''\n\nWhen he was hired by Pacific Wellcare and returned, they resumed their sexual relationship. ''(\"[[Nothing to Fear]]\")''\n\nNaomi enjoyed the sex, but she was upset to learn that Archer had a date with another woman. He said that he was the good-time guy and wasn't going to be her boyfriend. However, he showed up at her house instead of going on his date, saying he'd rather be with her. ''(\"[[Second Chances]]\")''\n\nWhen he believed he was dying, he lamented not being able to be a better man for her. ''(\"[[Ex-Life]]\")''\n\nShortly after his recovery, Addison caught him with another woman while Naomi believed they were monogamous. Not long after that, she caught him after sleeping with [[Charlotte King]]. She told Naomi that he was cheating and Naomi went to his office to find that he had left. ''(\"[[Wait and See]]\")''\n\nWhen Naomi came to Connecticut for Bizzy's funeral, she and Archer slept together. ''(\"[[Home Again]]\")''\n\n[[Charlotte King]]\nHe had sex once with [[Charlotte King]]. ''(\"[[Wait and See]]\")''\n\n\nHe is very close with his sister, Addison.\n\n\nArcher was part of Addison and Derek's group of friends but he always disliked Derek even before the divorce, with Derek referring to him as \"an ass\". ''(\"[[Before and After]]\")''\n\n\nHe is a world class neurologist and a famous author, writing up interesting medical cases he has had. ''(\"[[Tempting Faith]]\")''\n\n\n*He slept with Amy Garrison, Mark's sophomore year girlfriend.<ref>[[Ex-Life]], x (PP)</ref>\n*He once wrecked Sam's car and let someone else take the blame.<ref>[[Ex-Life]], x (PP)</ref>\n*He and Addison are both terrible sailors, to The Captain's disappointment.<ref>[[Losing Battles]], x (PP)</ref>\n\n\n\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPPArcherMontgomery.png|[[Tempting Faith]]\nPPArcherMontgomery.png|[[Nothing to Fear]]\nPPArcherMontgomery.png|[[Second Chances]]\nPPArcherMontgomery.png|[[Acceptance]]\nArcherMontgomery.png|[[Before and After]]\nPPArcherMontgomery.png|[[Ex-Life]]\nPPArcherMontgomery.png|[[Wait and See]]\nPPxArcherMontgomery.png|[[Home Again]]\n</gallery>\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\n</gallery>\n\n\n{{Archer Montgomery Appearances}}\n\n[[de:Archer Montgomery]]\n\n{{Scrollbox}}\n\n{{DEFAULTSORT:Montgomery, Archer}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters|Archer Montgomery]]\n[[Category:Doctors]]\n[[Category:Patients]]\n[[Category:Patients (Neuro)]]"}]}}}}