{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Maya Bennett", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPx-.jpg\n|name = Maya Bennett\n|status = Alive\n|alias = May\n|parents = *[[Sam Bennett]]\n*[[Naomi Bennett]]\n|children = [[Olivia Davis]]\n|grandparents = *[[Dee Bennett]]\n*[[Raymond McCray]]\n*Grandmother\n|marital = [[Fillmore Davis]] ''(husband)''\n|siblings = [[Betsey Parker]]\n|other family = *[[Addison Forbes Montgomery]] ''(godmother)''\n*[[Corinne Davis]] ''(mother-in-law)''\n*[[Corinne Bennett]] ''(aunt)''\n|only appearance = '''[[Grey's Anatomy|GA]]:''' [[The Other Side of This Life, Part ]]\n|first appearance = '''[[Private Practice|PP]]:''' [[In Which Addison Finds the Magic]]\n|last appearance = '''[[Private Practice|PP]]:''' [[The End of a Beautiful Friendship]]\n|count = \n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]] \n*'''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], and [[Season  (Private Practice)|]]\n|portrayed by = *[[Shavon Kirksey]] ''([[Grey's Anatomy|GA]])''\n*[[Geffri Maya]] ''([[Private Practice|PP]])''\n}}\n\n'''Maya Bennett''' is the daughter of [[Sam Bennett|Sam]] and [[Naomi Bennett]], and the mother of [[Olivia Davis]].\n\n\n\nAlthough her parents divorced, the divorce didn't upset Maya much and Naomi thought that she probably enjoyed having extra everything for when she was living at Naomi's and living at Sam's.\n\n\nWhen Addison visited LA to look into having a baby and get away from [[Seattle]], Maya was happy to see her. ''(\"[[The Other Side of This Life, Part ]]\")''\n\n\nMaya decided at one point that she wanted to stay at her dad's place for a whole week. Her mother was worried about it, but allowed it after reminding Sam to check her homework. ''(\"[[In Which Addison Finds the Magic]]\")''\n\n\nMaya came to Addison with her friend [[Ruby]] and said she worried about having gonorrhea. Addison did an exam and ran some tests and they were negative. However, Maya later called Addison to her house because Ruby had collapsed. She had a late-stage ectopic pregnancy and had to be rushed into surgery. Once she was taken away, Maya called her mother. Naomi was shocked to hear that Ruby was having sex and wasn't consoled by Maya telling her she wasn't having sex. ''(\"[[In Which Addison Finds a Showerhead]]\")''\n\n\nOne morning, Maya found her parents in bed together and asked if that meant they were getting back together. After dodging her questions, Naomi eventually told her that they weren't getting back together. ''(\"[[Let It Go]]\")''\n\n\nMaya was at the practice late with Sam, who had forgotten his wallet. He told her to wait for a minute. During that time, [[Hal Jarvis]], a pedophile who was seeing Violet after hours, sat down to talk to her. When the other adults saw, Violet pushed Hal out the door and they asked Maya what he had said to her. She said he hadn't done or said anything. ''(\"[[Tempting Faith]]\")''\n\n\nWhen her father started dating [[Sonya Nichols]], Maya met her and liked her. She even said that Naomi would like her if she got to know her. ''(\"[[Homeward Bound]]\")''\n\n\nNaomi caught Maya wearing makeup and less modest clothes to go to school and sent her back upstairs to change. That day, she came home, shocked to find that Maya had her boyfriend, [[Fillmore Davis|Dink]], over. Sam took her to live at his house and started picking Maya up from school and said that he'd start treating her like she knew right from wrong so long as she told him where she was going and with whom. When he came home to find her throwing a party, he sent everyone home. He then dropped Maya back off at Naomi's and told her to go apologize to her mother and mean it. ''(\"[[The Parent Trap]]\")''\n\n\nAfter ignoring her mother for weeks, Naomi talked to Maya, saying that she should talk to someone about what was going on, even if she couldn't talk to her own mother. Maya then went to Addison and confessed that she was pregnant. ''(\"[[Another Second Chance]]\")''\n\nWhen Maya was unable to tell them, Addison told Sam and Naomi that Maya was pregnant. Sam wondered how it could have happened while Naomi just left the room, unable to deal with it. Naomi later returned and dragged Maya into Addison's office to ask for an abortion. When Maya said she didn't want one, Naomi slapped her. Addison said that she couldn't force Maya to have an abortion. After seeing [[Lynn McDonald]] in labor, Maya agreed to have an abortion. However, when Addison took Maya in for the procedure, she said she didn't understand. Addison said she could ask whatever she wanted. Maya said she didn't understand why Naomi would do this when she believes abortion is murder. Maya then decided she didn't want the abortion. When she told Naomi about it, Naomi dragged her to see Lynn give birth and asked if she wanted that. Lynn's baby was then born and Maya was awed by seeing that. ''(\"[[Best Laid Plans]]\")''\n\nMaya had her first ultrasound with Dink there. They both thought it was pretty cool. ''(\"[[Shotgun]]\")''\n\n\nShortly before her wedding, Maya went to her mother and asked her personally to come to the wedding, saying she needed her. Naomi refused, saying her wedding was a public reminder of how Naomi had failed her. Sam came to the wedding and said that while he was a little worried, he loved her and supported her. Naomi then showed up, giving her her old, new, borrowed, and blue items. ''(\"[['Til Death Do Us Part]]\")''\n\n\nMaya came into the practice three weeks before her due date for an ultrasound. Later that day, Maya went into labor and when Dell arrived, she told him she wanted to go to the hospital. He put her in his car and started to drive her there, but on the way, they were in a head-on collision with a drunk driver. They had to be airlifted to the hospital. ''(\"[[In the Name of Love]]\")''\n\nIn the ER, Maya was examined. She said that her contractions had been bad, but she wasn't able to feel them anymore, alerting them that she had some spinal damage. They took her into surgery to deliver the baby, but as soon as Addison moved her uterus, she started to bleed out because her uterus was holding pressure on a bleeder. They packed the wound and waited for Amelia to arrive to check out her spinal damage. Amelia looked at Maya's scans and saw a fracture at L- and a bone fragment at L-. The baby had stabilized the area, but trying to deliver had de-stabilized it. Amelia said that if they delivered the baby, she'd be paralyzed. If she repaired the spine, the baby could die. Gabriel suggested hypothermia to give them more time to fix the damage, possibly buying them enough time to save both of them. They cooled her down and Amelia started working on her spine. The procedure was successful and despite having to be resuscitated after birth, Maya and the baby were both stable afterward. ''(\"[[The End of a Beautiful Friendship]]\")''\n\n\nWhen Maya was preparing to go to college, the dean of admissions at Columbia called her to say she was perfect Columbia material. ''(\"[[Two Steps Back]]\")''\n\n\nShe got into Columbia and decided she wanted to go there. When Naomi and Gabriel got engaged, they decided to move to New York so that Naomi would help Maya with Olivia while she was going to school. ''(\"[[...To Change the Things I Can]]\")''\n\n\n\nMaya once had Addison test her for STDs, which came back negative, but Maya was trying to cover for a friend of hers. Instead, Maya's friend was suffering from an ectopic pregnancy in which the fallopian tube ruptured and Addison had to take her into surgery. Maya admitted this and tells Naomi that she is still a virgin, to Naomi's relief. ''(\"[[In Which Addison Finds a Showerhead]]\")''\n\n[[Fillmore Davis]]\nMaya turned to Addison once again, revealing she was pregnant. The baby belongs to her boyfriend \"Dink\". ''(\"[[Another Second Chance]]\")''\n\nMuch to Naomi's chagrin, Maya and Dink decided to keep the baby and get married. Naomi shunned her daughter, leaving Sam to care for her. Maya and Dink decided they wanted to get married, and went to Sam for help. Sam and Dink's mother started talking, and finally gave their consent. However, Naomi was infuriated. She stated that she would take no part in planning their underage child's wedding. ''(\"[[Shotgun]]\")''\n\nThe wedding was quickly planned and the two of them married. ''(\"[['Til Death Do Us Part]]\")''\n\n\n[[Addison Forbes Montgomery]]\nMaya and Addison have a close bond. Maya went to Addison when she found out she was pregnant. She did that because she trusted Addison with her secret.\n\n\n*Maya was played by [[Shavon Kirksey]] in the backdoor pilot of Private Practice but was later replaced by [[Geffri Maya]].\n*She plays violin.<ref>[[In Which Addison Finds the Magic]], x (PP)</ref>\n*Her first tooth got lost in the yard and her family spent four hours looking for it.<ref>[[Best Laid Plans]], x (PP)</ref>\n*She loves rainbow sprinkles.<ref>[[The Parent Trap]], x (PP)</ref>\n*She used to do gymnastics.<ref>[[Shotgun]], x (PP)</ref>\n\n\n\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nMayaBennett.png|[[The Other Side of This Life, Part ]]\nPPMayaBennett.png|[[In Which Addison Finds the Magic]]\nPPMayaBennett.png|[[In Which Addison Finds a Showerhead]]\nPPMayaBennett.png|[[Let It Go]]\nPPMayaBennett.png|[[Tempting Faith]]\nPPMayaBennett.png|[[Homeward Bound]]\nPPxMayaBennett.png|[[A Death in the Family]]\nPPMayaBennett.png|[[The Parent Trap]]\nPPMayaBennett.png|[[Another Second Chance]]\nPPMayaBennett.png|[[Best Laid Plans]]\nPPMayaBennett.png|[[Shotgun]]\nPPMayaBennett.png|[['Til Death Do Us Part]]\nPPMayaBennett.png|[[In the Name of Love]]\nPPMayaBennett.png|[[The End of a Beautiful Friendship]]\n</gallery>\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nShotgun.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\n</gallery>\n\n\n{{Maya Bennett Appearances}}\n\n{{Scrollbox}}\n\n[[de:Maya Bennett]]\n\n{{DEFAULTSORT:Bennett, Maya}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (MFM)]]\n[[Category:Patients (Neuro)]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (Trauma)]]\n[[Category:Patients (Peds)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Cooper Freedman", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = PPx-.jpg\n|name = Cooper Freedman\n|status = Alive\n|alias = *Coop\n*Dr. Seuss\n*Marcel\n*Husband #\n*Mr. Sage\n*Dog Whisperer\n|title = M.D., [[Fellow of the American Academy of Pediatrics|F.A.A.P.]]\n|marital = [[Charlotte King]] ''(wife)''\n|children = *[[Mason Warner]] ''(with [[Erica Warner|Erica]])''\n*[[Georgia King-Freedman]]\n*[[Caroline King-Freedman]]\n*[[Rachel King-Freedman]]\n|siblings = Andy Freedman \u\n|parents = *[[Lawrence Freedman]]\n*[[Myra Freedman]]\n|grandparents = *Walter\n*Miriam\n*Irving\n*Rivka\n|other family = *[[Duke King]] ''(brother-in-law)''\n*[[Landry King]] ''(brother-in-law)''\n*[[\"Big Daddy\" King]] \u ''(father-in-law)''\n*[[Augusta King]] ''(mother-in-law)''\n|job= [[Attending]] [[Pediatrics|Pediatrician]]\n|workplace = '''Current'''<br>[[Seaside Health and Wellness]]\n'''Former'''<br>[[Oceanside Wellness Group]]\n|first appearance = *'''[[Grey's Anatomy|GA]]:''' [[The Other Side of This Life, Part ]]\n*'''[[Private Practice|PP]]:''' [[In Which We Meet Addison, a Nice Girl From Somewhere Else]]\n|last appearance = *'''[[Grey's Anatomy|GA]]:''' [[The Other Side of This Life, Part ]]\n*'''[[Private Practice|PP]]:''' [[In Which We Say Goodbye]]\n|count = \n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]]\n*'''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], and [[Season  (Private Practice)|]]\n|portrayed by = [[Paul Adelstein]]\n}}\n{{Quote|Life is full of failure. It's how we learn.|Cooper Freedman}}\n\n'''Cooper Freedman''' is a [[Pediatrics|pediatrician]] at [[Seaside Health and Wellness]]. He is married to [[Charlotte King]], with whom he has three daughters, [[Georgia King-Freedman|Georgia]], [[Caroline King-Freedman|Caroline]] and [[Rachel King-Freedman]] and a son, [[Mason Warner]].\n\n\n\nCooper was adopted as a child but he never sought out his biological parents as his adoptive parents were great. He grew up in Shaker Heights, Ohio in Cuyahoga County. Around the age of , Cooper found out that his adoptive parents had a son named Andy, who died a couple of years before they adopted him. This made him extremely mad at his parents, as he believed they only adopted him to fill the void. He later realized that they truly loved him and that he wasn't a replacement, but the situation left him with a deep fear of being someone's second choice.\n\n\nHe involved himself with the law several times with a patient who was seen as kidnapped by his non-custodial father. It turned out that he did not like his step-father and that he felt that he took his mother from his father. The patient turned out to be abusing himself so that his mother would believe him, but only his father did, so they ran away. Cooper later helped him, as he and his father lived out of a car. He also didn't call the police to report the missing child.\n\n\nOne day while at work, a woman named [[Erica Warner]] approached Cooper. Cooper realized that they had a one night stand years ago in his car. Erica then introduced a young boy named [[Mason Warner|Mason]] and said that he was Cooper's son. After Erica died, Charlotte and Cooper got full custody of Mason. Right after his mother's death, Mason refused to talk to Cooper and Charlotte, but after some time, Mason bonded with both Cooper and Charlotte.\n\n\nCooper and Charlotte became pregnant with triplets. Cooper did his best to support his wife, who didn't even want kids in the first place, which is why he was over the moon when she became pregnant with triplets. One of the babies was born prematurely, but with the dedicated support from her parents and friends, she pulled through. With some extraordinary measures taken, the other two babies stayed in utero long enough to be born naturally and around the due date.\n\nAfter the birth of their triplets, Charlotte and Cooper agreed he would stay home to take care of them while she returned to work, but Cooper soon found out three kids were too much to handle. They hired people to help out and both Cooper and Charlotte returned to work at the practice and St. Ambrose, all the while raising their four kids.\ua\n\n\nViolet described him in her book as a \"man child.\" Despite this description, Cooper is a very good pediatrician. He goes beyond everything to make sure his patients are safe, sometimes even crossing legal borders.\n\n\n\nCooper has problems meeting women because he says that he cannot socialize with people over the age of twelve (because of his profession). So instead of dating face-to-face, Cooper prefers internet dating. These online relationships almost never work out and he is always left humiliated. For example, Cooper got his car stolen from a woman he met online called \"SexyBoobs\".<ref>[[The Other Side of This Life, Part ]], x</ref>\n\n[[Charlotte King]]\nCooper \"[[In Which Cooper Finds a Port in His Storm|met]]\" [[Charlotte King]], who is Chief of Staff at the local hospital and someone he knows professionally, through an on-line dating site. She was completely embarrassed by this and walked away from the date, and attempted to avoid Cooper thereafter, but later, she agreed to have a drink with Cooper, but instead, the two ended up having sex and later entered into a relationship.\n\nCooper and Charlotte did eventually break up, but Cooper still tried to get Charlotte back and was supportive of her when she believed she was pregnant. Charlotte disliked the relationship between Cooper and Violet and this was usually the point of issue in their relationship.\n\nFollowing the death of her father, Charlotte asked Cooper to marry her. He initially accepted, but later changed his mind as he wanted their wedding to be a proper wedding, and not a spur of the moment, grief-coping mechanism wedding, although they do eventually [[Something Old, Something New|marry in Vegas]].\n\nCharlotte later became pregnant with female triplets. Charlotte [[Life Support|prematurely delivered]] the first triplet, later named Georgia. Cooper stayed with the baby while she was in the [[Neonatal Intensive Care Unit|NICU]]. For a while, she was on a ventilator, but eventually she was able to breathe on her own. Charlotte later [[Full Release|delivered]] the other two triplets. Since Charlotte named Georgia, Mason named the second baby Caroline, and Cooper named the third Rachel.\n\n[[Erica Warner]]\nErica Warner is a one-night stand from Cooper's past. Years later, she arrives at Cooper's workplace and tells him she has a kid, Mason Warner, and Cooper's the father.\n\n[[Amelia Shepherd]]\nCooper kissed Amelia while engaged to Charlotte, but Amelia pushed him off and remained friends.\n\n\nCooper is a very caring father for his four children. After the birth of his three daughters, he was a stay at home dad, but it was too much for him, so he demanded that Charlotte hire a nanny.\n\nWalter\nCooper has a grandfather named Walter who was a piano tuner. He suggested Walter as a possible name when he and Charlotte thought she was pregnant.<ref>[[Know When to Fold]], x (PP)</ref>\n\n\n[[Violet Turner]]\nCooper has always been extremely close to [[Violet Turner]] having a friends only relationship with her. He helped her get through her multiple break ups with Allan. They once attempted to have \"friends, with benefits\" arrangement, but Cooper found it too weird.\n\nWhen Violet became pregnant, she asked Cooper to move in with her to take care of her as her pregnancy progressed.\n\nDuring the attack on Violet by the schizophrenic patient Katie, Cooper was standing outside the house. He later blamed himself for not being there, when Violet needed him most.\n\n[[Sam Bennett]]\n\n[[Pete Wilder]]\n\n\nDr. Cooper Freedman is a [[Board Certification|board certified]] [[Board Certification#American Board of Pediatrics|pediatrician]]. He is a [[Fellow of the American Academy of Pediatrics|member of the American Academy of Pediatrics]]. A dedicated, effective physician, Dr. Freedman is a whiz with all things adolescent. Dr. Freedman prides himself on making kids laugh. Cooper is willing to do basically anything to save his patients, sometimes even crossing legal lines.\n\n\n*He's from Akron.<ref>[[Past Tense]], x (PP)</ref>\n*Cooper is fluent in American Sign Language.\n*He thinks that long division is stupid.\n*His favorite color is chartreuse, because he likes the sound of the word.<ref>[[Past Tense]], x (PP)</ref>\n*Cooper\uaand [[Sam Bennett|Sam]] are the only characters that appeared in every episode of\ua''[[Private Practice]]''.\n*He realized that he wanted to be a pediatrician when he spent summers working at a children's camp in Indiana.<ref>[[Past Tense]], x (PP)</ref>\n*Due to his [[Pediatrics|specialty]] and his lack of practicing pediatric sub-specialties, Cooper is the lowest earning doctor, in terms of salary, at the [[Seaside Health and Wellness]]\n*As a child, he liked magic. He also used to play the piano.\n*He likes to dip his fries in a strawberry milkshake, like his son [[Mason Warner|Mason]].\n*He is Jewish.\n*He wears briefs instead of boxers.\n*He hates physical education.<ref>[[Nothing to Talk About]], x (PP)</ref>\n*He's pro-choice.<ref>[[Crime and Punishment]], x (PP)</ref>\n*When he was a child, he always\uacarried around this doll he called Ernesta.<ref>[[What Women Want]], x (PP)</ref>\n*His cell phone number is () -.<ref>[[Short Cuts]], x (PP)</ref>\n\n\n<gallery widths=\"\" position=\"center\" orientation=\"landscape\" bordersize=\"none\" spacing=\"small\" hideaddbutton=\"true\">\nPPCooperFreedman.png\nPPCooperFreedman.png\nPPxCooperFreedman.png\nPPxCooperFreedman.png\n</gallery>\n\n{{GalleryLink}}\n\n\nThese episodes are Cooper-centric or otherwise very informative about his life.\n*[[In Which Cooper Finds a Port in His Storm]]\n*[[Worlds Apart]]\n*[[Life Support]]\n\n\n:'''Cooper:''' Life is full of failure. It's how we learn.<ref>[[If I Hadn't Forgotten...]], x (PP)</ref>\n\n\n{{Cooper Freedman Appearances}}\n{{Scrollbox}}\n\n[[fr:Cooper Freedman]]\n[[de:Cooper Freedman]]\n\n{{DEFAULTSORT:Freedman, Cooper}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Doctors]]\n[[Category:Patients]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (ID)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Corinne Bennett", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPx-.jpg\n|name = Corinne Bennett\n|status = Alive\n|siblings = [[Sam Bennett]]\n|parents = *[[Dee Bennett]]\n*[[Raymond McCray]] ''(estranged)''\n|other family = *[[Naomi Bennett]] ''(sister-in-law)''\n*[[Maya Bennett]] ''(niece)''\n*[[Olivia Davis]] ''(grand-niece)''\n*Aunt\n|first appearance = [[The Time Has Come]]\n|last appearance = [[The Letting Go]]\n|count = \n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]]\n|portrayed by = [[Anika Noni Rose]]\n}}\n\n'''Corinne Bennett''' is [[Sam Bennett|Sam Bennett's]] estranged sister.\n\n\n\nShe had been missing for  years when Sam got a call to pick her up from the jail after she was arrested for taking the cash out of a convenience store register. ''(\"[[The Time Has Come]]\")''\n\n\nSam brought Corinne back to his place. He gave her medicine, which she took willingly. He then took her to the practice and consulted with Sheldon, who said her previous doctors had been lazy. They hadn't properly diagnosed her. They'd just over-drugged her, which left her glassy-eyed and unable to function. Sheldon said they could take her off the meds and find a true diagnosis.\n\nOnce the fog lifted, Sheldon asked if she'd been officially diagnosed. She said she'd been diagnosed schizophrenic, manic-depressive, and had paranoid delusions. Every shrink had a different idea, but they all just drugged her.\n\nWhile she was in the bathroom, Sam talked about Corinne's history and her past behaviors. Sheldon decided to keep her on a mild sedative only, because they weren't sure what to expect from her. Sam later sat next to Corinne as she lay on a beach chair looking out at the ocean. ''(\"[[Too Much]]\")''\n\nAfter the medical fog had lifted, Corinne came in to see Sheldon again. She said she felt good. She'd gotten up at six and done several tasks before her session. She said she wasn't sure where to start talking about her past, so Sheldon suggested they focus on the present because they had limitations on what could be done. Despite this, Corinne believed she was ready.\n\nSam later confronted Sheldon about being pessimistic, but Sheldon said she seemed manic in their session. During a conversation that night, Sam found out Corinne had been back in LA for five years and hadn't contacted her family.\n\nIn her next session with Sheldon, Corinne was subdued and withdrawn. She said she fantasized about an earthquake hurting her and believed she was a waste of skin. He told her she had bipolar disorder and there were treatments they could use to lesson the swings, but Corinne believed it was hopeless. ''(\"[[You Break My Heart]]\")''\n\nCorinne continued to see Sheldon. She had a notebook in which she wrote down all her moods. She also told him Sam had suggested she try to get a part-time job or volunteer. She worried about letting him down if she couldn't keep the job. ''(\"[[Andromeda]]\")''\n\n\nThat night, Addison found Corinne outside, manic and frantically writing down information about stars. Sam was able to get her back inside, but they had a rough night. The next day, she brought food for everyone in the practice and was still very manic. Sam was able to get her to leave with him, but that night, she was convinced she'd discovered a new galaxy and needed to write it all down. There was a struggle and Corinne went through Sam's porch door, cutting her face and arms.\n\nSam took her to the ER, where Pete removed the shards of glass and stitched her cuts. Sheldon told Sam that Corinne needed in-patient care, but he refused as he'd already lost  years with her. ''(\"[[Andromeda]]\")''\n\nWhen she woke up the next morning, Corinne was apologetic about what had happened, though Sam claimed it wasn't a big deal. Sheldon continued to press Sam to get her in-patient care. Corinne told Sam she wanted to go home, but he said she wasn't ready to go home yet. When she said being in the hospital felt like being a prisoner, he agreed to take her home.\n\nAt home, Corinne said she was having suicidal thoughts, but she said she didn't have the courage to commit suicide. Because of that, Sam tried to suicide-proof the house, including getting rid of all the knives in the house. Sam said that if she was going to stay there, there had to be rules, such as taking all her medicine, eating, and sleeping. When she refused to take her meds, they had a physical altercation during which he forced her to take her pills.\n\nSam then went to Sheldon to ask him for more information about in-patient care for Corinne. Sam then went to talk to Corinne about it. She tried to refuse, but Sam said she needed the care they could provide that he couldn't. As they did her intake, Corinne said she never should have called Sam before entering the ward. ''(\"[[The Letting Go]]\")''\n\n\n\nShe and Sam were close as children, but they spent  years apart as adults that put distance between them. The week before Corinne left, Sam told his mom he didn't want a birthday party because he didn't want Corinne to ruin it like she ruined everything, so he blamed himself for her leaving. She assured him that she hadn't left because of him, but because she was sick. ''(\"[[You Break My Heart]]\")''\n\n\n*She once almost burned the house down making popcorn. She thought the fire looked cool, so she fanned the flames to make it bigger instead of trying to put it out.<ref>[[Too Much]], x (PP)</ref>\n*She and Sam used to go to a beach house in North Carolina during the summers.<ref>[[Too Much]], x (PP)</ref>\n\n\n\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPPxCorinneBennett.png|[[The Time Has Come]]\nPPxCorinneBennett.png|[[Too Much]]\nPPxCorinneBennett.png|[[You Break My Heart]]\nPPxCorinneBennett.png|[[Andromeda]]\nPPxCorinneBennett.png|[[The Letting Go]]\n</gallery>\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\n</gallery>\n\n\n{{Corinne Bennett Appearances}}\n\n{{Scrollbox}}\n\n{{DEFAULTSORT:Bennett, Corinne}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (Trauma)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Betsey Parker", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPx-.jpg\n|name = Betsey Parker\n|born = \n|status = Alive\n|parents = *[[Dell Parker]] \u\n*[[Heather Parker]] \u\n*[[Naomi Bennett]]\n|siblings = [[Maya Bennett]]\n|grandparents = Grandmothers\n|other family = *[[Wendell Parker]] ''(great-grandfather)''\n*[[Olivia Davis]] ''(niece)''\n*[[Monica Bratton]] ''(aunt)''\n*[[Fillmore Davis]] ''(brother-in-law)''\n|first appearance = [[Serving Two Masters]]\n|last appearance = [[...To Change the Things I Can]]\n|count = \n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], and [[Season  (Private Practice)|]]\n|portrayed by = [[Hailey Sole]]\n}}\n\n'''Betsey Parker''' is the daughter of the late [[Dell Parker|Dell]] and [[Heather Parker]]. After her father's death, she spent some time with an aunt and then in foster care before [[Naomi Bennett|Naomi]] took her to New York with her.\n\n\n\nWhen [[Dell Parker]] was seventeen years old, he started dating [[Heather Parker|Heather]]. They were both heroin addicts at the time. She got pregnant, but they hadn't been dating long and broke up.\n\nDell felt guilty about trying to force Heather to have an abortion, stating he drove her to the clinic, and when she wouldn't leave the car, he shouted at her, which is the reason he has issues with abortions. ''(\"[[Crime and Punishment]]\")'' Betsey was born and lived with her mother.\n\nDell was only reunited with his daughter much later, as Heather got clean and Dell had access to her.\n\n\nDell attempted to get an office from both [[Sam Bennett|Sam]] and [[Addison Forbes Montgomery|Addison]], but both put it off for later. He eventually cleaned out a spare office to impress Betsey, wanting her to see that one of her parents had it together after her mother relapsed. When Addison was about to discipline Dell for going against her wishes, she saw Betsey and allowed Dell to keep the office. ''(\"[[Serving Two Masters]]\")''\n\n\nAfter realizing that he couldn't protect his daughter from the people Heather hung out with, he decided to get a lawyer and fight her for custody. ''(\"[[Tempting Faith]]\")''\n\n\nBetsey was with Dell at the practice when a kid came in and was diagnosed with measles. She had also played with the kid, [[Michael Perkins]], in the waiting room. Unsure if Betsey had been vaccinated and unable to get a hold of Heather, Dell worried that Betsey could get measles. Cooper advised him to wait until Heather could be reached because he had  hours to vaccinate her. When he was finally able to get a hold of Heather at the end of the day, she admitted that she didn't know whether or not Betsey was vaccinated. ''(\"[[Contamination]]\")''\n\n\nHeather got promoted at her job, but the promotion meant moving to St. Louis. Dell refused to let Heather take Betsey, so Heather left in anger. When Dell showed up at the apartment to talk to Heather about it again, he found the apartment cleared out and both Heather and Betsey gone. ''(\"[[What Women Want]]\")''\n\n\nEventually, the pressure of her new job got to Heather and she relapsed. She brought Betsey back to Los Angeles and told Dell he could have her if he gave her $,. He got the money from Sam, but when she showed up, he said he wouldn't give her the money to kill herself, for Betsey's sake. He then told her to say goodbye to Betsey. She did so and left, leaving Betsey with Dell. ''(\"[[Yours, Mine & Ours]]\")''\n\n\nWhen Violet was attacked and hospitalized, Betsey went with Dell to the hospital, where they waited for news. ''(\"[[A Death in the Family]]\")''\n\n\nDell took some time off from work to take care of Betsey. When she started at a new school, she cried and clung to his leg when he dropped her off. ''(\"[[Pushing the Limits]]\")''\n\n\nBetsey was in the house with Heather when it exploded. Dell got Betsey out and they were both taken to the hospital. Heather had severe burns, but Betsey had only a minor brain contusion and carbon monoxide poisoning. Dell was told she'd wake in a few hours and she did. Once awake, Pete tried to get Dell to let her see Heather to say goodbye before Heather died. Dell refused, but Pete tried to sneak her there anyway. Right before they arrived, Dell showed up and took Betsey back to her room. Heather then died with only Pete by her side. ''(\"[[Blowups]]\")''\n\n\nSince their home was destroyed, Dell and Betsey moved in with Naomi. She refused to speak to her father, still angry at him for not letting her say goodbye to her mother. Dell eventually went to Betsey and admitted that he'd made a mistake and was trying to protect her. He apologized to her. ''(\"[[Another Second Chance]]\")''\n\n\nWhen Dell was injured in a car accident, he asked to have Betsey brought to him before he had to have brain surgery. He talked to her, saying that if something happened to him, it would be okay because she'd know that everything bad to happen in her life would have already happened, so she'd have good things happening after that. When Dell died in surgery, Pete had to tell Betsey, who started to punch him and cry. ''(\"[[The End of a Beautiful Friendship]]\")''\n\nBetsey was then left orphaned after the accident, ending up with Aunt Monica.\n\n\nAunt Monica showed up one day in OWG, telling Violet that she couldn't keep her for long, and left Betsey behind. Betsey colored and played in her dad's old office. Betsey was later taken home by Violet and Betsey asked if she could stay with them forever, but arguments ensued between Pete and Violet, Cooper and Charlotte, and Sam and Addison about keeping Betsey with them, with none of them willing to keep her for a greater stretch of time. After the discussion, it was decided that Betsey should be submitted to social services and put in foster care. ''(\"[[A Better Place to Be]]\")''\n\n\nA few months later, Betsey ended up in [[St. Ambrose Hospital|St. Ambrose Hospital's]] [[Emergency Room|ER]] because she fell down the stairs in her foster home. While she was being checked out, she said she didn't want to be there because her mommy and daddy died there. She had a brain contusion, but Amelia said the swelling could go down on its own. They did x-rays, which showed a recent clavicle fracture that had healed. Cooper became suspicious that her foster parents were abusing her. They monitored for a while, but when Betsey started seizing, they rushed her into surgery. Gina and Phil left to follow, leaving their son, Marshall, with Pete. Pete took Marshall to the cafeteria where they were joined by Sheldon. He asked Marshall about his parents. He said that when Betsey doesn't listen, he helps her to listen. He said that the jungle gym fall was her fault.\n\nIn surgery, Betsey started bleeding, so Amelia had to work to stop it. Meanwhile, Sheldon talked to the others, saying he believed Marshall would need help. They went to the Rakoffs about Marshall.\n\nAfter surgery, Betsey was stable, but comatose. After some time, Betsey woke up. When she learned that the Rakoffs had left, she asked where she was going to live. Naomi told her she was coming to live with her. ''(\"[[God Bless the Child]]\")''\n\n\nBecause Maya had been accepted to Columbia and Naomi wanted to be around to help her with Olivia and she and Gabriel became engaged, she moved Betsey with her to New York. ''(\"[[...To Change the Things I Can]]\")''\n\nBetsey\ualived\uawith\ua[[Naomi Bennett|Naomi]]\uaand\ua[[Gabriel Fife]], Naomi's fianc\ue,\uain New York\uauntil Naomi and Fife broke up. Naomi and Betsey moved back to LA for Sam, when Naomi became pregnant with his baby.\n\n\n*Betsey is often seen drawing.\n*Her last line in the show was, \"That's too bad. I like him.\" (referring to [[Gabriel Fife]]).\n*She was a week overdue.<ref>[[Pushing the Limits]], x (PP)</ref>\n*She hates the cold.<ref>[[Blowups]], x (PP)</ref>\n*She and Dell watched cartoons together.<ref>[[A Better Place to Be]], x</ref>\n*According to Naomi, she and Olivia adore each other.<ref>[[In Which We Say Goodbye]], x (PP)</ref>\n\n\n\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\">\nPPBetseyParker.png|[[Serving Two Masters]]\nPPBetseyParker.png|[[Contamination]]\nPPBetseyParker.png|[[What Women Want]]\nPPBetseyParker.png|[[Yours, Mine & Ours]]\nPPBetseyParker.png|[[A Death in the Family]]\nPPBetseyParker.png|[[Blowups]]\nPPBetseyParker.png|[[Another Second Chance]]\nPPBetseyParker.png|[[The End of a Beautiful Friendship]]\nPPxBetseyParker.png|[[A Better Place to Be]]\nPPxBetseyParker.png|[[God Bless the Child]]\nPPxBetseyParker.png|[[...To Change the Things I Can]]\n</gallery>\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\n</gallery>\n\n\n{{Betsey Parker Appearances}}\n{{Scrollbox}}\n\n{{DEFAULTSORT:Parker, Betsey}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Peds)]]\n[[Category:Patients (Trauma)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Sam Bennett", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = PPx-.jpg\n|name = Samuel Bennett\n|status = Alive\n|alias = *Dr. Feelgood\n*Dr. Phil\n*Addisam ''(along with [[Addison Forbes Montgomery|Addison]])''\n|title = M.D.\n|marital = [[Naomi Bennett]] ''(wife)''\n|children = *[[Maya Bennett]]\n*Expecting ''(with [[Naomi Bennett|Naomi]])''\n|siblings = [[Corinne Bennett]]\n|parents = [[Dee Bennett]]\n|bioparents = [[Raymond McCray]]\n|grandchildren = [[Olivia Davis]]\n|other family = *Mother-in-law\n*[[Fillmore Davis]] ''(son-in-law)''\n*Aunt\n|job = *[[Attending]] [[Cardiothoracic Surgery|Cardiothoracic Surgeon]]\n*[[Attending]] [[Internal Medicine|Internist]]\n*[[Body Language|Author]]\n|workplace = '''Current'''<br>[[Seaside Health and Wellness]]\n'''Former'''<br>[[Oceanside Wellness Group]]<br>[[New York Hospital]]\n|first appearance = *'''[[Grey's Anatomy|GA]]:''' [[The Other Side of This Life, Part ]]\n*'''[[Private Practice|PP]]:''' [[In Which We Meet Addison, a Nice Girl From Somewhere Else]]\n|last appearance = *'''[[Grey's Anatomy|GA]]:''' [[Before and After]]\n*'''[[Private Practice|PP]]:''' [[In Which We Say Goodbye]]\n|count = \n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]] and [[Season  (Grey's Anatomy)|]]\n*'''[[Private  Practice|PP]]:''' [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], and [[Season  (Private Practice)|]]\n|portrayed by = [[Taye Diggs]]\n}}\n{{Quote|I'm all in and I'm fighting for you.|'''Sam Bennett'''}}\n\n'''Sam Bennett''' is a founding partner of the [[Oceanside Wellness Group]]. He has written [[Body Language|a book]] and lives next door to [[Addison Forbes Montgomery]]. He has married\ua[[Naomi Bennett]]\uatwice, and they have a child together,\ua[[Maya Bennett]].\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSam is smart, funny, and can be very sexy at times. He has strong feelings, which helps with his bedside manner. He often gives inspirational speeches and talks about the meaning of life.\ua\n\n\n\n[[Naomi Bennett]]\nSam met Naomi in medical school at the [[Columbia University College of Physicians and Surgeons]]. The two married and had a daughter, [[Maya Bennett|Maya]]. Although the couple attempted to present the image of an amicably divorced couple, the post-marital relationship was, at times, strained. The reasons for their divorce were unclear. Sam professed to Addison that he had \"no good reason\" for requesting the divorce and then later stated that he was \"unhappy\" and wanted Naomi to fight for their relationship.\n\nSam and Naomi rekindled their sexual relationship after Sam survived a hostage situation. Although Sam and Naomi called the conference-room sex a \"slip up,\" they slept together again. For a brief time they were together again, but in the end they decided they should see other people.\ua\n\nSam and Naomi shared joint custody of Maya, although her primary residence was with Naomi.\n\nSam and Naomi began to repair their relationship after Naomi was asked to leave her post as director at the [[Oceanside Wellness Group]] and Sam began dating [[Sonya Nichols]], a doctor working for the County Health Department whom he met after a measles outbreak at the practice. Their relationship developed, and Maya also liked her. The first time they spent the night, Sam's asthma flared up and Sonya had to call an ambulance. Later on, they finally had sex, but not long into the relationship, Sam called Sonya \"Naomi\" while having sex, signalling he was not over her, which Addison hinted to while they were at Seattle Grace.\n\nThe two also shared a kiss while Naomi stayed over at Sam's house.\ua\n\nAt the wedding of mutual friend\ua[[Addison Forbes Montgomery|Addison]] to [[Jake Reilly]], the two had a one-night stand, resulting in Naomi's getting pregnant. Three months later, Naomi returned to L.A. where Sam, oblivious to the fact that Naomi was pregnant, declared his love for her and that he had always loved her. Naomi revealed her pregnancy to him and the two reunited and re-married.\ua\n\n[[Sonya Nichols]]\nSam began dating Sonya, a doctor working for the County Health Department whom he met after a measles outbreak at the practice. After Sonya finished evaluating the practice after a measles case came through, she admitted to Sam that she'd spent the whole day thinking about how his lips might taste like chocolate and she couldn't look at them. They then shared a kiss and later went out dancing together. Their relationship developed, and Maya also liked her. The first time they spent the night, Sam's asthma flared up and Sonya had to call an ambulance. Later on, they finally had sex, but not long into the relationship. After Sam went to Seattle to be with Archer and Naomi, Sonya questioned him about why he went and he said he went to support Naomi because she doesn't always have it all together. They continued to see each other happily until Sam called Sonya by the name of [[Naomi Bennett|Naomi]], signaling he was not over her.\n\nThey fought over it and Sam insisted that he wasn't thinking about Naomi while they were having sex. Despite this, she refused him sex. Sam tried to mend fences by getting Naomi's help to plan a vacation. Their vacation went well, but Naomi said afterward that she was done helping him with Sonya. Sonya came to him about a date and he admitted that you don't call out your ex's name if your new relationship is working. He ended things with her.\n\n[[Addison Forbes Montgomery]]\nSam and Addison were friends since Med school. In med school, he had asked her out, but she turned him down due to Naomi liking him.\n\nWhen Addison moved to L.A., she learned that they lived next door to each other.\n\nThey embarked on a relationship after Addison had lived in L.A. for some time. Their on-off relationship was marred by trouble and eventually ended due to Sam's unwillingness to have any more children.\ua\n\nShortly after Addison got [[Henry Montgomery|Henry]], Sam proposed to Addison, despite her being involved with [[Jake Reilly|Jake]]. However, the two managed to remain close friends and colleagues. Sam later attended her wedding to Jake, wishing only for her happiness, and reunited with Addison's best friend and his ex-wife, Naomi.\n\n[[Stephanie Kemp]]\nSam began dating Stephanie shortly after he broke up with Addison for the final time when she turned down his proposal. At first, he didn't tell Stephanie about his past with Addison or Naomi, creating a rift in their relationship. They got past it when he said he chose to care about her.\n\nStephanie met Naomi at Addison and Jake's wedding. Sam left her shortly thereafter for Naomi, breaking Stephanie's heart. She said that she really thought that he was \"the one\".\n\n\n[[Maya Bennett]]\nMaya Bennett\uais the daughter of Sam\uaand\ua[[Naomi Bennett]]. Her god-mother is Addison Montgomery.\ua\n\nMaya enjoys a close relationship with both of her parents. Although her parents divorced, the divorce didn't upset Maya much with Naomi once commenting that she probably enjoyed having 'extra everything'.\ua\n\nAt age fifteen, Maya found out she is pregnant by her boyfriend [[Fillmore Davis|Dink]], which angered both Sam and Naomi. While Naomi pushed for her daughter to have an abortion, Sam maintained the more rational stance, putting his daughter's wellbeing above all.\n\nMuch to Naomi's chagrin, Maya and Dink decided to keep the baby. Maya and Dink wanted to raise their baby together. At this, Naomi shunned her daughter, leaving Sam to care for a pregnant Maya. Maya and Dink decided they wanted to get married and went to Sam for help. Sam and Dink's mother started talking and finally gave their consent.\ua\n\nSam walked his daughter down the aisle and was eventually present for the birth of his granddaughter, [[Olivia Davis|Olivia]].\ua\n\n\n[[Cooper Freedman]]\n[[Charlotte King]]\n[[Violet Turner]]\n[[Pete Wilder]]\nSam and Pete were friends for a long time. Sam is one of a few people who knew Pete's first wife. They occasionally walked along the pier and consulted on each other's problems.\n\n\nDr. Sam Bennett, or \"Doctor Feelgood\" as he's known to patients across the globe, is another founding partner of the Oceanside Wellness Group and the practice's internist. He is the author of the best-selling non-fiction book, ''[[Body Language|Body Language: The Mind-Body Connection]]''. Oceanside Wellness Group, with its co-operative and whole-body approach to medicine, is illustrative of the views advocated in the book.\n\nWith Addison, Sam relieved Naomi of her administrative duties at Oceanside Wellness upon learning that the practice was going bankrupt. He took over, and introduced a \"Board of Shame\" (as Violet called it).\n\nEventually, all of the staff members had had enough of Sam's methods of increasing business at the practice, prompting a vote between Sam and Naomi, which, to the surprise of both Sam and Naomi, Addison won.\n\nIt is revealed when [[Miranda Bailey]] visits LA that Sam has completed a [[Cardiothoracic Surgery|cardiothoracic surgical]] [[Resident|residency]]. Reasons as to why Sam became an [[Internal Medicine|internist]] instead of a cardiothoracic surgeon remained unknown until he was confronted with [[Dell Parker|Dell's]] murderer and the man who hit [[Maya Bennett|Maya]] with his car. He let a pedophile die on the table by doing nothing to resuscitate him, causing him to feel guilty. He often practices his cardiothoracic specialty at [[St. Ambrose Hospital|the hospital]]\uaand refers to himself as one of the best cardiothoracic surgeons in the country.\ua\n\n\n*Sam can't ride a bike.<ref>[[Know When to Fold]], x (PP)</ref>\n*He used to have a dog named [[Thurgood Marshall]].\n*He doesn't like to wear condoms.\n*He is Catholic.\n*Sam and [[Cooper Freedman|Cooper]] are the only characters that appeared in every episode of\ua''[[Private Practice]]''. With the three appearances that Sam made on Grey's Anatomy versus Cooper's two appearances on that show, Sam has the highest appearance count of all original Private Practice characters.\n*Sam is the only\ua[[Cardiothoracic Surgery|cardiothoracic surgeon]] on both shows who completed a cardiothoracic surgery [[Resident|residency]] rather than complete a [[General Surgery|surgical residency]] followed by a cardio [[Fellow|fellowship]].\n*Although incorrect, Sam refers to himself as a cardiologist in [[The Breaking Point]].\n*Sam pierced his left ear.<ref>[[Let It Go]], x (PP)</ref>\n*He uses an inhaler for his asthma. He is allergic to corn-based propellents.<ref>[[Ex-Life]], x (PP)</ref>\n*He liked to play basketball in his free time.<ref>[[Losing Battles]], x (PP)</ref>\n*He likes a good peanut butter and jelly sandwich.<ref>[[Losing Battles]], x (PP)</ref>\n*He was on a racquetball team, though he hated the sport.<ref>[[Crime and Punishment]], x (PP)</ref>\n\n\n<gallery widths=\"\" position=\"center\" orientation=\"landscape\" bordersize=\"none\" spacing=\"small\" hideaddbutton=\"true\">\nPPSamBennett.png\nPPSamBennett.png\nPPxSamBennett.png\nPPxSamBennett.png\n</gallery>\n\n{{GalleryLink}}\n\n\nThese episodes are Sam-centric or otherwise very informative about his life.\n*[[Playing God]]\n*[[Too Much]]\n*[[The Next Episode]]\n*[[In Which We Say Goodbye]]\n\n\n\n\n{{Sam Bennett Appearances}}\n{{Scrollbox}}\n\n[[de:Sam Bennett]]\n[[fr:Sam Bennett]]\n\n{{DEFAULTSORT:Bennett, Sam}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Doctors]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Trauma)]]\n[[Category:Patients (CAM)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Raymond McCray", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPxRaymondMcCray.png\n|name = Raymond McCray\n|status = Unknown\n|marital = [[Jillian McCray]] ''(wife)''\n|children = *[[Corinne Bennett]]\n*[[Sam Bennett]]\n|only appearance = [[The Next Episode]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]]\n|portrayed by = [[Richard Roundtree]]\n}}\n\n'''Raymond McCray''' is the biological father of [[Sam Bennett]].\n\n\nRaymond came to Los Angeles with [[Dee Bennett]] and his wife, Jillian. Raymond needed cardiac studies after being in the ER a few weeks prior with chest pain. His symptoms had been getting worse since then. His EKG showed non-specific abnormalities, so Sam moved him to St. Ambrose for a chest CT and an echo.\n\nRaymond's tests showed pulmonary hypertension. Sam started him on anti-coagulants and placed an umbrella, which he hoped would solve the problem. When Jillian and Sam left Raymond's hospital room, the camera crew caught Dee and Raymond kissing in his room. Sam walked back in time to see it as well.\n\nDee, Raymond, and Jillian all attended a barbecue at Sam's house a few days later. Raymond pulled Sam aside and said it wasn't a fling and he really loved Dee. Sam told him to get away from him. Raymond collapsed at the party and had to be rushed to the ER. They stabilized him and moved him to the OR to remove the clots.\n\nDuring the surgery, he started to bleed into his chest. He survived the surgery, but was told he needed a lung transplant. Sam suggested they start testing family members, but Raymond and Jillian said they didn't have any children or nieces and nephews. Dee wanted to pray, but Jillian instead suggested that Sam get tested revealing that Raymond is his biological father. Jillian told Raymond she'd known all along, but hadn't said anything.\n\nDee talked to Sam about how their relationship played out. Sam decided to get tested to see if he was a match for Raymond. The test revealed that he was a match and he told Raymond he'd donate if Raymond wanted it. Raymond told Sam about how he'd watched Sam grow up and how he'd thought a lot about what would be different if they were a family. But he made the choice to stay with Jillian. He told Sam he wouldn't let Sam take a part of himself to save him. He was ready to go. Jillian took Raymond back home to die.\n\n\n\n[[Jillian McCray]]\nHe's married to Jillian McCray. She knew of his affair and that he'd fathered two children with Dee.\n\n[[Dee Bennett]]\nRaymond had an affair lasting over  years with Dee Bennett. The relationship produced two children, Sam and Corinne. Raymond decided to stay with his wife instead of being a family with them.\n\n\nHe fathered two children with Dee Bennett, though they weren't aware he was their father until Jillian told Sam when he was an adult in order to prompt him to get tested as a potential match for a lung transplant.\n\n\nHe owns a print shop.\n\n\n*He was  at the time of his hospitalization.\n*He gave Sam the toy stethoscope that started his interest in medicine.\n\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPPx-.jpg\nPPx-.jpg\n</gallery>\n\n{{DEFAULTSORT:McCray, Raymond}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:Patients]]\n[[Category:Patients (Cardio)]]\n[[Category:Patients (ER)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Dell Parker", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Nurse Infobox\n|image = PPx-.jpg\n|name = William Dell Parker\n|born = [[Timeline|]]\n|died = [[Timeline|]]; [[Los Angeles]], California\n|status = Deceased\n|alias = Fetus\n|title = R.N.\n|marital = [[Heather Parker]] \u ''(wife)''\n|children = [[Betsey Parker]]\n|parents = Mother\n|grandparents = *[[Wendell Parker]]\n*Grandmother \u\n|other family = [[Monica Bratton]]\n|job = *Nurse\n*Midwife\n*Receptionist\n|workplace = '''Until death'''<br>[[Oceanside Wellness Group]]\n'''Former'''<br>[[St. Ambrose Hospital]]\n|first appearance = *'''[[Grey's Anatomy|GA]]:''' [[The Other Side of This Life, Part ]]\n*'''[[Private Practice|PP]]:''' [[In Which We Meet Addison, a Nice Girl From Somewhere Else]]\n|last appearance = *'''[[Grey's Anatomy|GA]]:''' [[The Other Side of This Life, Part ]]\n*'''[[Private Practice|PP]]:''' [[The End of a Beautiful Friendship]]\n|count = \n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]]\n*'''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], and [[Season  (Private Practice)|]]\n|portrayed by = [[Chris Lowell]]\n}}\n\n'''Dell Parker''' was a nurse and midwife, as well as the receptionist at [[Oceanside Wellness Group]]. He was married to [[Heather Parker]] until her death and had one daughter, [[Betsey Parker]]. He died following injuries sustained from a car crash.\n\n\n\nDuring his childhood, Dell was abused by his mother.<ref>[[In Which Charlotte Goes Down the Rabbit Hole]], x (PP)</ref>\n\nDell became addicted to heroin and he introduced his girlfriend Heather to his drug dealing friends. When he was , Heather became pregnant with their child, Betsey. Dell wanted her to have an abortion. They even drove up to the clinic and when Heather refused to get out of the car, he yelled at her for it. However, after Betsey's birth, he was grateful Heather didn't have the abortion. The experience caused him to become anti-abortion.<ref>[[Crime and Punishment]], x (PP)</ref>\n\nDell managed to stop using, but it wasn't for a few more years that Heather managed to stop.\n\n\nDell was enrolled as a student in the South Bay School of Holistic Midwifery and Family Nursing. He earned credit towards his degree in midwifery by assisting staff doctors with obstetrical exams and childbirths. Dell's hobbies included surfing during his lunch break.\n\n\nWhen Heather got a promotion at work, she talked to Dell, informing him the promotion was in St. Louis. Dell did not want this to happen, and they fought about it. Later on, when Dell went to talk to her, he found her apartment empty, and Betsey gone. However, the job put pressure on Heather and she started using again. She returned to Los Angeles to ask Dell for $, in exchange for his daughter. While he got the money from Sam, he changed his mind when Heather came to collect it. He told her he would call the police or DCFS if necessary, but he couldn't give her money to go kill herself with drugs since Betsey loved her. Heather then left but promised she would somehow get Betsey back.\n\nLater, Dell married Heather when she went through rehab. Most of the group at the practice did not approve of this. He later yelled at Violet and Naomi due to them not approving of his marriage. This angered him and led him to say things that they had done.\n\n\nOne night when Dell was heading out for work, his home exploded. Betsey was injured, and Heather received rd degree burns on her body. Later, the explosion was revealed to have been caused by Crystal Meth being cooked on the stove by Heather. Dell was furious and told Heather to go die and suffer a miserable death due to putting their daughter in danger. After this, Dell refused to let Betsey see her mother. Later in the hospital that night, Heather died due to her injuries, without having the chance to say goodbye to Dell or Betsey.<ref>[[Blowups]], x (PP)</ref>\n\n\nDell announced he was accepted into the UCLA Medical School. Dell died of a brain hemorrhage and subdural hematomas sustained from a collision with an intoxicated driver while driving Maya to the hospital to deliver her baby. His bleeding was overlooked causing the damage to spread before being detected.<ref>[[The End of a Beautiful Friendship]], x (PP)</ref>\n\n\nDell often gets caught up in his emotions. He loves and hates wholeheartedly. As often shown, this can lead to situations he has not thought through well.\n\n\n\n[[Naomi Bennett]]\nDell had a crush on his boss, [[Naomi Bennett]]. He often showed it by getting her coffee, bringing her home-baked chocolate cake, and generally complimenting and adoring her. Naomi didn't take his crush seriously, calling him a \"kid\" although when she needed to feel better, at one o' clock, she and Violet would go to the lobby to see Dell walk down to the beach for surfing in only his swimming trunks and also an hour later, when he was wet.\n\nAfter realizing his feelings had developed into something more serious than a crush, Dell decided to fight for Naomi and when putting her jacket on her, he kissed her and told her he sure didn't have it all together, but that he was a man, not a kid. He promised he'd fight for her and left her office, only to see her kissing Sam seconds later. This made him realize Sam was fighting for ex-wife again, just like him.\n\nUnable to handle the pressures of covering for Naomi and financial problems of the practice any more and not even getting some attention from her in return, a frustrated Dell quit his job. He started working at St. Ambrose Hospital, where Naomi came to say hi after finding out. He didn't want to talk to her and just continued working. She later returned and told him she took him for granted and should've listened to him, and that she and the practice had been adrift since he left. She begged him to come back, but he told her he was happy at the hospital, as he was respected and taught there.\n\n[[Heather Parker]]\nDell married Heather and most of the group at the Practice did not approve of this. He later yelled at Violet and Naomi due to them not approving of his marriage, which angered him to say things they had done, such as Violet being so cold to Pete and their son Lucas, and Naomi leaving the practice for the other practice downstairs.\n\n\nDell was primarily raised by his grandparents. His father presumably left his mother during her pregnancy or shortly after Dell's birth, as he didn't have a part in raising Dell. Dell's mother, whom he described as a \"traveling stone\", started traveling around the world. She \"rolled right off\" and left Dell with her parents. She only sends him occasional postcards. Thereby, Dell has no close relationship with any of his parents. When his grandmother died, Dell was left on his own when his grandfather moved to a nursing home.\n\n\nDell greeted people with a happy smile when they arrived at the [[Oceanside Wellness Group]]. Much more than just their receptionist, Dell performed many of the day-to-day operations that kept the practice up and running. Dell received his nursing degree.\n\nDell was also a trainee midwife, frequently shadowing [[Naomi Bennett]] and [[Addison Forbes Montgomery]] during births at the practice.\n\nDell also briefly worked at [[St. Ambrose Hospital]] as a nurse after he left Oceanside Wellness, unable to handle the pressures of covering for Naomi and financial problems of the practice any more.\n\nDell got into medical school at [[UCLA Medical Center|UCLA]] before his death. No one knew about it except Charlotte, Violet, and Maya, whom he told her in order for her to calm down.\n\n\n*He hated wearing pink scrubs.<ref>[[Nothing to Talk About]], x (PP)</ref>\n*Dell was pro-life.<ref>[[Crime and Punishment]], x (PP)</ref>\n*He had a scar from when a patient threw a coffee cup at his head.<ref>[[In the Name of Love]], x (PP)</ref>\n*He was  when he died.\n*He was the only adult main character of either ''[[Grey's Anatomy]]'' or ''[[Private Practice]]'' that wasn't a doctor.\n*He was the first main character to be killed off in Private Practice.\ua\n*Dell had a personalized scrub cap, which was outer-space themed.\ua\n\n\n<gallery widths=\"\" position=\"center\" orientation=\"landscape\" bordersize=\"none\" spacing=\"small\" hideaddbutton=\"true\">\nPPDellParker.png\nPPDellParker.png\nPPDellParker.png\nPPDellParker.png\n</gallery>\n{{GalleryLink}}\n\n\nThese episodes are Dell-centric or are otherwise very informative about his life.\n*[[In Which Dell Finds His Fight]]\n*[[Serving Two Masters]]\n*[[Crime and Punishment]]\n*[[Blowups]]\n*[[The End of a Beautiful Friendship]]\n\n\n:'''Dell:''' I think Betsey's owed one. She's just had such a tough life, you know, teenage parents and a mom on drugs. And I will never know what this has done to her. But I figured she's owed, right? She's had it so bad, that this can't be her end. Because then, what was her life for, just suffering? That would be cruel. That would be just beyond cruel.\n\n\n{{Dell Parker Appearances}}\n{{Scrollbox}}\n\n[[de:Dell Parker]]\n\n{{DEFAULTSORT:Parker, Dell}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Deceased Characters]]\n[[Category:Nurses]]\n[[Category:Patients]]\n[[Category:Patients (Neuro)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Trauma)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Charlotte King", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = PPx-.jpg\n|name = Charlotte King\n|status = Alive\n|alias = *canyouhandleme\n*Charlie\n*Char\n*Cruella\n*Herr Charlotte\n*Satan\n*The Wicked Witch of St. Ambrose\n*Big Bad Bitch Charlotte\n|title = M.D.\n|marital = *[[Billy Douglas]] ''(ex-husband)''\n*[[Cooper Freedman]] ''(husband)''\n|children = *[[Mason Warner]] ''(stepson)''\n*[[Georgia King-Freedman]]\n*[[Caroline King-Freedman]]\n*[[Rachel King-Freedman]]\n|siblings = *[[Duke King]]\n*[[Landry King]]\n|parents = *[[\"Big Daddy\" King]] \u\n*[[Augusta King]]\n|other family = *Buster Hodges ''(uncle)''\n*[[Lawrence Freedman]] ''(father-in-law)''\n*[[Myra Freedman]] ''(mother-in-law)''\n*Andy Freedman \u ''(brother-in-law)''\n|job = *[[Chief of Staff]]\n*[[Sexology|Sexologist]]\n*[[Attending]] [[Urology|Urologist]]\n|workplace = '''Current'''<br>[[St. Ambrose Hospital]]<br>[[Seaside Health and Wellness]]\n'''Former'''<br>[[Oceanside Wellness Group]]<br>[[Pacific Wellcare Center]]\n|first appearance = [[In Which We Meet Addison, a Nice Girl From Somewhere Else]]\n|last appearance = [[In Which We Say Goodbye]]\n|count = \n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], and [[Season  (Private Practice)|]]\n|portrayed by = [[KaDee Strickland]]\n}}\n{{Quote|Here's some free advice. Kindergarten's over. Training wheels are off. Nobody's gonna catch you if you fall. If you don't like your life, you do something about it. You reach down, you pull one foot out of the mud, then the other. You walk away from it. You can't walk, you crawl. You do something. Join a gym. Join a club. Join a cult. Do something, anything. What you don't do is whine to me about it.|[[Charlotte King]]}}\n\n'''Charlotte King''' is the [[Chief of Staff]] and [[Attending|attending]] [[Urology|urologist]] at [[St. Ambrose Hospital]]; additionally, she is a [[Sexology|sexologist]] at [[Seaside Health and Wellness]]. She is married to\ua[[Cooper Freedman]]\uawith whom she has four kids:\ua[[Mason Warner]], and\ua[[Georgia King-Freedman|Georgia]],\ua[[Caroline King-Freedman|Caroline]], and\ua[[Rachel King-Freedman]].\n\n\n\nShe is from Monroeville, Alabama.\n\nGrowing up, she was told, by her father, how sweet she was for taking care of her younger brothers.\n\nWhen she was fifteen, she had to shoot her horse Marjorie after it sprained its ankle. Marjorie was her last pet and when she thought she might have been pregnant, she thought about naming the baby Marjorie.\n\nShe always wanted to make her father, Big Daddy, proud, so she became a doctor.\n\n\nCharlotte met\ua[[Billy Douglas]], with whom she eventually married. At one point, she came home from the hospital after work and found him in bed with another woman. Charlotte lost her self control and dragged the woman off her husband and jumped Billy, yelling at him. The woman then grabbed a vase and smashed it on Charlotte's head, knocking her out. Billy called , but left before the paramedics arrived. Charlotte couldn't forgive him for what happened, ending the marriage<ref>[[If I Hadn't Forgotten...]], x (PP)</ref>.\n\n\nFollowing the attack, Charlotte became addicted to the pain medication. She tried to get her colleague, who treated her after the attack, to write her another prescription, but he was aware of the dangers of addiction. She tried to convince him saying she'd know when to stop as a doctor, but he only offered to write her a prescription for pills with a lighter effect. She declined and left.\n\nSome time later, drugged after a shift, Charlotte was driving her car through a storm. She began to fall asleep at the wheel and deviated from her lane. She didn't notice the car approaching in the opposite direction, causing the other driver to have to get out of the way, slipping and crashing into a pole. The crash brought Charlotte back to her senses. She pulled over and went to help the woman, but the woman had flown through her windshield. Charlotte called , but the woman didn't make it. The truth about the accident was never uncovered, as the woman was deemed a careless driver for not wearing a seat belt and Charlotte never told the truth.\n\n\nCooper and Charlotte first started dating after meeting on a sex site. They didn't expect the person they'd agreed to meet to be each other, but they agreed to give it a shot. Their relationship started out with just being \"Friends with Benefits,\" but Cooper wanted it to be more. Charlotte wasn't open to that until she realized that she was falling in love with Cooper. The two were on and off after Charlotte admitted to having sex with [[Archer Montgomery]]. Cooper forgave her, but then they got into another argument when Cooper found out Charlotte was the new owner of the competing clinic right below Oceanside Wellness. They eventually made up.\n\n\nAfter telling Cooper that she had become more of an administrative position at St. Ambrose and less of a doctor, she took a job interview. She had been recruited to run the [[Pacific Wellcare Center]] on the newly leased fourth floor of the building that also housed [[Oceanside Wellness Group]]. Charlotte kept this from Cooper, but was found out by Violet. Violet agreed to keep the secret so that Charlotte had the chance to come clean about it to Cooper. After giving her several chances, Charlotte did not tell Cooper and so Violet confronted Cooper. Cooper became very angry that Charlotte was running an opposing medical practice in his building and they broke up.\n\n\nAfter William White fired Charlotte from her position at Pacific Wellcare Center, she approached Sam for a position at Oceanside Wellness Group and explained why she was a good hire for the practice. Sam and Addison had a conversation about it, and eventually decided to hire her. She moved into Pete's old office and practiced as a [[Sexology|sexologist]].\n\n\nIn [[St. Ambrose Hospital]] as [[Chief of Staff]], she told a noisy patient to wait his turn. However, that man had mental problems. He thought that women had to respect him and because Charlotte was mean to him, he assaulted her later that day.\uaGetting ready to go home, Charlotte left her office in the hospital. When she turned around after having closed the door, the man knocked her head against the door and dragged her back into her office.<ref>[[All in the Family]], x (PP)</ref>\n\nShe tried to resist and scratched the assaulter, which only enraged him more. He continued punching her eventually raped her in her own office.\uaShortly after, she left her office, bruised and bleeding. She hobbled to the nearest supply closet to get some bandages, but Pete Wilder, who was working in the ER that night, noticed her. He followed her and caught her when she fell down. He carried her into a room in the hospital.\n\nCharlotte chose not to tell anyone that she was raped and even hurt badly, she continued bossing everyone at the hospital around. She only allowed nurse Sheila in her room, not any of the \"nosy bitchy ones\" and the doctors from the practice. However, Addison didn't buy the story that the assaulter took her wallet and she asked everyone to leave the room. When they were alone in the room, Charlotte came clean to Addison. She told her that she was raped. Addison did a pelvic exam and tried to pursue Charlotte to report the assault, but Charlotte refused. However, Addison secretly did a rape kit and kept it in the hospital under the name of Jane Doe, thinking Charlotte might want the assaulter's DNA later.<ref>[[Did You Hear What Happened to Charlotte King?]], x (PP)</ref>\n\nSome time later, Charlotte returned to work, but she still hadn't fully recovered yet. Upon entering her office, she started getting flashbacks of the assault and she went to the practice instead. Her colleagues there tried to act normal around her, but they all failed to do so. Sheldon was the only one who actually left her alone like she wanted them to. Pete came into her office to check on her wounds, reminding Charlotte of the rape and she almost started crying in front of him. Violet offered to help her too, but Charlotte refused, saying it was impossible for Violet to know what she was going through. She also completely shut out Addison, because Addison saw her at her most fragile point. Amelia offered her donuts and said she was going to meetings for addicts. She also talked to her about craving to pills after something terrible happened, but Charlotte denied she was craving for pills.\n\nAddison eventually told Sam that Charlotte was raped. On his turn, he asked Violet to talk to Charlotte without actually saying that she was raped. However, Violet suspected something and talked to Pete, who suspected the same. When talking with Violet in his office about the night Charlotte was assaulted, Sheldon said he was in the police office talking to a rapist. Seeing the way Violet reacted to the word \"rapist\", he asked her if Charlotte was raped. Violet said she also suspected that Charlotte was raped.\n\nCooper told Charlotte he simply couldn't leave her alone after what happened. This seemed to help her deal with it a little bit better, as she dared to enter her office again shortly after, without having flashbacks. Violet later came to Charlotte's office, and she started talking about the time she was raped herself, leaving Charlotte devastated. She went to Amelia's office and asked her to go to a meeting with her, admitting she was craving pills.\uaMeanwhile, Addison made calls to have the pelvic washings from Charlotte processed.<ref>[[What Happens Next]], x (PP)</ref>\n\n\nWhen Erica Warner showed up at the practice claiming that Cooper was the father of her son, Cooper was delighted and immediately believed her. Charlotte was more cautious. At first, she approached Erica and paid her money to leave Cooper alone. Erica took the money, but only to give it back to Cooper as that was not what she was after. She wanted to disappear from his life, but Cooper convinced her he had nothing to do with it. Charlotte later realized that she crossed a line, but she only did so to protect her family. She did a paternity test behind Cooper's back, which revealed that Mason was indeed his son.\n\nErica then allowed Cooper to come visit his son, but didn't allow Charlotte be near him, so Charlotte kept her distance. Over time, Erica came to realize that Charlotte had meant no harm and she noticed that Mason had grown to like Charlotte, and vice versa. She then allowed Mason to spend the night at Cooper and Charlotte's, and Mason and Erica progressively became part of their family.\n\n\n\nCharlotte was frustrated when she discovered she was pregnant. While she had happily accepted being Mason's mother, she was not interested in having more kids. She then became horrified upon finding out that she was expecting triplets. While abortion was not an option for her because of her faith, she did hope for a miscarriage in the early stages of the pregnancy. That didn't happen and the family began to prepare for the three new additions.\nAddison had to sew up Charlotte's cervix after she had one of the babies prematurely at only twenty-six weeks.\n\n\nGenerally, the character has served as somewhat of a foil to the other doctors at [[Oceanside Wellness Group]], often impeding their progress in helping patients through somewhat unorthodox methods by applying and enforcing legal, medical and ethical implications. However, while being treated for insomnia, Charlotte revealed that she has trouble connecting with others because signs of affection were discouraged in her family. She later became less obstructive and the relationship with [[Cooper Freedman|Cooper]] somewhat humanized her..\n\n\n\n[[Billy Douglas]]\nAt Oceanside Wellness, Charlotte told a patient that she married her first love and they had a fairy tale-like relationship. However, she caught him in their bed having sex with another woman. She couldn't forgive him for that, and they broke up.\n\nBefore Charlotte married Cooper, she talked with Billy about their marriage. It turned out Billy was gay and cheated on her because he wanted to know if he'd feel different with another woman, but he said he didn't.\n\n[[Cooper Freedman]]\nMuch later, she started up a relationship with Cooper Freedman after meeting through an internet dating service. They stayed together for a while, but after they broke up, she began to feel sick which made Cooper think that she was pregnant. After he convinces Charlotte that she might be pregnant, she takes a pregnancy test and while they are waiting for the results, they begin to think of names and when they see that the test came back negative, Charlotte tries to get back together with Cooper, but he refuses.\n\nFollowing the death of her father, Cooper goes with her and comforts her and they eventually get back together, but Charlotte dislikes Cooper living with Violet and they argue over that. Charlotte creates another roadblock in their relationship when she sleeps with [[Archer Montgomery]] and is caught by [[Addison Forbes Montgomery|Addison]], but Cooper sees this as a sign of her pushing him away, and he forgives her. Eventually, Charlotte begins to bond with Violet over Cooper and her pregnancy, but eventually they part ways when she reveals that she slept with [[Archer Montgomery]] and Violet tells her, professionally and personally, that it's not okay that she did that. Charlotte and Cooper stay together and eventually have a [[Something Old, Something New|Vegas wedding]].\n\nHer relationship with Cooper took kind of a blow when she found out that Cooper has a son and Charlotte tried to pay Mason's mother to leave them alone, but they eventually reconciled. Charlotte developed motherly feeling for Mason when it became clear that his mother would die.\n\nCharlotte became pregnant with triplets which both she and Cooper refer to as the 'Cooplets'. Charlotte went into premature labor and [[Life Support|delivered the first triplet]], whom they later named Georgia. Two months later, [[Full Release|she delivered the last two triplets]]. Because she named Georgia, Mason named the second baby Caroline, and Cooper chose Rachel for the third.\n\n[[Sheldon Wallace]]\nCharlotte and Sheldon started sleeping together after Charlotte and Cooper broke up. She stated to [[Amelia Shepherd|Amelia]] that the rumors about Sheldon's penis are true. She used sex with Sheldon to cover up the pain of her and Cooper's break up. Sheldon eventually realized this and broke it off with Charlotte, advising her to pursue Cooper since she was still in love with him. Sheldon and Charlotte remained friends and he gave her advice on how to be friends with Cooper and how to eventually get him back. Sheldon stopped the elevator with Addison in it to tell her that he loved Charlotte. He couldn't stop thinking about her and kept going to her office to borrow postage stamps even though he paid his bills online.<ref>[[In the Name of Love]], x (PP)</ref>\n\n[[Archer Montgomery]]\nCharlotte had a sexual affair with Archer in his office at [[Pacific Wellcare Center]]. Charlotte did this to hurt Cooper, because she was afraid of their growing relationship and wanted it to blow up in her face.\n\n\n[[Amelia Shepherd]]\n[[Naomi Bennett]]\n\n\nDr. King is a graduate of [[Johns Hopkins Medical School]] and is the [[Chief of Staff]] at [[St. Ambrose Hospital]] in [[Santa Monica]].\n\nShe also opened a rival practice, [[Pacific Wellcare Center|Pacific Wellcare]]\ualocated on the fourth floor of the same building as the Oceanside Wellness Group.<ref>[[Know When to Fold]], x (PP)</ref>\uaThe owner of the practice, [[William White]], fired Charlotte as director of Pacific Wellcare and hired Naomi to replace her. His reasoning was that good leaders have a heart, and not only capable of attracting and hiring quality doctors.<ref>[[Yours, Mine & Ours]], x (PP)</ref>\n\nFollowing the revelation that [[Cooper Freedman|Cooper]] is broke and that the remaining staff at the [[Oceanside Wellness Group]] are looking to buy Naomi's share of the business, Charlotte gives [[Addison Forbes Montgomery|Addison]] and [[Sam Bennett|Sam]] a check for Cooper's share, as well as a blank check for her to buy into the practice.<ref>[[Pushing the Limits]], x (PP)</ref> After much debate between Addison and Sam, including Charlotte confronting Sam, Sam and Addison decided to hire Charlotte as a new member of staff at Oceanside Wellness.<ref>[[Strange Bedfellows]], x (PP)</ref>\n\nCharlotte moved into Pete's old office after his move to the rival practice, offering sexology as her specialty. Charlotte had had that idea for a long period of time. She hired a web designer to build her a website that allows her to offer advice, as well as provide consultations by email and book appointments to see her.\n\n\n*There is an inconsistency in where Charlotte graduated from medical school. In Private Practice promotional material, it claims she is a Yale graduate, whereas Cooper claims she is a Johns Hopkins graduate. It's possible that she attended Yale for medical school and completed her residency at [[Johns Hopkins Hospital]].<ref>[[Homeward Bound]], x (PP)</ref>\n*Charlotte has neonatal rounds at [[St. Ambrose Hospital]], which she has asked [[Addison Forbes Montgomery|Addison]] to cover for her when she returned home to see her father.<ref>[[Homeward Bound]], x (PP)</ref> Since [[Chief of Staff]] is a bureaucratic and administrative role, it is assumed that these rounds are part of her duties as a [[Urology|urologist]] at St. Ambrose, indicating that Charlotte practices pediatric urology.\n*Charlotte is the only character of the original main characters of ''Private Practice'' to never appear in a ''[[Grey's Anatomy]]'' episode. She has, however, visited\ua[[Seattle Grace Mercy West Hospital]].<ref>[[You Break My Heart]], x (PP)</ref>\n*Charlotte was revealed to be a [[Surgery|surgeon]] in \"[[Strange Bedfellows]]\", specializing in [[Urology|urology]], electing sexology as a new specialty to practice at Oceanside Wellness.\n*[[Pete Wilder]]\uawas her work husband. He brought her coffee and waited for her so they could get lunch together.\n*Charlotte loves fried chicken.\n*Her least favorite meal of the day is breakfast.<ref>[[Life Support]], x (PP)</ref>\n*Charlotte has a slight fear of needles.\n*She likes to read, her favorite book being \"''[http://en.wikipedia.org/wiki/To_Kill_a_Mocking_Bird To Kill a Mocking Bird]''\". It was written by Harper Lee, who is from the same town as Charlotte, Monroeville.\n*\"[[In Which Sam Gets Taken for a Ride]]\"\uais the only ''[[Private Practice]]'' episode in which Charlotte doesn't appear.\n*[[Mason Warner|Mason]] calls her Mama.\n*She is in NA and allergic to local anesthetic.<ref>[[Did You Hear What Happened to Charlotte King?]], x (PP)</ref>\n*She loves to drink martinis, which is why she knows how to make extremely good martinis.\n*The password for her computer at St. Ambrose was \"Big Daddy\". Although unconfirmed, it's assumed that she changed it after Cooper used it break into her computer.\n*She sometimes refers to her children as \"Rugrats\".\n*She's allergic to cats.\n*She snores.<ref>[[In Which Charlotte Goes Down the Rabbit Hole]], x (PP)</ref>\n\n\n<gallery widths=\"\" position=\"center\" orientation=\"landscape\" bordersize=\"none\" spacing=\"small\" hideaddbutton=\"true\">\nPPCharlotteKing.png\nPPCharlotteKing.png\nPPxCharlotteKing.png\nPPxCharlotteKing.png\n</gallery>\n\n{{GalleryLink}}\n\n\nThese episodes are Charlotte-centric or are otherwise very informative about her life.\n*[[In Which Charlotte Goes Down the Rabbit Hole]]\n*[[Homeward Bound]]\n*[[Did You Hear What Happened to Charlotte King?]]\n*[[What Happens Next]]\n*[[Can't Find My Way Back Home]]\n*[[Blind Love]]\n*[[Something Old, Something New]]\n*[[...To Change the Things I Can]]\n*[[Aftershock]]\n*[[Georgia on My Mind]]\n*[[Full Release]]\n\n\n:'''[[Cooper Freedman|Cooper]]:''' Sure thing, Charlie.\n:'''Charlotte:''' You call me that again... You will be hobbling down that aisle! <ref>[[What We Have Here...]], x (PP)</ref>\n----\n: '''Charlotte:''' I don't like people. It's rare that someone comes along I can even tolerate.<ref>[[Two Steps Back]], x (PP)</ref>\n----\n:'''[[Pete Wilder|Pete]]:''' People need connection to stay healthy, positive connection with another human.\n:'''Charlotte:''' I don't--I don't need your pity positivity. I don't know what Violet told you, but I connect. Okay?\n:'''[[Pete Wilder|Pete]]:''' Yeah, when?\n:'''Charlotte:''' None of your business--\n:'''[[Pete Wilder|Pete]]:''' Business. Right. Maybe I'm not the guy to help you. Maybe you need someone--\n:'''Charlotte:''' Who I can't irritate? Find that man for me and I'll marry him. My family didn't believe in displays.\n:'''[[Pete Wilder|Pete]]:''' Of affection?\n:'''Charlotte:''' My mother, there was the occasional sloppy kind that followed cocktails.\n:'''[[Pete Wilder|Pete]]:''' And since then?\n:'''Charlotte:''' Who has time for that kind of thing?\n:'''[[Pete Wilder|Pete]]:''' I'm sorry, Charlotte. Do you want to try again?\n:'''Charlotte:''' Why not? My hair's already shot.<ref>[[In Which Charlotte Goes Down the Rabbit Hole]], x (PP)</ref>\n\n{{Charlotte King Appearances}}\n{{Scrollbox}}\n\n[[fr:Charlotte King]]\n[[de:Charlotte King]]\n\n{{DEFAULTSORT:King, Charlotte}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Doctors]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (MFM)]]\n[[Category:Patients (CAM)]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (Trauma)]]\n[[Category:Patients (Ortho)]]\n[[Category:Patients (General)]]\n[[Category:Patients (ID)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Violet Turner", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = PPx-.jpg\n|name = Violet Maryann Turner\n|status = Alive\n|alias = *Vi\n*Nancy Drew\n|title = M.D.\n|marital = [[Pete Wilder]] \u ''(husband)''\n|children = [[Lucas Wilder]]\n|parents = *Mother\n*Father\n|other family = *Trudy ''(cousin)''\n*[[Frances Wilder]] \u ''(mother-in-law)''\n*[[Adam Wilder]] ''(brother-in-law)''\n|job = *[[Attending]] [[Psychiatry|Psychiatrist]]\n*Author\n|workplace = '''Current'''<br>[[Seaside Health and Wellness]]\n'''Former'''<br>[[Oceanside Wellness Group]]\n|first appearance = *'''[[Grey's Anatomy|GA]]:''' [[The Other Side of This Life, Part ]]\n*'''[[Private Practice|PP]]:''' [[In Which We Meet Addison, a Nice Girl From Somewhere Else]]\n|last appearance = *'''[[Grey's Anatomy|GA]]:''' [[The Other Side of This Life, Part ]]\n*'''[[Private Practice|PP]]:''' [[In Which We Say Goodbye]]\n|count = \n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]] \n*'''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], and [[Season  (Private Practice)|]]\n|portrayed by = [[Amy Brenneman]]\n}}\n{{Quote|You're not done. Right? You're unfinished. You're work in progress. I mean, if I had told you  years ago that you were gonna have Lucas the way that you did, or that you were gonna marry Pete, you would've laughed at my face. Right? If I had told you  years ago that you'd be a widow, you would never have believed me. Because you don't know what tomorrow brings. You know? It could be anything, absolutely anything. Could be good, could be bad. Could be this hot bookstore owner guy, or could be just you and your amazing little boy. But you don't know, because you're not done. I mean, you won't know the point of the book until it's written. The book that is your life is a work in progress. So you, Violet Turner, you're unfinished.|'''[[Sam Bennett]]'''  to '''Violet Turner'''}}\n\n'''Violet Turner''' is a psychiatrist at [[Seaside Health and Wellness]]. She was married to [[Pete Wilder]] until his death and together they have a son, [[Lucas Wilder|Lucas]].\n\n\n\nDuring her freshman year of college, Violet was raped when a man broke into her dorm and helped through it by her best friend [[Kara Wei]], Violet helped Kara through her problem of accidentally killing her abusive mother.<ref>[[Let It Go]], x (PP)</ref> Violet takes offense to women who lie about being raped,<ref>[[Past Tense]], x (PP)</ref> and when confronted about an almost conversation between her and Addison; Violet says that it's something that she wasn't going to talk about it, that \"it is what it is.\"\n\nThe rest of her college years were a dark time for her. She slept with three of her college professors, one of whom may have been a woman, as exploring her sexual boundaries was a way for her to take back her sexuality.<ref>[[The World According to Jake]], x (PP)</ref>\n\n\nOne of Violet's schizophrenic patients, [[Katie Kent|Katie]], who was pregnant but miscarried. She refused to let anyone perform a D&C to remove the dead tissue. After talking to Violet and Dell, she finally realized that her baby was dead. She allowed the doctors to perform a D&C.<ref>[[What Women Want]], x (PP)</ref>\n\nLater, Katie came to visit Violet at her house. She told her that Violet had her baby and that she wanted it back. Katie proceeded to inject her with a drug that left Violet paralyzed from the neck\uadown and began to lay out surgical instruments and a medical textbook to perform a c-section, all the while talking about how Violet's baby died so Violet took Katie's. Violet tried to coach Katie out of it, saying that Violet's baby was a boy, while Katie's a girl. She said that she believed Katie and that they both love the baby, and if Katie would begin to cut, the baby might get hurt. Then, the baby kicked, which Katie thought was a calling and became even more convinced to start. Violet asked her if they could wait, and Katie knocked her out as a result. Cooper came to the house, but was interrupted by a call and left, despite Violet's gagged attempts to call his name. Katie began to place the scalpel on Violet's abdomen, but Violet said that she was placing the scalpel too high, and began to instruct her through the c-section.<ref>[[Yours, Mine & Ours]], x (PP)</ref>\n\nShe was later found by Pete and Naomi, who called . She was brought to St. Ambrose, where Addison operated on her. In the operating room, Dell began to talk to her, despite knowing that she was unable to hear him. They contemplated removing her uterus, but Cooper said that wouldn't be what Violet wanted, though he later contradicted that when they found Violet's baby. Soon after, Violet began to crash, though Naomi was able to save her. After she got out of surgery, she chose the baby's name, Lucas.<ref>[[A Death in the Family]], x (PP)</ref>\n\nShe was later released from the hospital and went home with Pete and Lucas. She had trouble connecting to Lucas, leaving most of the primary care and parenting to Pete. She also had a new-found fear of answering the door, usually hiding in the closet whenever someone knocked or rang the doorbell. She assured Pete that she was fine and that he could go back to work, but he was skeptical.<ref>[[The Way We Were]], x (PP)</ref>\n\n\nAfter she had recovered from the attack, Violet tried for a while to take care of [[Lucas Wilder|Lucas]]. However, she came to the conclusion that she couldn't take care of him and that she had to take care of herself before she could do that for her son. Violet left Lucas with\ua[[Pete Wilder|Pete]], his father. Sometime after that, she left the practice while on a trip with [[Cooper Freedman|Cooper]]. She stayed for a while in Costa Rica and New York. In New York, she sought professional help from a colleague to handle her trauma. Later she returned to LA where she told Pete that she wanted to be a part of Lucas' life. Pete was hesitant at first, but ultimately Violet got to know Lucas.\n\n\nWhile healing from the attack, Violet found consolation in writing. She wrote an -page memoir about the specifics of her life, including working at the practice and her attack. One of her friends pushed her to publish it, and after gaining the support of her friends at the practice, she ended up publishing the book and titling it \"Beautiful Scars.\" \n\nHer attacker, [[Katie Kent]], filed a lawsuit against her claiming that it breached doctor-patient confidentiality and affected her healing process. Despite the restraining order against Katie, Violet visited Katie at the restaurant she worked at and tried to convince her to drop the charges. Katie then visited Violet's office that night trying to apologize for all the pain and trauma she caused and dropped the charges.\n\nFollowing the lawsuit, the medical board opened an investigation regarding Violet's medical license. After a few interviews, they chose to suspend her license. They also started coming after [[Oceanside Wellness Group]] for the same concerns - breaching doctor-patient confidentiality. While this was all happening, Violet decided to go on a book tour for a couple of weeks, causing a strain in her marriage with Pete.\n\n\n\n\nViolet is very patient and optimistic. She is shown as a great person to talk to and will help when someone is in a bind.\n\nViolet tells her patients that happiness can be attained with focus, but she has trouble finding happiness in her own life, even going so far as to question the usefulness of her profession.\n\n\n\n[[Allan]]\nSix months prior to when Addison first arrived at their Oceanside Wellness Group, Violet's boyfriend, Allan, had split up with her and she was torn by the break-up. As she started to heal, she ran into Allan in a supermarket to discover that he'd gotten married to a younger woman only a few months after their break-up. Violet was shaken badly and even went as far as \"stalking\" Allan with constant calls as she tried to deal with him moving on while she kept trying to. She and Allan tried to be friends but Violet realized she was only hurting herself and cut off all contact.<ref>[[In Which Addison Finds a Showerhead]], x (PP)</ref>\n\n[[Sheldon Wallace]]\nViolet decided she wanted to sleep with both Pete and Sheldon. When she got pregnant, she didn't know who the father was and freaked out. The men agreed to a paternity test, but she didn't do so for the remainder of the pregnancy nobody knew who the father was. Sheldon was also in love with Violet at this point, as was Pete, and Violet didn't know who to choose.\n\n[[Pete Wilder]]\n[[File:PPx-.jpg|thumb|right|px|Pete kisses Violet.]]\nWhile she was pregnant with her son Lucas she was unaware who the father was. It could have been either [[Pete Wilder]] or [[Sheldon Wallace]], although she had expressed an intention of keeping the baby and having [[Cooper Freedman|Cooper]] move in with her.\n\nAs Pete's relationship grew more serious with Lisa, he told her about Violet's baby. She asked him to figure out what he wanted and eventually, he decided to leave her and tell Violet but before he informed Violet, Sheldon proposed to her. Violet didn't answer straight away, Pete instead tells Violet he should have fought for her and loves her, and she chooses Pete over Sheldon.\n\nAfter Lucas was ripped from her womb by Katie<ref>[[Yours, Mine & Ours]], x (PP)</ref>, she didn't feel anything toward him and even though Pete (the father) tried and tried to get her to bond with him, she eventually gave him up to Pete. After she slept with Addison's father, Pete gave up on her.\n\nAfter a few months, Violet returned from her trip from Costa Rica healthy<ref>[[Second Choices]], x (PP)</ref> and she sued for partial custody of Lucas.<ref>[[War]], x (PP)</ref>\n\nShe and Pete got back together and quickly got married.<ref>[[Take Two]], x (PP)</ref> They fought when she wanted to adopt [[Betsey Parker|Betsey]].<ref>[[A Better Place to Be]], x (PP)</ref>\n\nAfter her license was suspended, she ran to do a book tour, missing him having a heart attack. She got back from the airport as he was in surgery. It was after months of arguing and remaining together that they decided to separate.\n\nAfter they had both dated other people and took a small break from their marriage they soon realized that they still had feelings for one another. Violet decided that they needed to go to counseling to find out what the problem was but Pete just wanted to \"have fun\" and enjoy the fact that they were okay. They went to a few counseling sessions but Pete stormed out of one and refused to go to another one. He began working a lot and he became very reckless even landing himself in jail for taking a patient off of life support to respect his undocumented wishes. After Violet begged him to cooperate with the court for bail Pete was set free but was on trial for what he had done. After being together one night Violet asked him what would happen if he was taken back to jail. The next day Violet receives a text message from Pete saying that he went on a run and that whatever happened he loved her. Pete ends up being absent from his court hearing that morning and Violet had many doubts about his whereabouts assuming that he ran away from it all. Eventually, they found Pete's body in the ditch of a canyon dead from a heart attack.<ref>[[Aftershock]], x (PP)</ref>\n\n[[\"The Captain\" Montgomery]]\nViolet slept with The Captain while he was visiting Addison. While they had sex, she became embarassed about her scar, though The Captain said that it was a reminder that she survived something and she should do whatever she wanted to do for a while.<ref>[[The Parent Trap]], x (PP)</ref>\n\n[[Scott Becker]]\nWhen Violet calmed down an angry patient in the emergency room, Scott Becker, a paramedic, asked her out. She turned him down at first but after she saw that Pete was moving on, she agreed to go on a date with him, and it went well.<ref>[[The Standing Eight Count]], x (PP)</ref>\n\nHe spent the night, but Violet said she wasn't able to have sex with him. After Violet was punched by a patient's husband, she found Scott and he said that he was there for her after he treated her.<ref>[[Losing Battles]], x (PP)</ref> Later, after being confronted by Pete about their relationship, Violet decieded to have sex with Scott.<ref>[[The Time Has Come]], x (PP)</ref>\n\nScott later wanted for the relationship to progress, which meant to him meeting Lucas and Violet's friends. She told him that her life was complicated and that Scott made her feel good, helping her forget everything else in her life. All she wanted was detached, mind-numbing sex, which Scott agreed to.<ref>[[You Break My Heart]], x (PP)</ref>\n\nAfter Scott got injured following an attack, he asked for Violet, who came to the hospital and attempted, at first, to reduce his shoulder with Pete. She wasn't able to apply enough pressure until Pete encouraged her to trust him. Scott later told her that he saw how they talked with each other and they deserved to be a family, effectively breaking up with her.<ref>[[The Letting Go]], x (PP)</ref>\n\n\n[[Cooper Freedman]]\n[[File:PPx-.jpg|thumb|left|px|Cooper and Violet, best friends.]]\nWhen she joined the [[Oceanside Wellness Group]], Cooper became her best friend.\n\nIt became a tradition that every year when they received their bonuses, they would take a holiday together. Violet became concerned when Cooper didn't want to go on their annual trip, and their relationship was strained when she figured out that Cooper was sleeping with Charlotte King.\n\nDuring her pregnancy, she had Cooper to run errands for her, including tying her shoes because she couldn't see her feet. Unexpectedly, Charlotte and Violet began to bond over Cooper and Charlotte did the girly things that Cooper could not, as well as helping Violet with her pregnancy symptoms.\n\n[[Kara Wei]]\n[[File:PPx-.jpg|thumb|left|px|Kara and Violet hug.]]\nViolet met Kara in college and the two became best friends. When Violet was raped, Kara helped her through it, but Kara never told her of the abuse she went through as a child.\n\nKara and Violet met again when Kara was running for congress. She explained to Violet how she was depressed after the abuse she went through as a child, so she went through shock theraphy. She wanted that file destroyed since she was concerned that it would ruin her career if a reporter got a hold of it.\n\nThey later had lunch together. and Violet told Kara that she shouldn't hide from her past. She had an opportunity to be good, to embrace what happened to her and go public with the shock therapy. Kara was enraged and said Violet that she didn't go public with her rape and that she was with Violet every step of the way as she buried it. Violet said that it was different and mental illness was nothing to be ashamed of, and that it could help lots of people if they knew that there was no shame in talking about that.\n\nTheir friendship ended when Violet gave her an ultimatum: to choose her friendship or her career, and choose the person she was or the person she wanted to be. When Violet gave her the file, Kara immediately started shredding the file with no hesitation, and Violet left.<ref>[[Let It Go]], x (PP)</ref>\n\n[[Addison Forbes Montgomery|Addison Montgomery]]\n\nAfter Naomi moved away with Fife and Betsey to New York, Addison was without a person to complain to and work through her problems with and Violet was in desperate need of a female friend to do just that with. One day Violet asked Addison if she wanted to come to lunch with her and Lucas. She and Addison started talking and complaining to each other and started to help each other get through their unrealistic amount of drama. Then Addison asked if they should be friends and Violet said yes. From then on Addison and Violet would go out for coffee (or tea in Violet's case) and walk into each other's offices unannounced to tell each other about their issues. Addison figured out what she needed to do about her relationship with Sam and Violet figured out what to do about her relationship with Pete with help from one another. Eventually they grew to be really good friends who helped each other through a lot.\n\n[[Naomi Bennett]]\nShe was a very good friend to Naomi, but when [[Addison Forbes Montgomery|Addison]] joined the practice, Naomi forgot about her and started talking to Addison like she did with Violet, instead, casting Violet aside.\n\n\nViolet attended the University of Oregon, and pursued medicine at [[Harvard Medical School]].\n\nDr. Violet Turner is a [[Board Certification|board certified]] [[Board Certification#American Board of Psychiatry and Neurology|psychiatrist]] specializing in general adult and adolescent psychotherapy, diagnosis, evaluation, and management of pharmacological medication. She currently works at [[Seaside Health and Wellness]].\uaShe is licensed to screen birth mothers and prospective parents.\n\nShe is a member of the American Psychiatric Association and the American College of Psychiatrists. Dr. Turner has presented papers at numerous professional conferences and has published articles in peer-reviewed journals such as American Journal of Psychiatry and Annals of Clinical Psychiatry.\uaShe used to counsel rape victims and she ran the suicide hotline.\n\nShe got her license suspended due to using details of patients in her book, most notably [[Katie Kent]]. It was re-instated a few months later.\n\n\n*Out of all characters that have been on ''Private Practice'' for all six seasons, Violet is the only one who has never been to\ua[[Seattle Grace Hospital]],\uanor any of the hospitals that were established there later on.\n*Violet thinks she can dance, but according to others, she really can't.\n*Violet has had two abortions during a \"misspent youth\".<ref>[[Crime and Punishment]], x (PP)</ref>\n*She lost her virginity at the age of  and there was no magic about it, as there was a lot of friction.\n*She plays air guitar.\n*Violet does not like grass.\n*Violet drinks tea, not coffee.<ref>[[Good Grief]], x (PP)</ref>\n*She hates iced tea.<ref>[[Good Grief]], x (PP)</ref>\n*She despises soup, though she drinks it when she's queasy.<ref>[[What Women Want]], x (PP)</ref>\n*Violet is the last doctor to be seen treating a patient on\ua''[[Private Practice]]''.\n*She's also the one who said the last line on the show, aside from laughter from her colleagues.\n*She wrote a book named \"Beautiful Scars\"<ref>[[A Step Too Far]], x (PP)</ref>, and later another one, tentatively named \"Private Practice\".<ref>[[In Which We Say Goodbye]], x (PP)</ref>\n*She's pro-choice.<ref>[[Crime and Punishment]], x (PP)</ref>\n*She likes Mark Twain.<ref>[[Crime and Punishment]], x (PP)</ref>\n*She isn't religious.<ref>[[Crime and Punishment]], x (PP)</ref>\n*Her address is  Las Brisas Canyon.<ref>[[A Death in the Family]], x (PP)</ref>\n\n\n<gallery widths=\"\" position=\"center\" orientation=\"landscape\" bordersize=\"none\" spacing=\"small\" hideaddbutton=\"true\">\nPPVioletTurner.png\nPPVioletTurner.png\nPPxVioletTurner.png\nPPxVioletTurner.png\n</gallery>\n\n{{GalleryLink}}\n\n\nThese episodes are Violet-centric or otherwise very informative about her life.\n*[[Let It Go]]\n*[[Yours, Mine & Ours]]\n*[[War]]\n*[[Take Two]]\n*[[Aftershock]]\n*[[Mourning Sickness]]\n*[[Good Grief]]\n*[[Full Release]]\n*[[In Which We Say Goodbye]]\n\n\n\n\n{{Violet Turner Appearances}}\n{{Scrollbox}}\n\n[[fr:Violet Turner]]\n[[de:Violet Turner]]\n\n{{DEFAULTSORT:Turner, Violet}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Doctors]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Trauma)]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (MFM)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Rebecca Hobart", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PPRebeccaHobart.png\n|name = Rebecca Hobart\n|status = Alive\n|diagnosis = *Pregnancy\n*Crohn's Disease\n|doctors = *[[Addison Forbes Montgomery]]\n*[[Sam Bennett]]\n*[[Violet Turner]]\n*[[Pete Wilder]]\n*[[Naomi Bennett]]\n|treatment = Psychiatric evaluation\n|parents = [[Mrs. Hobart]]\n|only appearance = [[In Which Addison Has a Very Casual Get Together]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]]\n|portrayed by = [[Mageina Tovah]]\n}}\n'''Rebecca Hobart''' was Addison and Sam's patient.\n\n\nRebecca left the hospital where she was on a psychiatric hold after seeing Sam on TV. She came to the practice with the hope that she would believe him. She was five months pregnant, but badly underweight. Addison said the baby was healthy despite being small. Rebecca said she'd had stomach problems her whole life and no one thought she could get pregnant. When [[Charlotte King]] came to the practice, she told them that Rebecca had been in and out of hospitals since she was eighteen and tests showed nothing. She'd been diagnosed with Munchausen syndrome. Addison made a case to keep her at the practice to be treated as she was having contractions. She wasn't convinced that Rebecca had Munchausen and asked Violet to do a psychiatric evaluation after she stopped Rebecca's contractions. Violet said she didn't seem to match the Munchausen profile.\n\nRebecca's mother arrived to take her back to the hospital. Her labs showed that she hadn't eaten in days, though she protested she had been eating, so Addison let them take her, but before they could leave, Sam made a case to keep her for a little longer to figure out what was really wrong. Mrs. Hobart agreed to give them one more hour.\n\nThey took her back to the hospital, but the doctors convinced Charlotte to let them run a GI study, which they used to diagnose her with Crohn's disease.\n\n\n\nShe has a boyfriend.\n\n\nRebecca's mother is her medical guardian. When she learned that Rebecca had Crohn's disease, she apologized for not believing her.\n\n{{DEFAULTSORT:Hobart, Rebecca}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (General)]]\n[[Category:Patients (CAM)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Addison Forbes Montgomery", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = x-.jpg\n|name = Addison Adrianne Forbes Montgomeryp\n|born = [[Timeline|]]; [[Connecticut]]\n|status = Alive\n|alias = *Satan\n*Addison Shepherd\n*Ruler of All That Is Evil\n*The She-Shepherd\n*Red\n*Addie\n*McHotty\n*Gyno-Beast\n*Monty\n*Kitten\n*Meryl Streep of Maternal-Fetal Medicine\n*The Eggless Wonder\n*Mrs. McDreamy\n*McSlut\n*Wicked Witch\n|title = M.D., [[Fellow of the American College of Surgeons|F.A.C.S.]], [[Fellow of the American College of Obstetricians and Gynecologists|F.A.C.O.G.]]\n|marital = *[[Derek Shepherd]] \u ''(ex-husband)''\n*[[Jake Reilly]] ''(husband)''\n|children = [[Henry Montgomery]]\n|siblings = [[Archer Montgomery]]\n|parents = *[[Bizzy Forbes]] \u\n*[[\"The Captain\" Montgomery]]\n|grandparents = Grandfather\n|other family = *Three sisters-in-law\n*Mother-in-law \u\n*Father-in-law\n*[[Amelia Shepherd]] ''(ex-sister-in-law)''\n*[[Christopher Shepherd]] \u ''(godson)''\n*[[Susan Grant]] \u ''(stepmother)''\n*[[Angela Reilly]] ''(step-daughter)''\n|job = '''Current'''<br>\n[[Attending]] [[Obstetrics and Gynecology|OB/GYN]]<br>\n[[Attending]] [[Fetal Surgery|Fetal Surgeon]]<br>\n[[Attending]] [[Neonatal Surgery|Neonatal Surgeon]]<br>\n[[Attending]] [[Medical Genetics|Medical Geneticist]]<br>\nDirector<br>\n'''Former'''<br>\n[[Attending#Department Head|Head]] of [[Obstetrics and Gynecology|OB/GYN]]<br>\n[[Attending#Department Head|Head]] of [[Neonatal Surgery]]\n|workplace = '''Current'''<br>[[Seaside Health and Wellness]]\n'''Former'''<br>[[Seattle Grace Hospital]]<br>[[Oceanside Wellness Group]]<br>[[New York Hospital]]\n|first appearance = *'''[[Grey's Anatomy|GA]]:''' [[Who's Zoomin' Who?]]\n*'''[[Private Practice|PP]]:''' [[In Which We Meet Addison, a Nice Girl From Somewhere Else]]\n|last appearance = '''[[Private Practice|PP]]:''' [[In Which We Say Goodbye]]\n|count = \n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], [[Season  (Grey's Anatomy)|]], and [[Season  (Grey's Anatomy)|]]\n*'''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], and [[Season  (Private Practice)|]]\n|portrayed by = [[Kate Walsh]]\n}}\n{{Quote|Then slowly, over time, everything changes. And you're no longer this young thing, and you don't believe in fairytales and \"perfect\" isn't in your vocabulary. And then suddenly, here is this man and he becomes so familiar to you that one day you find yourself looking at him thinking I could love this person for the rest of my life.|'''Addison Montgomery'''}}\n\n'''Addison Forbes Montgomery''' (formerly '''Montgomery-Shepherd''') is a double\uaboard-certified [[Obstetrics and Gynecology|OB/GYN]], subspecializing in [[Maternal-Fetal Medicine|maternal-fetal medicine]]/[[Fetal Surgery|fetal surgery]], a\ua[[Neonatal Surgery|neonatal surgeon]]\ua(one of the foremost in the country) and a\ua[[Medical Genetics|medical geneticist]]\uaat the\ua[[Seaside Health and Wellness]]. She is married to\ua[[Jake Reilly]]\uaand mother to [[Henry Montgomery]].\n\n\n\nAddison was born in [[Connecticut]] in  into a wealthy background with her brother [[Archer Montgomery|Archer]], father [[\"The Captain\" Montgomery|\"The Captain\"]]\uaand mother [[Bizzy Forbes|Bizzy]].\n\nWhen she was seven, she fell off her bike in the vineyard while going downhill because her tire came off. She flipped over the handlebars and scraped her face on the ground, but [[Archer Montgomery|Archer]] picked her up, told her it was going to be okay, and carried her the half a mile back home. This is how Addison has always seen her older brother, as the big brother who carried her home. \n\nFrom the age of eight, Addison was mixing her father, [[\"The Captain\" Montgomery|The Captain's]] drinks.\n\nWhen she was , Addison also had to deny her father's affair with his secretary, waiting for \"daddy\" while he was having sex in his office and then pretending she had fun getting ice-cream with her father. Her father also had affairs with (among others)  maids,  of Addison's nannies, Jolene her French tutor, and the chef. She only discovered in adulthood that it was her mother who had cheated first, with a woman but chose to stay married because she already had a family. The Captain knew but also stayed with her, but had affairs with other women.\n\nWhen she went to prom in high school, it was with Skippy Gold. Addison was a band geek with braces and a lisp, and she was forced to talk about ''[[Star Wars]]'' the whole night.\n\nAddison attended college at Yale University and medical school at [[Columbia University College of Physicians and Surgeons]] where she met her future husband,\ua[[Derek Shepherd]]; [[Sam Bennett]], a future boyfriend; [[Mark Sloan]], her future lover; and [[Naomi Bennett]], her best friend.\n\nAddison is entitled to a twenty-five million dollar trust fund and owns three properties: a\ua[[New York]]\uabrownstone, a house in\ua[[The Hamptons]], and a house at\ua[[Santa Monica]]. She now lives beside a beach in\ua[[Malibu]]\uanext door to an old friend,\ua[[Sam Bennett]].\n\n\nAddison cheated on her husband of over  years,\ua[[Derek Shepherd|Derek]]\uawith his best friend\ua[[Mark Sloan]]. Before this, Addison and Derek's marriage had been an unhappy one, as Derek had been putting in little effort. Derek even mentioned that the demise of their marriage was not her fault alone. They each owned their respective practices, putting a strain on their marriage. When he found Mark and Addison in bed together, he simply walked away.\n\nDerek then picked up his life in New York, sold his private practice, and relocated to Seattle. This is where he began his relationship with\ua[[Meredith Grey]], who later became his wife.\n\n[[File:xAddisonIntroduction.png|thumb|Addison introduces herself to Meredith.]]\nUpon Richard's request to help out with a patient, Addison visited Seattle. When she arrived at the hospital, she saw Derek fixing Meredith's coat in the lobby. Derek turned around and was shocked to see her, his expression enough for Addison to put the pieces together. She walked over and he asked her what she was doing here. She said he'd know if he had bothered to return any of her calls. She then introduced herself to Meredith as Derek's wife, much to Meredith's surprise. She guessed that Meredith was the woman who had been screwing her husband.<ref>[[Who's Zoomin' Who?]], x</ref>\n\nMeredith ran off, leaving the married couple to talk. She mentioned that his hair looked different, comparing it to Russell Crowe's. He asked her again what she was doing there. She returned the question, pointing out he had abandoned his entire life in New York City. She also brought up his new Seattle girlfriend, who was young, sweet, and in awe of his being a neurosurgeon, whom she summarized as the 'anti-Addison.' He told her to forget about winning him back. She made it clear that was not her intention and stated she was there for a TTTS case on Richard's request. She assumed Richard would have told him. She leaned in and told Derek that she'd always had a thing for Russell Crowe before walking off with a satisfied expression. She went to see Richard, with whom she had a joyful reunion, until Derek interrupted to vent his frustration. Addison left him to it.\n[[File:-.jpg|thumb|Addison and Derek discuss her requesting Meredith for her case.]]\nThe next morning, Addison specifically requested Meredith for the TTTS case. Together, they went to see the patient. In the room, Addison bombarded Meredith with questions. Once outside, Meredith said she could have answered the question had Addison given her the time to do so. Addison commented she was tough on everyone, not just the women sleeping with her husband. She gave Meredith further instructions. Later, Meredith interrupted Addison and Derek talking about her surgical skills to brief Addison about abnormalities found on the ultrasound. Due to signs of heart failure in the babies, they had to operate sooner than planned. Meredith watched closely as Addison worked her magic in the OR. As they checked on Julie after the surgery, Julie requested Meredith be thrown off her case since she had overheard Addison's comment about Meredith sleeping with her husband. Addison then clarified that she had cheated on Derek so the wronged woman here was Meredith, whom she said deserved an apology from Julie.<ref>[[Raindrops Keep Falling On My Head]], x</ref>\n\nAddison went to visit Richard in his room and found him in the company of Derek and Adele. Adele was delighted to see her and commented that she knew Addison and Derek would get back together, but Derek firmly said that adultery was enough to end their marriage. Later, Addison asked to talk to Meredith and inquired if Derek had told her why he had left her. Meredith said she had nothing to do with that situation. Addison was surprised and impressed to find out that Meredith had not taken Derek back. She added that there are two sides to every story and implied that her cheating on Derek with his best friend had been a desperate attempt to get his attention. At the end of the day, Addison ended up on an elevator with Derek. They shared what they had each told Meredith about their situation. Derek scoffed at the idea of Addison sleeping with Mark to get his attention. Addison replied that she was just scratching an itch by that point and Mark was just there, but it was preceded by years of them getting busy with their careers and lazy in their marriage. Derek made it clear he was not interested in Addison's explanation.<ref>[[Enough is Enough]], x</ref>\n\nLater, Addison moved into Derek's trailer, and the two attempted to reconcile. Addison asked Derek if they were even after she got poison oak from walking Meredith's dog in the woods. The two laughed over the incident. They divorced after Addison found a pair of women's underwear in Derek's pocket.\n\nAfter the divorce, Addison had to put Derek in a tiny box and make him petty and insignificant to get up in the morning.\n\n\nAddison had very little in Seattle after she and Derek divorced. Her marriage with Derek was over, her relationship with Mark had completely vanished, and her attempt at a relationship with [[Alex Karev]]\uafailed. She visited Los Angeles to see her friends [[Naomi Bennett|Naomi]]\uaand\ua[[Sam Bennett]], also because Naomi was a fertility specialist.\uaNaomi offered her a position at\ua[[Oceanside Wellness Group]].ꫝison returned to Los Angeles not long after that, taking Oceanside Wellness up on their job offer at their practice. One day, Addison searched through Naomi's files at the practice to read her file and found that her chances of becoming pregnant were worse than she'd previously imagined. She learned that her egg count was a mere two, and was heartbroken.\n\n\n[[Image:x-.jpg|thumb|left|Addison returns to [[Seattle Grace Hospital|Seattle Grace]]. ([[Piece of My Heart]])]] Later, Addison returned to [[Seattle Grace Hospital]] to treat a pregnant woman suffering from [[Piece_of_My_Heart#Medical_Notes|ectopia cordis]], in which the fetus's heart was growing outside of the body. Although she seemed somewhat happy to be back in Seattle, she made it clear that the visit wasn't permanent and she had every intention of returning to [[Oceanside Wellness Group]]. Addison also showed that the history between her, [[Meredith Grey|Meredith]], and [[Derek Shepherd|Derek]] was in the past as she was able to hug Meredith and be genuinely happy for them, unaware that they had broken up.\n\nDuring her stay, in which the surgeries on both mother and child were successful due to Addison, [[Mark Sloan|Mark]], and [[Erica Hahn|Erica's]] expertise, Addison was forced to realize that a lot had changed in her absence (particularly [[The Heart of the Matter|the breakdown of Callie and George's marriage]], [[A Change is Gonna Come|Meredith and Derek's break up]], and his [[Crash Into Me, Part |relationship with Rose]], as well as [[Lay Your Hands on Me|Bailey and Tucker's marital issues]].)\n\nWhen [[Richard Webber|the chief]] approached her and attempted to persuade her to stay at Seattle Grace, Addison told him that she now knew it was the right thing to leave and told him to fill her position. Before returning to Los Angeles, however, Addison went to [[Emerald City Bar|Joe's bar]] and warned [[Meredith Grey|Meredith]] that, even though she was now zen, she wanted to \"kick her ass\" for not fighting for [[Derek Shepherd|Derek]] and allowing his new girlfriend to have the happily ever after that she deserved.<ref>[[Piece of My Heart]], x</ref>\n\n\n[[File:PPx-.jpg|thumb]] Addison's status in the dating world remained uncertain as she had been stood up by [[Kevin Nelson|Kevin]] after she went to find him at the station, and remained unaware that [[Pete Wilder|Pete]] had gone to her house the same night. Sometime later, Addison and [[Naomi Bennett|Naomi]] found themselves at odds regarding Naomi allowing a couple to conceive a child through Naomi's fertility treatment who would act as an organ donor for their ill child. When the parents demanded Addison birth their child three months premature, an ethical debate raged between Addison and Naomi. Addison eventually learned Naomi agreed to help the couple due to the practice's financial trouble that she was concealing from the group. Despite Naomi's pleas, Addison told [[Sam Bennett|Sam]] that the practice was in trouble. At the same time, [[Kevin Nelson|Kevin]] returned for Addison to tell her that he stood her up to train for the SWAT team and the two flirted, leaving their future ambiguous.<ref>[[A Family Thing]], x (PP)</ref>\n\nArmed with the knowledge of the practice's struggles, Sam and Addison formed a hostile takeover of the leadership of the practice and each doctor worked to save the practice from extinction. Addison and Naomi's friendship, however, couldn't stand what Naomi saw to be a betrayal and Naomi cut her best friend out of her personal life, leaving only professional ties.<ref>[[Equal and Opposite]], x (PP)</ref>\n\nWith her 'family' at the practice in disarray, Addison took [[Charlotte King|Charlotte's]] offer to do some surgeries for [[St. Ambrose Hospital|St. Ambrose]], for her to relieve her frustrations which she claimed 'fall away' when she holds a scalpel. However, rushed off her feet and desperate to do nothing but cut Addison spent no time conversing with her patients and getting to know them. When a stressed and worried husband of a pregnant patient asked her what his wife's name was, and she was unable to answer, she realized that she had become the one who wasn't talking and decided to return to family at the practice for good, refuting Charlotte's offer to work at St. Ambrose full-time. This persuaded her to move forward with [[Kevin Nelson|Kevin]] as well as attempting to repair her friendship with Naomi.<ref>[[Nothing to Talk About]], x</ref>\n\n\n[[Image:x-.jpg|thumb|left|px|[[Derek Shepherd|Derek]] tells Addison and [[Archer Montgomery|Archer]] that the cysts are inoperable.]] Having landed in Seattle, a worried Addison was greeted by [[Richard Webber|Richard]] and [[Derek Shepherd|Derek]] as Archer was prepared for a diagnosis. Derek discovered eight cysts caused by the parasites and, having consulted specialists, revealed that they were inoperable as surgery would cause more harm than good. A reluctant Addison refused to give up on Archer and told Derek that she needed him to be a God. As she attempted to pray in the hospital chapel, Addison confessed to [[Callie Torres|Callie]] that she didn't believe God knew who she was, and so praying for a miracle was worthless. Her old friend then reminded her that she saves babies, and God knows who she is because of it. Having received the push from [[Sam Bennett|Sam]], Derek decided to do the surgery. Addison watched on tenterhooks as Derek attempted to remove the parasitic cysts. When removing the eighth and final one, it ruptured, allowing the parasite to dig further into his brain. Addison, however, faced much relief when the parasite was caught, extracted and Archer stabilized. To celebrate Derek's success the old friends visited the [[Emerald City Bar]], where they reminisced about [[Derek's Song|Derek's love song to Addison]]. Addison however, recognized that Derek was in her past, and, despite her gratitude, she had to once again make him petty and insignificant to move on with her life.<ref>[[Before and After]], x</ref>\n\n\nAfter Violet was attacked and gave\ua[[Lucas Wilder|her baby]]\uato\ua[[Pete Wilder|Pete]], Addison became one of the principal caregivers to Lucas. She filled the void left by his birth mother and was overjoyed at the prospect of having a baby of her own. However, after Violet recuperated, Addison told Pete to go back to her, and subsequently lost touch with Lucas. She was, once again, left without a child of her own.\n\n\nAs\ua[[Mark Sloan|Mark]]\uawanted the best care possible for his daughter\ua[[Sloan Riley|Sloan]]\uaand was unsure of\ua[[Elizabeth Chen|Elizabeth Chen's]]\uaabilities, he had Addison fly in for the surgery. When Addison was operating, she realized it would be riskier than she thought. She was confident she could continue successfully, but Mark insisted that she stop. However, he later traveled with Sloan to Los Angeles so Addison could perform it. She did so successfully.\n\n\nSince Callie and Addison were close friends, Addison flew back to Seattle, at\ua[[Richard Webber|Richard's]]\uarequest after hearing that Callie had been in a car accident. She later performed an emergency C-section on Callie and delivered her daughter,\ua[[Sofia Robbin Sloan Torres]], prematurely.<ref>[[Song Beneath the Song]], x</ref>\n\n\nAfter Naomi left, Addison went to therapy.\n\nThe night Pete had a heart attack, Addison sat with Lucas and kept him comfortable until Violet was contacted and returned from the airport. She assured him everything was going to be okay, as Sam and Amelia were the best people to take care of him. Despite Sam still not having changes his mind about having a baby, Addison decided to go ahead anyway and made an appointment with the best fertility specialist she could find in the city. That man turned out to be\ua[[Jake Reilly]], her anonymous date she met flirting over pineapples. She then wanted to quit, but Jake had no problem leaving their flirtation in the past. He promised her he'd give her a baby.<ref>[[God Laughs]], x (PP)</ref>\n\nNot long after, Jake turned out to be applying for Naomi's job at the practice. Addison, being in charge, was hesitant to hire him. Meanwhile, she informed Sam she was going off birth control, so she had him buy condoms. After Jake assured her he had no ulterior motive and promised not to flirt, Addison had to face that he was the best candidate and officially hired him. Addison told her therapist that she didn't need to tell Sam about her Fiji history with Jake, as they were broken up at the time, and admitted that she finally happy again.<ref>[[Breaking the Rules]], x (PP)</ref>\n\nAddison started looking for IVF specialists to start the process. Needing someone to talk to, she grew closer to Violet, who also needed someone to talk to about her marriage problems. Sam later realized he needed to be there for his girlfriend and offered to listen to her talk about IVF specialists, but she told him she was fine. In therapy, she said she became a better and more generous person because of Sam.<ref>[[Deal With It]], x (PP)</ref>\n\nHowever, Addison soon realized she must be crazy to compartmentalize Sam and the baby, starting to fear Sam was going to leave her. She took her concerns to Jake after he told her some more about himself and his youth to make her trust him, but all Jake could tell her was to listen to her instincts. At night, she told Sam what she was worried about. He knew she was, but kissed her to tell her he wouldn't leave. However, in therapy, Addison still said she came to realize that maybe love means wanting the other person to be happy, even if they can't be with you.<ref>[[Remember Me]], x (PP)</ref>\n\nAddison started the IVF process with fertility drugs and asked Jake to inject them as she wanted to stay sexy for Sam, so he couldn't do it for her. Addison tried to keep it secret in order not to become the office gossip, but that became difficult when she soon started suffering from mood swings and extreme emotional reactions to what was happening at the practice. Addison started thinking Sam was just dating her because she couldn't have children, but Jake assured her that was just the hormones. He did tell her she needed people on her side, as she couldn't go through it alone. She then told Sam that she started the IVF process with Jake's help. He once again stated he didn't want a new child because the experience of having a child is as awful at times as it is wonderful, so he was glad to have gotten through it with Maya. He assured Addison that didn't mean he stopped loving her, though. In therapy, Addison said she had to teach herself to have hope again.<ref>[[Step One]], x (PP)</ref>\n\nSoon after, Addison started looking for sperm donors, throwing out lots of candidates based on medical history alone. When she felt like she was drowning in files, Sam assured her she could make it happen. Addison asked her colleagues for help, but they all give her different advice. Addison received good news from Jake: they were able to retrieve  eggs, which needed to be picked that day. He'd contact a friend at the sperm bank to speed up the process, meaning they could fertilize the eggs that day. Sam came to support Addison when Jake would pick the eggs, but she was already under. She woke up with Sam by her side and started crying because she put herself in this position where a stranger was needed to get pregnant, all because she cheated. Sam convinced her the bad things didn't outweigh her good qualities, so she shouldn't punish herself. He advised her to pick the musician's sperm. She did pick him, and later that day, Jake fertilized the eggs with Addison watching.<ref>[[If I Hadn't Forgotten...]], x (PP)</ref>\n\nOver the three days the embryo had to grow in the lab, Addison kept checking on it. She wasn't allowed to have sex before the implantation, but Sam suggested they do \"other things\". She happily agreed to that. Meanwhile, Addison also met [[Ryan Kerrigan]]\uaand expressed her worries over Amelia, who assured Addison she was fine.\uaThe day after, Jake implanted the eggs. In therapy, Addison said she was thrilled and terrified that if all things went right, there could be an entire person with a full life ahead could be growing inside her. She was looking forward to sharing experiences with her child.<ref>[[Don't Stop 'Till You Get Enough]], x (PP)</ref>\n\nAmelia went missing for  days, and when she showed up at the practice to announce her engagement to Ryan, Addison was both angry and relieved at the same time. Since Charlotte was convinced Amelia was using, they staged an intervention at the practice. Amelia started attacking them one by one and hit Addison's weak spot when she attacked her about her infertility and past abortion. Addison threatened to report Amelia to the medical board, throw her out of her house and change the locks, and call in her family, but the only thing that actually got Amelia to stay and listen was the oxy she demanded. The doctors gave her the oxy, which Amelia snorted off the reception desk. Right when Amelia seemed to cave to her friends' talks and agreed to go to rehab, Ryan arrived. The doctors suggested they also help Ryan, but a quarrel ensued when Addison noticed Ryan was wearing\ua[[Mr. Shepherd|Amelia's father's]]\uawatch. Amelia aggressively forbade her from telling that story and soon left with Ryan, leaving Addison to feel like the intervention was a bad idea. However, the next morning, Addison received a call about Amelia, who was ready to go rehab.<ref>[[Who We Are]], x (PP)</ref>\n\nAddison helped her pack and drove her to the treatment center. Amelia, who has a great mother, had Addison think that even the best mothers' kids can go down the wrong path. Later that day, Addison received the news that she was not pregnant, but Jake assured her that didn't mean it was over. Sam seemed relieved about the news, so Violet agreed to hold her hand the next time she was going to try. Addison came up with a crazy plan that included a lot of fertility drugs. She wanted to try again with fresh sperm and fresh eggs, even though she had two frozen eggs left herself. Addison took Sam to therapy with her as he needed to face there would be a baby in her life soon, but he said that was not a problem yet and that he wanted Addison. Two weeks later, Addison collapsed at the practice as a side-effect to the hormone treatment. That made her decide that the embryo transfer would be it: she'd either be pregnant or not. After she was fully recovered, they did the transfer. On Thanksgiving, Addison did a pregnancy test.<ref>[[The Breaking Point]], x (PP)</ref>\n\n\nIn\ua[[If/Then|Meredith's dream]], Derek and Addison are still in an unhappy marriage and Addison is pregnant with their child, though the child is later revealed to be [[Mark Sloan|Mark's]]. Also, Addison is still part of the surgical staff at [[Seattle Grace Hospital]] and remains the [[Obstetrics and Gynecology|OB/GYN]] and [[Neonatal Surgery|neonatal]] [[Attending#Department Head|head]].\n\n\nMere hours after delivering a baby at [[St. Ambrose Hospital]], Addison got a call from her social worker saying that a birth mom had chosen her. She returned to the hospital, shocked to find that it was [[Judi]], the same woman whose baby she had delivered. Judi had decided she couldn't find a better mom for the baby, and that it must have been fate since Addison was the one who delivered the baby boy. Addison named him [[Henry Montgomery]].\n\n\nAddison lost her way during the pandemic. Two months into the first lockdown, Jake and Henry were bickering about Game of Thrones and Addison couldn't bare it anymore, seriously considering to leave Jake. She got up off the couch, got in her car, and started driving for two hours before she stopped and asked herself what she was doing. Addison started to over-indulged in wine. Henry became obsessed with video games and Jake took up a model train hobby, which truly delighted him much to Addison's surprise. She grew increasingly uneasy spending so much time at home and at one point even considered checking herself into rehab for her drinking habits. She went even darker and started daydreaming about going to sleep and never waking up, which comforted her. Eventually, she came up with a research project on uterine transplants and met [[Tovah Freedman]]. The drive to help Tovah motivated Addison to pull herself back together and get out of bed every morning.\n\nAs part of her research, Addison eventually travelled to Seattle to perform a uterine transplant on Tovah, who had her support system in Seattle. Addison reached out to Richard if there was an OR available for her and agreed to make her return a grand rounds teaching opportunity for the residents, whom he mentioned were behind. On the day of the surgery, Seattle was going through a heatwave.\n\nAddison arrived at the skills lab to introduce herself to the group of residents. En route to the patient, she explained her research and quizzed Levi on the pelvic anatomy. When he answered correctly, she allowed him to present the case and upon seeing a connection between him and the Jewish patient, she chose him to scrub in with her along with Richard. The other residents gathered in the gallery to observe and Addison kept them engaged with a multitude of questions. In the middle of the procedure, the HVAC system broke down. The temperature in the OR quickly rose yet Addison refused to close up the patient despite Richard's warning about the risk of infection. To work faster, Addison requested Meredith due to her experience with microvascular anastomosis of the abdomen. Meredith soon joined her in the OR and they congratulated one another on their professional accomplishments. As they operated, Addison asked Meredith what big thing was next for her. Meredith revealed that she had some idea but she needed to sort out things logistically and have a difficult conversation with Richard. After evacuating a clot, Meredith and Addison successfully finished the procedure. As they left the OR, they heard the residents gossiping about the tension between them.\n[[File:xMeredithComfortsAddison.png|thumb|Meredith comforts Addison after opening up to one another.]]\nHowever, once alone on the elevator with Meredith, Addison broke down crying because coming here made Derek's death all too real for her. Meredith said he was there and in her kids is well, whom she invited Addison to meet over dinner at her house. Addison then told Meredith to fight for this big project if she believed in it, stating Meredith had never been one to shy away to fight for what she loved.\n\nAfterward, Addison went to check on Tovah in the ICU. Everything was well. Richard congratulated her and Addison told him the residents were not as bad as he had made them out to be. He couldn't help but point out the difference between the current generation and Addison and Derek's generation, stating the current residents complained a lot. Addison pointed out they were simply standing up for themselves and refusing to be worked to death in a system that could be considered inhumane. She considered that progress and stated there was always room for improvement in the medical education system. He agreed and told her he was glad to see her again. Addison then finally met up with Amelia in the lobby. After a long hug, Addison told her about Meredith's invitation. Amelia took her home and introduced her to Zola and Bailey. Addison got emotional upon meeting them and sat down with them to have ice cream for dinner.<ref>[[Hotter Than Hell]], x</ref>\n\nThe day after, en route to the airport, Addison was notified that Tovah had had a seizure in the ICU. Addison rushed back to the hospital and enlisted Amelia's help to figure out what was causing the seizures. Addison was panicking because Tovah's sister had begged her not to participate in the trial and it could mean that they would have to remove the uterus, meaning all had been for nothing. As they awaited the MRI scan, Amelia confided in Addison as to why she had left Scout's father. Upon hearing that Amelia had struggled so hard during the pandemic, Addison relayed her own experiences, which comforted Amelia. Eventually, they found that the seizure had been due to neurotoxicity from the anti-rejection medication. They decided to switch the meds and start anticonvulsants. Addison needed Amelia to tell her that Tovah would be okay as she absolutely prioritized Tovah's life over her study. Amelia pointed out that Tovah had loved her husband so much that she entered Addison's trial, very much aware of the risks it entailed. Tovah recovered in the ICU and Addison happily informed her that there was still a chance for her to have her husband's baby. On her way out, Addison recalled her frustration with Jake and posed that a slight mental health crisis doesn't make for good decision making. Amelia stated she stayed with Link through the pandemic because she deemed herself crazy to leave a good guy but she wasn't feeling crazy now nor did she feel the need to get high; she realized she just didn't want a ring or more babies, so she thought it the kindest and sanest thing to let him go. Addison smiled and commented that Amelia was all grown up now.<ref>[[With a Little Help From My Friends]], x</ref>\n\n\nAddison is a very confident, smart, and poised woman. She can be described as cold and unforgiving, however, she is also quite warm and kind. She is also very concentrated and dedicated to her work, as she is considered the best in her field. Addison is sometimes difficult and uncompromising but she can be very kind and accepting.\n\nAddison describes herself as a worrier; she constantly worries about what's happening and what's not happening. Professionally, she is very confident, but not personally. She likes to think that worrying prepares her for whatever may happen.\n\n\n\n[[Derek Shepherd]]\n[[Image:x-.jpg|thumb|left|px|Derek and Addison attempting to give their relationship another try.]]\n\nAddison met her future husband, [[Derek Shepherd]], in [[Medical School|medical school]] in the summer. Their relationship grew and they eventually married. Derek once wrote [[Derek's Song|a song]] for her.\n\nAfter medical school, Addison and Derek became extremely successful in their respective fields and each began their own practice in [[New York]]. However, this strained their marriage.\n\nAddison was married to Derek Shepherd for eleven years before eventually sleeping with Derek's best friend, [[Mark Sloan]], which prompted Derek to leave [[New York]] for [[Seattle]] at the request of their old friend and mentor, [[Richard Webber]].\n\nAfter she and Derek initially separated, she tried to get over him, even hoping that dying her hair blond would help. She remained in New York and lived with Mark for two months, during which she became pregnant with Mark's child but she chose to have an abortion. The relationship ended when Mark cheated on Addison and [[Richard Webber]] brought her to Seattle Grace for a consult on a difficult case.\n\nAfter a period of antagonism between her and Derek (in which he continually referred to her as \"Satan\"), Addison decided to stay on as the [[Attending#Department Head|Head]] of Neonatal Surgery and OB/GYN at Seattle Grace, signing a two-year contract after she and Derek decided to make an effort to work things out. Addison was unaware that Derek still had feelings for [[Meredith Grey|Meredith]].\n\nWhen Addison discovered that her husband slept with Meredith at the hospital-sponsored prom, Addison (in a drunken haze) called Mark Sloan to Seattle. She and Derek agreed that their marriage was over and started divorce proceedings. She asked Mark to go back to New York, but he stayed, expressing his desire to continue their relationship.\n\nWhen the divorce was finalized, Addison dropped the \"Shepherd\" from her last name. Wanting to make a fresh start, Derek happily relinquished most of their shared properties (their [[Brownstone]] in [[Manhattan]] and a residence in [[The Hamptons]]) to her believing that she deserved it as his initial impression was that she had only had a one-night stand with Mark while he carried on an affair with Meredith.\n\n[[Alex Karev]]\nShe stayed in Seattle for a long while after and a possibility of a relationship between her and [[Alex Karev]] was hinted at when they kissed in [[Emerald City Bar|Joe's bar]]. She felt it was too strange though and he said he didn't care so the relationship was not brought ahead any further.\n\nDuring the  days that Mark and Addison were trying to remain celibate to give themselves a chance, she slept with Alex. However, despite Addison wanting more, he wasn't ready for that.\n\n[[Mark Sloan]]\n[[File:x-.jpg|thumb|left|px|Addison sleeps with Mark]] Addison and Mark originally met in med school. She cheated on her husband, Derek, with him. After Derek left for Seattle, Addison and Mark lived together for two months, during which time she became pregnant. She had an abortion, and Mark eventually cheated on her.\n\nAfter finding out Meredith and Derek slept together at the prom, she called Mark over to Seattle and slept with him again. Mark decided to move to Seattle in hopes of pursuing a relationship with Addison.\n\nOn the first anniversary of the day she discovered she was pregnant, Addison and Mark made a deal. If they both could abstain from sex for  days she would be willing to try a real relationship with him. She doesn't hold up her end of the bargain when she engaged in a sexual encounter with Alex at the hospital. Mark learned of this after witnessing them stumbling out of an on-call room. She was spared from confessing, however, when Mark selflessly lied to her by telling her he had broken their promise long before. He felt that although he had feelings for her, she shouldn't have to feel guilty.\n\nMark visited Addison in LA when his daughter, Sloan Riley, needed surgery. They had sex several times, which prompted Addison to ask Mark if he truly wanted to have a relationship with her because she could make it work. However, Mark was still in love with Lexie, so he apologized to Addison and turned her down.\n\n[[Pete Wilder]]\n[[File:x-.jpg|thumb|px|Addison and Pete kiss.]] When she left [[Seattle Grace Hospital]] for a [[Oceanside Wellness Group|private practice]] in L.A, she had a brief interest in her co-worker [[Pete Wilder|Pete]] (whom she kissed) but gave up on any potential romance between the two after Pete stood her up for a date.\n\nLater, Pete and Addison reconnected at a hospital event and went back to her house to have pizza and watch lame TV shows, and ended up having sex. They started a relationship that they described as \"helping each other\" and Addison decided to move on from [[Sam Bennett|Sam]] since he was seemingly happy with his new girlfriend, making them officially a couple.\n\nWhen Pete was sick and Addison was looking after Lucas, Pete said \"I love you, [[Violet Turner|Violet]]\" to Addison while on fever medication, leading Addison to confront Pete six weeks later. Pete states that he will always love Violet as she is the mother of his child, but he wants to be with Addison.\ua\n\nViolet returns from Costa Rica and Addison tells her that Pete will pick her because she is Lucas' mother.\ua\n\nLater on the porch, Sam tells Addison he is sick of doing the right thing and should do the wrong thing, and then kisses her as Pete walks in.\ua\n\n[[Kevin Nelson]]\n[[File:PPx-.jpg|thumb|Kevin and Addison sharing lunch in between surgeries.|xpx]] Addison was then asked out by [[Kevin Nelson]], a police officer. Unfortunately, her trust issues interfered with her and Kevin, issues that resulted in her jealously following Kevin after she thought he was having an affair and ending with her arrest by the SWAT team. Nonetheless, she confessed her issues to Kevin and they resumed their relationship.\n\nBut more troubles came when [[Archer Montgomery|Addison's brother]] came to visit and told Kevin that she was just \"enjoying him\". When he hadn't called Addison back; she had thought he was avoiding her, but would find out he had been shot. When her brother left; Kevin moved in with her while he was recovering. While Addison now had to deal with Charlotte who was opening up a competing practice on the fourth floor, she was more annoyed by [[Wyatt Lockhart|Dr. Wyatt Lockhart]], a doctor working for Charlotte's practice who steals a patient of Addison's and convinces Naomi to work for her. In the midst of this relationship, Addison and Kevin's different lifestyles get in the way of their relationship leading to him moving out. But Addison later calls him telling him she misses him, and they make up.\n\nHowever, Addison kisses Wyatt after seeing him for who he really is, not the arrogant, headline grabber she thought he was. Kevin repeatedly questions her where she was that night and believes she's lying, Addison claims she was working, and just as Kevin was finally able to drop the questioning, she admits she kissed another man, and they break up. As Addison goes to Wyatt to try a new relationship, she catches Naomi having sex with Archer instead.\n\n[[Noah Barnes]]\nNoah and Addison frequently met in the scrub room over three months, one of them always finishing surgery and scrubbing out and one scrubbing in, leading to their greeting of \"Finishing or starting?\". They both continued to flirt, not knowing each other's names, and eventually meet in the doctor's lounge where Noah asks for her name. Looking shocked, he quickly leaves.\n\nAddison later meets him as the husband of one of her pregnant patients, Morgan Gellman. Upon this discovery, Addison quickly removed herself from Morgan's case, as she was not comfortable with her feelings for Noah while she treated his wife, feelings which Noah reciprocates. Addison decides not to make a move in their relationship, refusing to be a homewrecker, after her past mistakes with her ex-husband and his best friend. Noah, however, asks her not to leave the case, as she is the best in her field and Morgan cannot lose another child (she had a string of miscarriages before seeing Addison), and he will keep his feelings for Addison in check. However, Noah cannot help the way he feels, and Morgan realizes her marriage is in jeopardy, asking Addison to save her child, as that is all that is keeping her and Noah together. She says she sees it in Noah's eyes, he's there, but he's not quite there. When Addison has to perform surgery on Morgan, Noah is not there for her and Morgan is willing to put off the surgery to have Addison find Noah and he eventually does go into the OR to be there for Morgan, with a push from Addison.\n\n[[Sam Bennett]]\nSam asked Addison out when they were in med school, but Addison declined because [[Naomi Bennett|Naomi]] was in love with him. When Addison moved to LA, she bought the house next door to Sam, leading to their developing friendship.\ua\n\nAddison and Sam kissed after a hiking experience gone wrong while discussing what would have happened had Addison said yes to Sam in med school. They kissed twice more and Sam propositioned Addison to develop their relationship, but Addison said no because Naomi was her best friend.\n\nSam dated another [[Pediatrics|Neonatal]] surgeon, leading Addison to date [[Pete Wilder|Pete]], although she still loved Sam, and she is seen constantly talking about him to Pete. Sam and Addison had an off and on relationship for a long time. \ua\n\nThe main reason for their relationship troubles was that Addison wanted a child, but Sam had Maya, and Maya's daughter, and didn't want more kids. After Addison adopted Henry, Sam seemingly accepted Henry. He even asked her to marry him after Addison and Jake had had sex.\ua\n\n[[Jake Reilly]]\nWhen Addison's therapist told her to make a change in her life, she met Jake and they flirted over pineapples at the grocery store. They started seeing each other at a coffee shop. However, they both agreed to keep their identities in secret. Jake was going on vacation to Fiji and he asked Addison to come with him. She eventually accepted, but when at the airport, she realized it wasn't right to try to avoid Sam and the problems the practice was suffering.\n\n[[File:PPx-.jpg|thumb|left|Addison and Jake at their wedding.]] Later on, Addison started her fertility treatment only to find out her doctor was Jake. He admitted he never left for Fiji. Addison, humiliated, left the office.\n\nWhen Jake interviewed for the fertility specialist opening at Oceanside Wellness, Addison was horrified because she recognized him as her former doctor. She was strongly opposed to the practice hiring him, but she ran out of excuses not to, as he was the perfect candidate for the job. Jake began working at the practice, and Addison made him not mention their previous encounters to Sam, who she was dating at the time of Jake's arrival.\n\nAddison began fertility treatments with Jake as her doctor. He helped her through her two failed IVFs and also to try to find a surrogate.\n\nShe once threw herself at him at an OB/GYN convention in Palm Springs. She was extremely drunk and stumbled into his hotel room, where she asked him if he wanted to sleep with her. He turned her down, saying that it was the alcohol talking and that she would regret it in the morning. When Addison woke the following morning, she remembered what had happened and was thoroughly embarrassed.\n\nJake once asked her if their relationship was purely physical because he cared about her, but she was sending him mixed signals. Addison confirmed that it was not just physical, but also emotional. Their relationship grew over time. When Jake was talking to his daughter, Angela, he told her that it wasn't Addison sending the mixed signals; it was him.\n\nAddison proposed to Jake shortly before Henry's adoption, and was thoroughly humiliated when he didn't answer; but after a talk with the ghost of his late wife, he accepted. They later got married.\n\n\n[[Image:x-.jpg|thumb|left|px|Addison and Callie.]] Since arriving at [[Seattle Grace Hospital]], Addison has made many friendships with other hospital staff, most notably [[Callie Torres]] and [[Miranda Bailey]] (Miranda's reasons being that Addison smells nice, she's polite, and she saves babies). Her friendship with the two ladies has often been based on the fact that they act as each other's confidantes. Callie and Addison often discuss their current relationships and love lives, which has ultimately led to a very close friendship between the two. Addison is also very good friends with fellow attending, [[Preston Burke]], and her ex-husband, [[Derek Shepherd]]. She had a good friendship with [[Mark Sloan]] and a father-daughter bond with [[Richard Webber]] as she is often portrayed to be very close to him. The only intern that Addison really bonded with was [[Alex Karev]] but she had no grudges against any of the interns and even hugged [[Meredith Grey|Meredith]] as a sign of acceptance of her relationship with [[Derek Shepherd|Derek]]. She helped inspire [[Izzie Stevens|Izzie]] to become a fighter again.\n\nAddison is believed to have had a good relationship with the Shepherd family, in particular, [[Nancy Shepherd]], but, pending Derek's revelation of the true extent of Addison/Mark's relationship, her closeness to the Shepherds is in doubt.\n\n[[Image:TheGang.jpg|thumb|left|px|Addison, Derek, Mark, Sam and Naomi at [[Emerald City Bar|Joe's]].]]\n\nAfter moving to [[Los Angeles|L.A.]], Addison returned to [[Seattle Grace Hospital]] to help with a patient whose fetus\us heart was growing out of its body. Upon her return, Addison didn't expect much change; but soon learned that since her departure a lot had changed - for example, the break up of [[Meredith Grey|Meredith]] and [[Derek Shepherd|Derek]] and his relationship with [[Rose]], Callie's divorce and the breakdown of Bailey's marriage. During her stay there she met [[Callie Torres|Callie's]] new friend [[Erica Hahn]] and mistakenly interpreted their friendship as a relationship. The mother and child both survived the surgery and Addison prepared to leave Seattle and return to L.A, telling [[Richard Webber|Richard]] that she needed to come back to see how much she liked her new life. She left, but not before finding Meredith and telling her that she wasn't allowed to let Derek get away.\n\nAddison betrayed Naomi by confronting Sam with something about the practice. Naomi dropped her friendship with Addison and refused to talk to her. Eventually, she and Naomi began to mend their friendship and at last came back to being best friends. Addison (despite her rocky start) got on well with her new colleagues and friendships were rekindled (as she was friends with Naomi and Sam years ago), friendships were started (Violet, Dell, and Coop) and even a short time relationship occurred (with her now friend, Pete). When Naomi left for New York, Addison and Violet became very close, discussing relationship woes and Lucas situations, and just generally they were pretty close. When Amelia came to L.A., she and Addison had a very sisterly relationship.\n\n\nAddison is considered one of the best surgeons in her field in the world, having patients travel across the country to receive medical and surgical care from her, helped by her excellent bedside manner. She formerly worked at [[Seattle Grace Hospital]], before her relocation to [[Los Angeles]] to join a private practice. When she relocated, her surgical practice became limited, with her practice being mostly obstetric work and occasional genetic counseling with Naomi. However, she does have surgical privileges at [[St. Ambrose Hospital]], allowing her to conduct her own surgeries, which is a right she exercises frequently. [[Charlotte King]] also calls on Addison to consult and take on complex medical cases from the hospital, which increases her OR time.\n\nShe completed her [[Resident|surgical residency]] under the supervision of her now good friend, [[Richard Webber]]. During her residency, Richard gave Addison a patient who would not survive, to teach Addison to not get too emotionally involved with her patients, as a result, Addison avoided Richard for almost a year. As an attending, she repeated the same trick with [[Izzie Stevens]] and one of the quintuplets the hospital was taking care of.\n\nDuring her [[Obstetrics and Gynecology|OB/GYN residency]], Addison was mentored by [[Vivian Carlsmith|Dr. Vivian Carlsmith]], a world-renowned OB/GYN , and pioneer in [[Maternal-Fetal Medicine|maternal-fetal medicine]]. Addison was Vivian's smartest student, eventually surpassing Vivian's skill.\n\nAddison's training also encompasses why she is regarded as one of the best surgeons in her field: she is [[Board Certification|board certified]] in [[Board Certification#American Board of Obstetrics and Gynecology|obstetrics and gynecology with her sub-specialty in maternal-fetal medicine]], board-certified in [[Neonatal Surgery|neonatal surgery]], and has completed a [[Fellow|fellowship]] in [[Medical Genetics|medical genetics]], specializing in cystic fibrosis. She is very open about her credentials and has relayed them to patients, co-workers, and subordinates that have doubted her abilities.\n\nSurgically, she is highly skilled in complex, often laparoscopic and open, obstetrical, gynecological, neonatal and [[Fetal Surgery|fetal]] surgeries. She is one of the few surgeons in the world who can separate fetal blood vessels and correct Twin-to-twin transfusion syndrome, which she has special expertise in. [[File:x-.jpg|thumb|xpx|Addison treats a patient at Seattle Grace Hospital.]] She was formerly the [[Attending#Department Head|attending surgeon]] in charge of a world-class [[Neonatal Intensive Care Unit|NICU]] and state-of-the-art OB/GYN wing at [[Seattle Grace Hospital]]. Although a highly successful and well-paid job, Addison left Seattle to go to L.A to join a private practice.\n\nWhen she arrived at the practice she was surprised to discover that Naomi, who gave her the job offer, didn't tell the rest of the staff about Addison. The other doctors showed Addison that she was clearly not welcome. On her first day in the practice, she performed surgery in an unsterilized delivery room only with the help of Alternative Medicine Specialist, Pete. On the end of the same day, they decided to vote on whether Addison should join the practice or not but Addison put her foot down and told them that she was going to stay even if they wanted her gone. Everyone was impressed by her speech and they decided not to vote after all.\n\n[[Image:PPSCast.jpg|thumb|right|px|The main staff of the Oceanside Wellness Group, and [[Charlotte King]], Chief of Staff at [[St. Ambrose Hospital|St. Ambrose]].]]\n\nWhen [[Richard Webber]] asked Addison to [[Piece of My Heart|return for a complex surgery]], she agreed, and at the end of the day, Richard attempts to get her back and letting her start the next morning. Addison declined the offer, being sure that leaving was the right thing to do. Similarly, when Naomi would not speak to Addison, Addison took several surgeries at [[St. Ambrose Hospital|St. Ambrose]] to relieve her frustrations. [[Charlotte King|Charlotte]] tried to woo her to the hospital with the surgeries but Addison declared the practice as her 'home'.\n\nNot long after moving to Los Angeles, Addison learned that [[Oceanside Wellness Group|the practice]] was failing financially so confronted Sam and the two formed a hostile takeover. In a bid to get the practice back to how it used to be Addison accidentally prompted a vote between [[Sam Bennett|Sam]] and [[Naomi Bennett|Naomi]], but was stunned when she was elected to lead the practice as Addison's leadership shone through.\n\nLater, Addison dissolved the practice, funded the change, and renamed it to [[Seaside Health and Wellness]].\n\n\n*She was  when she moved to [[Los Angeles]].<ref>[[Didn't We Almost Have It All?]], x</ref>\n*When Derek left her in New York, Addison dyed her hair blonde.<ref>[[Walk on Water]], x</ref>\n*Since moving to L.A, Addison describes herself as very zen. She buys aromatherapy candles and takes walks on beaches.\n*When she worked at [[Seattle Grace Hospital]], her salary made her one of the highest-paid surgeons in the Northwestern United States.\n*Addison performs abortions. She believes life only begins when the baby can survive outside the mother's body, thus at birth.<ref>[[Crime and Punishment]], x (PP)</ref>\n*During her education, Addison always hated neuroanatomy.\n*Addison's SGH ID badge stated her departments were [[Obstetrics and Gynecology]] and [[Neonatology]].\n*Addison sometimes wears reading glasses.<ref>[[Staring at the Sun]], x</ref>\n*She has a lucky [[Scrubs|scrub cap]].\n*Addison has a very close sisterly relationship with [[Amelia Shepherd]], as Addison took her to get her ears pierced, she did her hair for prom, and she explained to her how to use birth control when Amelia didn't know who to ask.\n*Before she was officially a part of the [[Seattle Grace Hospital]] attending staff, she wore salmon scrubs. Whether or not she owned these scrubs or if she was wearing the uniform color of OB/GYNs remains unclear. Kate Walsh stated in an interview that it was decided to let Addison wear the navy blue scrubs to make her more part of the attendings group.\n*Whenever Addison wants to tell something that she cannot tell, she stares at the person she wants to tell.\n*Addison and her family are WASPs - they only go to Church on Christmas, and she does not know how to pray.<ref>[[Before and After]], x</ref>\n*Addison rarely mentions being a WASP during her time as a series regular on Grey's Anatomy but talks about it quite often in Private Practice. However, when she mentions it in GA, she is referring to the Protestant aspect, whereas she mainly uses the term in PP to discuss the culture of her childhood and family, in the social group aspect.\n*It has been noted that Addison's qualifications are unrealistic for a practicing doctor in her late-s/early-s, as she has already gained a highly-regarded reputation at her character's introduction to the series. Since Derek and she attended medical school together and were both educated by Richard Webber, it is likely she completed a -year residency in general surgery followed by a -year fellowship in pediatric surgery focusing on neonatal and fetal surgical procedures, returning to complete a -year residency in obstetrics and gynecology followed by a -year fellowship in maternal-fetal medicine, with her (likely to be) -year fellowship in medical genetics following everything else. In reality, under the best circumstances, this would make Addison a minimum of  years old.\n**It has been indicated throughout seasons five and six of ''[[Private Practice]]'' that Addison first completed a residency in [[Obstetrics and Gynecology|OB/GYN]]. This would mean that she followed up with fellowships in maternal-fetal medicine and medical genetics, then completed a general surgery residency and finished with a pediatric surgery fellowship focusing on neonatal and fetal surgeries. If this is indeed the case, this creates a continuity-error with her being mentored by Richard, as stated in ''[[Grey's Anatomy]]'', as OB/GYN residents do not rotate in other surgical departments; this would be plausible if Richard were somehow involved in Addison's OB/GYN residency.\n*Addison appeared in every single episode of\ua''[[Private Practice]]'', except for\ua[[Two Steps Back]]\uaand\ua[[The Hardest Part]].\n*Although incorrect, [[Jake Reilly|Dr. Jake Reilly]] referred to Addison as a [[Neonatology|neonatologist]].<ref>[[Don't Stop 'Till You Get Enough]], x (PP)</ref>\n*Addison is the first and last character to be seen on ''Private Practice''. The first scene of the show is her talking to Richard about her resignation, and the last scene of the show is the group talking in the kitchen in the practice, with her face being the last one to be seen from inside the elevator before its doors close completely.\n*In one college semester, she took classes in organic chemistry, physics II, multivariable calculus, conversational French, introduction to the modern European novel, and tennis. She later had to retake tennis due to getting an incomplete.\n*She's one of only eight people in the world who can perform [[Obstetrics and Gynecology|OB/GYN]], [[Maternal-Fetal Medicine|perinatology]], and [[Neonatal Surgery|neonatal surgery]] on a world-class level.\n*She loves bacon cheeseburgers.\n*She has a cat named [[Milo (Cat)|Milo]], formerly owned by her patient [[Lillie Jordan]].\n*She wore a sea turtle scrub cap for her first solo surgery.\n*She used to have a pet hermit crab, but the air filter was noisy so she shut it off, and it died.<ref>[[Slip Slidin' Away]], x (PP)</ref>\n*Her fortune is about  million dollars.\n*She has a thing for Russell Crowe.<ref>[[Raindrops Keep Falling On My Head]], x</ref>\n*She is not a fan of bread.<ref>[[With a Little Help From My Friends]], x</ref>\n\n\n<gallery position=\"center\" spacing=\"small\" widths=\"\" orientation=\"landscape\" bordersize=\"none\" hideaddbutton=\"true\">\nAddisonMontgomery.png\nPPAddisonMontgomery.png\nPPxAddisonMontgomery.png\nPPxAddisonMontgomery.png\n</gallery>\n\n{{GalleryLink}}\n\n\nThese episodes are Addison-centric or otherwise very informative about her life.\n*[[Raindrops Keep Falling On My Head]]\n*[[Owner of a Lonely Heart]]\n*[[Time Has Come Today]]\n*[[The Other Side of This Life, Part ]]\n*[[The Other Side of This Life, Part ]]\n*[[In Which We Meet Addison, a Nice Girl From Somewhere Else]]\n*[[In Which Addison Finds the Magic]]\n*[[In Which Addison Has a Very Casual Get Together]]\n*[[In Which Addison Finds a Showerhead]]\n*[[Before and After]]\n*[[Ex-Life]]\n*[[The Hard Part]]\n*[[Home Again]]\n*[[Apron Strings]]\n*[[In Which We Say Goodbye]]\n*[[Hotter Than Hell]]\n*[[With a Little Help From My Friends]]\n\n\n:'''Addison (to [[Jake Reilly|Jake]]):''' I love you. And you're the last man I want to say that to. Let's get married.<ref>[[Apron Strings]], x</ref>\n\n----\n:'''Addison:''' Dr. Karev, I may be a board-certified OB/GYN, but I also have fellowships in maternal-fetal medicine and medical genetics, and I am one of the foremost neonatal surgeons in this country. When you can top that, you can mouth off. Until then, you will do your job and you will do it right, which at this point in time, means you keep your mouth shut unless I give you permission to open it. Understood?\n----\n:'''Addison:''' Hi, I'm Addison Shepherd.\n:'''[[Meredith Grey|Meredith]]:''' Shepherd?\n:'''Addison:''' And you must be the woman who's been screwing my husband.<ref>[[Who's Zoomin' Who?]], x</ref>\n----\n:'''Addison (to [[Derek Shepherd|Derek]]):''' There is a land called Passive Aggressiva and I am their queen.<ref>[[Begin the Begin]], x</ref>\n----\n:'''[[Cooper Freedman|Cooper]]:''' We're a team.\n:'''[[Violet Turner|Violet]]:''' We're partners, Naomi.\n:'''[[Sam Bennett|Sam]]:''' You can't just bring somebody in.\n:'''[[Pete Wilder|Pete]]:''' Without asking us.\n:'''[[Violet Turner|Violet]]:''' Yeah.\n:'''[[Sam Bennett|Sam]]:''' We're a democracy. We vote.\n:'''[[Pete Wilder|Pete]]:''' We vote.\n:'''[[Violet Turner|Violet]]:''' We vote or it doesn't happen.\n:'''[[Naomi Bennett|Naomi]]:''' You're right. We should've voted. I was wrong.\n:'''[[Violet Turner|Violet]]:''' Good. Okay, let's vote.\n:'''Addison:''' Whoa, whoa, whoa, whoa. Hold on a minute. Uh, I have been working here less than  hours, and in that time I discovered that I not welcome here, I learned I am a one-man gynie show, and I performed crazy McGyver surgery, and...Sam saw my booty. So...this has not been a great day for me. This day kind of sucked. But you know what I had one patient...one patient the entire day...and I loved it. So you want me gone? Too bad. I'm in. I'm putting my foot down. My foot's down. It's down. I'm not going anywhere. So...yeah. I thought I...I thought I had a big finish but...I don't. So...I'm done. No, no. I do have a big finish. If I hadn't been here today, if you'd had someone else, that girl would've died delivering her baby. I saved her life. I saved your asses. I'm a world-class neonatal surgeon. And I'm here to stay. Welcome to the new Oceanside Wellness. ''(Addison leaves)''\n:'''[[Naomi Bennett|Naomi]]:''' That's why I didn't tell you she was coming.<ref>[[In Which We Meet Addison, a Nice Girl From Somewhere Else]], x (PP)</ref>\n----\n:'''Addison:''' So, who's the new mystery woman that Derek's dating? Who is the unlucky McRebound? ''(laughs, while nobody answers)'' What? Is the whole Mc-thing over now? I'm sure things haven't changed that much around here.\n:'''[[Miranda Bailey|Bailey]]:''' Addison, the woman standing immediately to your right, the one handing you the surgical instruments.<ref>[[Piece of My Heart]], x</ref>\n----\n:'''Addison:''' I just need to say it once.\n:'''[[Mark Sloan|Mark]]:''' Go ahead.\n:'''Addison:''' Grandpa. ''(laughs)'' Grandpa, grandpa, grandpa.\n:'''[[Mark Sloan|Mark]]:''' Oh, okay. That was four times.<ref>[[Blink]], x</ref>\n\n\n{{Addison Forbes Montgomery Appearances}}\n{{Scrollbox}}\n\n[[de:Addison Forbes Montgomery]]\n[[fr:Addison Montgomery]]\n[[es:Addison Forbes Montgomery]]\n[[it:Addison Forbes Montgomery]]\n\n{{DEFAULTSORT:Montgomery, Addison Forbes}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Doctors]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (REI)]]\n[[Category:Patients (CAM)]]\n[[Category:Patients (Clinic)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Fillmore Davis", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPxDink.png\n|name = Fillmore Davis\n|alias = *Dink\n*Pink\n*Rink\n|status = Alive\n|marital = [[Maya Bennett]] ''(wife)''\n|children = [[Olivia Davis]]\n|parents = [[Corinne Davis]]\n|other family = *[[Sam Bennett]] ''(father-in-law)''\n*[[Naomi Bennett]] ''(mother-in-law)''\n*[[Betsey Parker]] ''(sister-in-law)''\n|first appearance = [[The Parent Trap]]\n|last appearance = [[Take Two]]\n|count = \n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]] and [[Season  (Private Practice)|]]\n|portrayed by = [[Stephen Lunsford]]\n}}\n\n'''Fillmore \"Dink\" Davis''' is the husband of [[Maya Bennett]] and the father of [[Olivia Davis]].\n\n\n\nHe met his girlfriend, Maya's, mother when she caught them together skipping school. He then met her father when Maya threw a party at her father's house. ''(\"[[The Parent Trap]]\")''\n\n\nWhen Sam and Naomi found out that Maya was pregnant, Sam went to the basketball court and confronted Dink, saying that Dink should have been more scared of him. Dink was shocked to learn that Maya was pregnant because he hadn't known that. He told Sam he loved Maya. ''(\"[[Best Laid Plans]]\")''\n\n\nHe got married to Maya while Maya was pregnant. ''(\"[['Til Death Do Us Part]]\")''\n\n\nDink came to the hospital when he heard Maya was in labor. However, when he arrived, he learned that Maya had been in a car accident. When he was told he'd have to choose what he wanted because he was Maya's husband, he said that he didn't know how to choose because he was still just a kid and he loved both Maya and the baby. After Maya had surgery and the baby was delivered, he held his newborn daughter in his wife's hospital room. ''(\"[[The End of a Beautiful Friendship]]\")''\n\n\nAfter Olivia was born, Maya moved in with Naomi, who helped her take care of Olivia. When Sam found that out, he confronted Dink, saying he needed to step up and take care of Olivia. Dink said he wanted to help, but Naomi wasn't letting him do anything. Sam got him to understand that he needed to stand up to Naomi and sent him home to take care of his family. He stood up to Naomi and started taking care of Olivia. ''(\"[[Take Two]]\")''\n\n\nWhen Maya was accepted to Columbia and decided to go, the family moved to New York. ''(\"[[...To Change the Things I Can]]\")''\n\n\n\n[[Maya Bennett]]\nMaya had a crush on Dink before starting to date him. ''(\"[[The Parent Trap]]\")''\n\nAfter learning that Maya was pregnant, Dink and Maya discussed it and decided they wanted to get married. Dink then went to Sam to ask his permission. When they discussed the wedding later, Dink told Naomi that he wouldn't walk away. Sam agreed to sign the consent form, even though Naomi refused. ''(\"[[Shotgun]]\")''\n\n[[File:PPx-.jpg|thumb|px|Dink and Maya get married.]]\nThe two prepared for the wedding and got married. ''(\"[['Til Death Do Us Part]]\")''\n\nWhen Maya was in labor, Dink goes immediately to the hospital, only to learn that Maya is caught in a car accident. He worried about her and the baby, but both were saved by Addison and Amelia. ''(\"[[The End of a Beautiful Friendship]]\")''\n\n\n*He's in a band. ''(\"[[The Parent Trap]]\")''\n*He made a mix tape for Maya to give birth to. ''(\"[[In the Name of Love]]\")''\n\n\n\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPPDink.png|[[The Parent Trap]]\nPPDink.png|[[Best Laid Plans]]\nPPDink.png|[[Shotgun]]\nPPDink.png|[['Til Death Do Us Part]]\nPPDink.png|[[The End of a Beautiful Friendship]]\nPPxDink.png|[[Take Two]]\n</gallery>\n\n\n<gallery orientation=\"portrait\" position=\"center\" spacing=\"small\" bordersize=\"none\">\nShotgun.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\n</gallery>\n\n\n{{Dink Appearances}}\n\n{{DEFAULTSORT:Davis, Fillmore}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Olivia Davis", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPxOliviaBennett.png\n|name = Olivia Davis\n|status = Alive\n|born = \n|parents = *[[Maya Bennett]]\n*[[Fillmore Davis]]\n|grandparents = *[[Sam Bennett]]\n*[[Naomi Bennett]]\n*[[Corinne Davis]]\n|other family = *[[Betsey Parker]] ''(aunt)''\n*[[Corinne Bennett]] ''(grand-aunt)''\n*[[Dee Bennett]] ''(great-grandmother)''\n|first appearance = [[The End of a Beautiful Friendship]]\n|last appearance = [[God Bless the Child]]\n|count = \n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]] and [[Season  (Private Practice)|]]\n}}'''Olivia Davis''' is the child of [[Maya Bennett]] and [[Fillmore Davis]] and the grandchild of [[Sam Bennett]] and [[Naomi Bennett]].\n\n\n\nWhen Maya was three weeks before her due date, she went into labor. She then decided that she wanted to go to the hospital instead of having the baby at the practice like she originally planned. On the way to the hospital, she was in a car accident. ''(\"[[In the Name of Love]]\")''\n\nWhen they learned that Maya had a spinal fracture that threatened her ability to walk, they decided to operate and deliver the baby. However, before that could happen, they discovered that the baby was keeping Maya's spinal fracture stable, so they couldn't move the baby without risking paralysis. Gabriel then suggested hypothermia, which would give them more time to repair Maya's spine and hopefully save the baby as well. During Maya's surgery, Addison delivered the baby. She had to be resuscitated because she wasn't breathing, but she quickly stabilized. ''(\"[[The End of a Beautiful Friendship]]\")''\n\n\nAs a newborn, Olivia lived with Naomi and Maya at Naomi's house, primarily cared for by Naomi as Maya was recovering and Dink was scared of Naomi, who didn't believe he was prepared to take care of Olivia. Dink, encouraged by Sam, stood up to Naomi and insisted that he was ready and would be taking care of Olivia and Maya. ''(\"[[Take Two]]\")''\n\n\nWhen Maya got into Columbia, Olivia moved to New York with her family. ''(\"[[...To Change the Things I Can]]\")''\n\n\n*According to Naomi, she and Betsey adore each other. ''(\"[[In Which We Say Goodbye]]\")''\n\n\n\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPPOliviaBennett.png|[[The End of a Beautiful Friendship]]\nPPxOliviaBennett.png|[[Take Two]]\nPPxOliviaDavis.png|[[Playing God]]\nPPxOliviaDavis.png|[[Just Lose It]]\nPPxOliviaDavis.png|[[Two Steps Back]]\nPPxOliviaBennett.png|[[God Bless the Child]]\n</gallery>\n\n\n{{Olivia Davis Appearances}}{{DEFAULTSORT:Davis, Olivia}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Patients]]\n[[Category:Patients (Neonatal)]]\n[[Category:Patients (Trauma)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Pete Wilder", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = PPx-.jpg\n|name = Peter Wilder\n|died = [[Timeline|September ]]; [[Los Angeles]], California\n|status = Deceased\n|title = M.D.\n|alias = *Dr. Kevorkian\n*Angel of Death\n*Hurricane Pete\n*Charon\n|marital = *[[Anna Wilder]] \u ''(wife)''\n*[[Violet Turner]] ''(wife)''\n|children = [[Lucas Wilder]]\n|siblings = [[Adam Wilder]]\n|parents = [[Frances Wilder]] \u\n|other family = *Mother-in-law\n*Father-in-law\n|job = *[[Alternative Medicine|Alternative Medicine Specialist]]\n*[[Attending]] [[Critical Care Medicine|Critical Care Physician]]\n*[[Attending]] [[Infectious Disease|Infectious Disease Specialist]]\n|workplace = '''Until death'''<br>[[Seaside Health and Wellness]]<br>[[St. Ambrose Hospital]]\n'''Former'''<br>[[Oceanside Wellness Group]]<br>[[Pacific Wellcare Center]]\n|first appearance = *'''[[Grey's Anatomy|GA]]:''' [[The Other Side of This Life, Part ]]\n*'''[[Private Practice|PP]]:''' [[In Which We Meet Addison, a Nice Girl From Somewhere Else]]\n|last appearance = *'''[[Grey's Anatomy|GA]]:''' [[The Other Side of This Life, Part ]]\n*'''[[Private Practice|PP]]:''' [[Gone, Baby, Gone]]\n|count = \n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]]\n*'''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], and [[Season  (Private Practice)|]]\n|portrayed by = [[Tim Daly]]\n}}\n'''Pete Wilder''' was an alternative medicine specialist at [[Seaside Health and Wellness]] and a critical care specialist at [[St. Ambrose Hospital]] until his death. He was married to\ua[[Violet Turner]], with whom he has a son named\ua[[Lucas Wilder|Lucas]].\n\n\n\nDuring his childhood, Pete had to clean up after his mother while his brother, Adam, made excuses. She was an alcoholic 'A party all by herself', and liked a lot of men. She met a serious partner, Henry, but later stabbed him to death when he tried to leave in front of Pete, who was especially close to Henry and the age of fifteen. He is now estranged from his brother and does not know who his father is.\n\n\nBefore her pregnancy, Violet was sleeping with both Pete and Sheldon. During her whole pregnancy, no one knew who was the biological father. Cooper came to live with her to help her with her pregnancy. She was treating [[Katie Kent]], who was pregnant, but lost the pregnancy. Kate refused to accept this and wouldn't allow them to do a D&C to remove the dead tissue. With Violet's help, Katie came to terms with it and she continued treatment with Violet.<ref>[[What Women Want]], x (PP)</ref> During this time, Violet chose to be with Pete and Sheldon had to just sit back and did not really say anything but hoped the baby would be his. She was overdue and was tired of being pregnant and wanted it out but still went to work every day. One day, Katie came to her door while she was home alone. Katie stabbed her with a syringe that caused Violet to be conscious but unable to move from her head down. Katie believed Violet's baby was her own. Unable to stop Katie, but wanting to make sure the baby was okay, Violet talked Katie through a C-Section.<ref>[[Yours, Mine & Ours]], x (PP)</ref>\n\n\n\n\nPete had a heart attack mere hours after Violet left for her book tour with only his son Lucas as a witness. Fortunately, Cooper came by to hang out and discovered him on the floor. He started CPR and called .\uaPete was taken to St. Ambrose, where Sam and Amelia saved his life. Violet came home as soon as she found out and later became the object of Pete's post-heart attack frustration.<ref>[[God Laughs]], x (PP)</ref>\n\n\nAfter Pete's heart attack, their relationship was strained and uncomfortable. Once Pete was cleared for all physical activity, they slept together, however they both confided in others saying it was awkward and not as good as it used to be. While Pete was grieving his attack, he said passive aggressive comments to Violet, and treated her poorly, however Violet dismissed it because the psychiatrist in her said it was just the grief talking. During Amelia's intervention, she verbally attacked both of them saying to Violet that Pete didn't want her anymore and she was just an aging old woman, and told Pete that saving his life after the brain bleed following the heart attack, may not have been worth it, and \"God's angels should have just taken him then\". Both Pete and Violet escaped into the kitchen where they laughed hysterically at the things Amelia said to them, and it felt like the old them. However time past and things were still strained and not normal. Violet and Addison had grown closer as Addison was trying to get pregnant and Violet was helping her, and while they were talking one day, Violet realized something. She found Pete in his office and started talking. She said that she didn't want to be like Anna, Pete's previous wife until her death. She didn't want Pete to feel obligated to stay with her even though he was miserable. But she also knew that Pete didn't have it in him to leave. So she said that if Pete didn't want their marriage to continue, ''she would leave him'', so he wouldn't have to feel guilty, and they would figure out a way to share Lucas. She told Pete to think about that, and left his office. Later, while they were sitting at their table, Violet asked if Pete had thought about what she said. He responded saying, \"I'm sorry Violet.\" Meaning he wanted to end their marriage. Violet's reaction was unclear but she said that they should keep things as normal as possible for Lucas, and they should still go to Addison's thanksgiving dinner together, for Lucas. She then picked up her bag, and walked out of the house.\n\n\nPete had had a heart attack previously. He also got in trouble with the law because he illegally took a man who wanted to die off of life support. He was resistant to agree with the court so he was held until he cooperated. Violet talked Pete into cooperating with the court and he got out and had to go to a preliminary court hearing. On the day of the hearing, Pete went for a run and texted Violet, \"I went for a run. No matter what happens, I will always love you.\" Violet showed up for the hearing, but no one could find Pete. Violet got a call later from his phone. It was a police officer telling her something had happened to the owner of the phone and asking if she could come and identify him. It turned out that Pete had had a second heart attack and died on the side of the path and was lying there all day until someone found him.<ref>[[Aftershock]], x (PP)</ref>\ua\n\n\nPete could\uabe cold at times but had a loving heart. He was loyal to his wives even though he hated them at some point.\n\n\n\n[[Addison Forbes Montgomery]]\n[[Image:x-.jpg|thumb|left|px|His first kiss with Addison.]]\nDuring Dr. Addison Forbes Montgomery's first visit to Oceanside Wellness, Pete and Addison established a teasing and often flirtatious relationship. Addison initially labelled Pete a \ucquack,\ud but she allowed the \uccute hippy boy\ud to treat her with acupuncture. Although Pete was immediately attracted to her, he promised their mutual friend, Dr. Sam Bennett, that he would stay away from Addison. However, after finding Addison crying over her newly discovered infertility, Pete kissed her to prove that she wasn\ut \ucdried up.\ud Addison seemed open to pursuing a relationship with Pete, but was warned off by Sam. According to Sam, Pete is a serial monogamist, unable to emotionally connect with any woman since the death of his wife. Pete's last foray into office romance was apparently disastrous, and resulted in the unnamed OB/GYN's sudden departure from the practice. In response, Oceanside Wellness instituted a strict \"no consorting\" rule. Later, they got together again, after [[Violet Turner|Violet]] left Pete and [[Lucas Wilder|Lucas]] behind. They raised Lucas together for a while. They split up after Violet's return.\n\n[[Anna Wilder]]\nPete's relationship with his wife is somewhat mysterious and he appears reluctant to discuss their marriage. During a visit to her grave on the anniversary of her death, we discover Anna Wilder died in , at the age of . In a discussion regarding a patient, Pete hints to the other doctors that he stayed in an unhappy marriage because his wife was sick and that they were unable to make the marriage work. Pete eventually tells Addison that he went to bed with his wife on a Tuesday night and when he awoke the following Wednesday morning she was dead and that he thought she was ignoring him and argued with her dead body for  minutes before ripping the blankets of the bed and realizing that she had been dead. He further states that no night was perfect during their marriage, not even their wedding night. This information was the most that Pete has ever divulged to any of his co-workers about his wife. During a second visit to his wife's grave, Pete unleashes his pent-up anger to his wife's headstone. After stating that Anna was \"a mean, cold bitch\" and that he hated her, Pete softens and apologizes for not being able to save her. Pete later reveals to Violet that at the time of Anna's death they had been trying to conceive a child.\n\n[[Meg Porter]]\nPete and Meg met when they were both residents and later worked together as Doctors Without Borders. Meg reveals to Pete's surprised co-workers that once during the war in Bosnia, Pete refused to evacuate and, despite the mortar fire, stayed with sick children for the whole night, saving the lives of most of them. Later Pete told Meg, who has a smoking habit, that his wife was a smoker and she didn't quit the habit before she died. Despite their renewed relationship, Meg decides to come back to Ghana, where she works in malaria fighting program, but Pete asks her to come back to him, because she makes him happy. Despite that, Meg returned later to LA and even tried to give up smoking for Pete, the relationship didn't work. Meg wasn't sure if she wants to live in LA and Pete admitted that ever since his unhappy marriage he doesn't trust women anymore. When Pete and his Oceanside Wellness Group colleague [[Violet Turner|Violet]] hooked-up, the relationship with Meg was definitely over.\n\n[[Violet Turner]]\nThe relationship with Violet started with just sex, but later Pete realized that he wanted more. When he asked Violet if they could move to the next level and begin a real relationship, she turned him down, saying that she didn't trust him because of his past. But it was Violet's behavior that really caused the end of their relationship, when she started secretly dating Sheldon, the therapist from the rival practice, Pacific Wellcare. Pete ended their relationship because of Violet's infidelity. Afterward, Violet revealed to both Pete and Sheldon she was pregnant, and willing to raise the child, but ignored who the father was. Pete confronted Violet and said that he loved her and they could be a real family. Violet turned him down, but later she kissed him and told about her feelings towards him. In the end, Violet was kidnapped by her patient, [[Katie Kent|Katie]], who believed that Violet's baby was her own.\n\nPete found Violet lying unconscious on the floor of her house, bleeding to death. Katie cut the baby out of Violet and ran away with him. Pete saved Violet and together with Naomi rushed her to the hospital where Addison and Naomi operated on her. In the meantime, Katie appeared at the hospital with Violet's baby and was apprehended by Pete, Cooper, and security. While waiting in the hospital for Violet's surgery to be finished, Pete thought about their first meeting. They met just four days after Pete's wife's death, when Sam and Naomi, Pete's friends who just opened their private practice, recommended Violet to him as his therapist. Pete at first was reluctant to talk with Violet, but finally he opened to her and admitted that he hated his wife and argued with her all the time, even the night she died. The next morning, he was still yelling at her and only a few minutes later, he noticed that she wasn't answering because she was dead. Pete admitted that he was relieved after his wife's death and felt free. After that, Pete, who was the owner of an Infectious Diseases practice in Beverly Hills, decided to change his job, and started working in Oceanside Wellness Group as an Alternative Medicine specialist, where he still worked eight years later.\n\nA month after Lucas's traumatic birth, Violet was still trying to recover and get over her trauma. Pete lived with her and took care of her and Lucas. Violet was not leaving her house and had panic attacks every time the doorbell rang. After getting advice from Sheldon, Pete decided to move out, to help Violet recover and push her to go outside. Violet realized that after traumatic events in her life, she couldn't bond with her baby and gave Lucas to Pete, asking him to take care of the baby.\n\nA couple of weeks later, Sheldon requested a paternity test and it was revealed that Pete is the biological father.\n\nA few months later, Violet returned and wanted joint custody of Lucas. Pete didn't want to let this happen and battled her in court. Their relationship was strained for a while until Pete discovered that Violet had changed and that she was a good influence on Lucas and him.\uaAfter Dell's death, Pete and Violet decided to get married.\n\nAfter Pete had his first heart attack, he started to resent Violet, believing she was coddling him, and that resulted in their separation.\n\nWhen Violet started seeing Scott, Pete realized he was still in love with Violet.\n\nEventually, after Scott and Violet broke up, Violet also decided that she was still in love with Pete. Pete and Violet attempted to go to couples therapy, but Pete decided that they were in love and that was enough for him. Violet still wanted him to work, for them to work and sort out their problems.\n\nWhen Pete went out for his run, he texted Violet, telling her that he loved her. Concerned when Pete didn't show up for the hearing that he was meant to go to, she thought he had left. When she realized that Pete was dead, she told Cooper that Pete didn't look like Pete at all. According to her, Pete had always looked warm, even when he was angry, but now he just looked cold.\n\n[[Lisa King]]\nPete briefly dated Lisa after her son, [[Ben King]], one of Pete's patients, set them up. After realizing that he needed to be there for Violet and the baby, he showed up at Lisa's doorstep and broke things off with her.\n\n\nPete worked at the [[Oceanside Wellness Group]] as a [[Alternative Medicine|naturopathic doctor and licensed herbalist]]. He graduated from medical school and practiced traditional western medicine for a number of years before spending five years in China studying alternative medicine. Pete\us medical practice combines eastern and western medicine in an integrative approach, and he is often asked to provide expectant mothers with holistic birthing plans. Pete has also lectured locally and internationally on the subject of Oriental and Eastern Medicine. He used acupuncture on Addison during her first visit to the Oceanside Wellness Group and made her release negative energy.\n\nBefore Oceanside, Pete owned a practice in Beverly Hills which worked in [[Infectious Disease|infectious disease]]. Pete also had training in [[Critical Care Medicine|critical care]].\n\nPete was offered a job at Oceanside Wellness Group when the doctor they originally hired, a [[Dermatology|dermatologist]], was sued for inappropriately touching his patient's feet. However, [[Violet Turner|Violet]] had doubts as he was seeing her for therapy following the death of [[Anna Wilder|his wife]]. Eventually, Violet saw progress and allowed him to work at the practice.\n\nAfter some time at Oceanside, Pete accepted Naomi's offer and left the Oceanside Wellness Center to start working in [[Pacific Wellcare Center|Pacific Wellcare]]; additionally, he has picked up shifts at [[St. Ambrose Hospital|St. Ambrose Hospital's ER]], becoming employed as an [[Attending|attending]] critical care physician.\n\n\n*Before settling on the name Pete Wilder, the creators of the show considered and rejected \"Pete Finch\" and \"Pete Fisher.\"\n*Pete rode a Triumph motorcycle.<ref>[[Know When to Fold]], x (PP)</ref>\n*According to [[Sam Bennett|Sam]], Pete couldn't parallel park to save his life.<ref>[[Mourning Sickness]], x (PP)</ref>\n*Pete wanted a Balinese party instead of a normal funeral.<ref>[[Mourning Sickness]] x (PP)</ref>\n*Pete never ate the crust off his pizza.<ref>[[Mourning Sickness]], x (PP)</ref>\n*He loved mint chocolate chip ice cream.<ref>[[Mourning Sickness]], x (PP)</ref>\n*He liked meatloaf.<ref>[[Do the Right Thing]], x (PP)</ref>\n*He spoke Spanish.<ref>[[Playing God]], x (PP)</ref>\n\n\n<gallery widths=\"\" position=\"center\" orientation=\"landscape\" bordersize=\"none\" spacing=\"small\" hideaddbutton=\"true\">\nPPPeteWilder.png\nPPxPeteWilder.png\nPPPeteWilder.png\nPPxPeteWilder.png\n</gallery>\n\n{{GalleryLink}}\n\n\nThese episodes are Pete-centric or otherwise very informative about his life.\n*[[In Which Addison Finds the Magic]]\n*[[A Death in the Family]]\n*[[War]]\n*[[Take Two]]\n*[[All in the Family]]\n*[[Can't Find My Way Back Home]]\n*[[The Hardest Part]]\n*[[God Laughs]]\n*[[And Then There Was One]]\n*[[True Colors (Private Practice)|True Colors]]\n*[[Gone, Baby, Gone]]\n*[[Mourning Sickness]]\n\n\n:'''Pete:''' My wife went to sleep beside me in bed on a Tuesday night, on Wednesday morning when I woke up, she was dead. It was one bad night. But... all our nights were bad and we never had a perfect night. Not even our wedding night. Nothing's perfect, nothing's ever perfect.<ref>[[A Death in the Family]], x (PP)</ref>\n\n\n{{Pete Wilder Appearances}}\n{{Scrollbox}}\n\n[[de:Pete Wilder]]\n[[es:Pete Wilder]]\n\n{{DEFAULTSORT:Wilder, Pete}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Deceased Characters]]\n[[Category:Doctors]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Cardio)]]\n[[Category:Patients (Psych)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Naomi Bennett", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = PPx-.jpg\n|name = Naomi Bennett\n||status = Alive\n|alias = *Nai\n*Little Miss Moral Compass\n|title = M.D., [[Fellow of the American College of Obstetricians and Gynecologists|F.A.C.O.G.]]\n|parents = Mother\n|marital = *[[Sam Bennett]] ''(husband)''\n*[[Gabriel Fife]] ''(ex-fianc\ue)''\n|children = *[[Maya Bennett]]\n*[[Betsey Parker]]\n*Expecting ''(with [[Sam Bennett|Sam]])''\n|grandchildren = [[Olivia Davis]]\n|other family = *[[Fillmore Davis]] ''(son-in-law)''\n*[[Corinne Bennett]] ''(sister-in-law)''\n*[[Dee Bennett]] ''(mother-in-law)''\n*[[Raymond McCray]] ''(father-in-law)''\n|job = [[Attending]] [[Reproductive Endocrinology and Infertility|Reproductive Endocrinologist and Infertility Specialist]]\n|workplace = '''Current'''<br>[[Seaside Health and Wellness]]\n'''Former'''<br>[[Oceanside Wellness Group]]<br>[[Pacific Wellcare Center]]<br>[[New York Hospital]]\n|first appearance = *'''[[Grey's Anatomy|GA]]:''' [[The Other Side of This Life, Part ]]\n*'''[[Private Practice|PP]]:''' [[In Which We Meet Addison, a Nice Girl From Somewhere Else]]\n|last appearance = *'''[[Grey's Anatomy|GA]]:''' [[Before and After]]\n*'''[[Private Practice|PP]]:''' [[In Which We Say Goodbye]]\n|count = \n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]] and [[Season  (Grey's Anatomy)|]]\n*'''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]] and [[Season  (Private Practice)|]]\n|portrayed by = *[[Audra McDonald]]\n*[[Merrin Dungey]] ''(backdoor pilot)''\n}}\n'''Naomi Bennett''' is a [[Reproductive Endocrinology and Infertility|reproductive endocrinologist and infertility specialist]]. She married [[Sam Bennett]] twice, with whom she has a daughter, [[Maya Bennett|Maya]], and is expecting another child. She is the best friend to Addison Montgomery and a founding partner of the [[Oceanside Wellness Group]].\n\n\n\nIn High School, Naomi was extremely overweight and had to endure many jokes and nicknames about her weight.\n\nWhile attending Columbia University College of Physicians and Surgeons, Naomi met [[Derek Shepherd]], [[Addison Forbes Montgomery]], [[Mark Sloan]], and [[Sam Bennett]]. Eventually, Naomi married Sam and had a daughter, [[Maya Bennett|Maya]].\n\n\nWilliam White and Naomi were at dinner when he explained that he wanted to create a leading medical practice, and wanted Naomi to run it. She initially declined the offer, but William told her that he had been researching and found that she was one of the best fertility specialists, and she built one of the first whole wellness medical practices. She said she wasn't interested.\n\nLater, William met her at the practice and invited her to lunch, where Naomi discussed how the practice was her \"baby\" and that the people working there were her family. William admired that, but he said that he would be back in two weeks to make an official offer to her.<ref>[[What You Do for Love]], x (PP)</ref>\n\nNaomi later confided in Addison that she was offered Charlotte King's job to run Pacific Wellcare Center. Addison was surprised and said that Oceanside was Naomi's practice, but she said that it wasn't hers anymore because of the recent events that happened and that she was considering the offer.<ref>[[Yours, Mine & Ours]], x (PP)</ref>\n\n\n\n\n\n\n\n\nWhile travelling around the world doing work for the William White Foundation, Naomi felt a new purpose in her life. Each time, it became harder for her to take a break from that work and return to the practice and its debates and the sometimes morally questionable decisions that were made there. When [[Gabriel Fife]] returned from D.C. in an attempt to pursue her to move back there with him, she began to contemplate starting over. Though she initially turned him down, citing her obligations to the practice and her family, now also including [[Betsey Parker]], Sam pointed out that she was merely making up excuses not to be loved. Letting go of all her obligations, Naomi then rushed to the airport to chase Fife. She came too late to board the plane but was surprised when Fife showed up. He had gotten off the plane as he had strongly suspected she would show up. He then pulled out a ring and proposed. She happily accepted and told him they were moving to New York City rather than D.C. so that she could help out Maya, who had been accepted into Columbia University.\n\n\nNaomi returned to Los Angeles for Addison and Jake's wedding and was Addison's maid of honor.\n\nAfter speaking with Sam at the reception, they ended up having sex, which resulted in Naomi becoming pregnant. When she visited Addison again, Addison did an ultrasound and Naomi admitted that she and Fife weren't together anymore. Addison did the math and figured out that Naomi had gotten pregnant at her wedding and Naomi confessed that she had slept with Sam, though she refused to tell Sam about the pregnancy.\n\nAfter Naomi went back to work, Sam interrupted Naomi's meeting and professed his love for her. Naomi then tells him that she was going to have a baby, and they kissed.<ref>[[In Which We Say Goodbye]], x (PP)</ref>\n\n\nNaomi has a very sunny personality and is often the person people go to, to confide in. She is very smart and confident in her field. She believes in faith and is a great person to hang out with. She also eats chocolate when she is stressed, sad, or even mad.\n\n\n\n[[Sam Bennett]]\nSam and Naomi dated in college and after college, they married almost immediately. They had a daughter and after many years of happiness, Sam woke up one morning and decided he wanted a divorce. Naomi worked alongside her ex-husband, [[Sam Bennett|Sam]], with whom she had a relatively friendly, but often strained, relationship, for many years before she left [[Los Angeles]] to be with [[Gabriel Fife]].\n\nShe later returned to [[Los Angeles]] for [[Addison Forbes Montgomery|Addison's]] wedding, at which she had a one-night stand with Sam, which resulted in a pregnancy.\n\nThree months later, Naomi returned to L.A. where Sam, oblivious to the fact that Naomi was pregnant, declared his love for her again. Naomi revealed her pregnancy to him and the two reunited and re-married.<ref>[[In Which We Say Goodbye]], x (PP)</ref>\ua\n\n[[Dell Parker]]\nDell Parker, the office receptionist, had a crush on Naomi, and often showed it by getting her coffee, bringing her home-baked chocolate cake, and generally complimenting and adoring her. Naomi didn't take this crush seriously, calling him a \"kid,\" but Dell decided to fight for her and kissed her. He admitted he didn't have it all together, but he told her he was a man, not a kid. Only seconds later, Sam also kissed Naomi, encouraging Dell to fight for her even harder.\n\n[[Archer Montgomery]]\nFollowing the separation, and the brief fling with Sam, she began seeing other people, until she inadvertently slept with [[Archer Montgomery]], to Addison's dismay. Addison told her that Archer would only hurt her. Unfortunately for Naomi, Addison was right, catching Archer ending a date with another woman and walking in on Archer after he had sex with [[Charlotte King]]. Afterward, he left, leaving Naomi devastated.<ref>[[Wait and See]], x (PP)</ref>\n\nAfter a long time apart, they had another one night stand when his mother died.<ref>[[Home Again]], x (PP)</ref>\n\n[[William White]]\nNaomi initially met William when he was convincing her to run a practice that he owned. She declined multiple times, but he met her at the practice and invited her to lunch, where she still declined his offer.<ref>[[What You Do for Love]], x (PP)</ref>\n\nNaomi began dating him, but he later died. It began as a flirtation before she had to write a speech about him.\n\n[[Gabriel Fife]]\nThey first met when he was hired at her new job. They were antagonistic at first. She became engaged to Gabriel Fife and was raising Dell's daughter Betsey with him until they separated at some point after they left [[Los Angeles]].\n\nOthers\nNaomi had her first date since college, which didn't go too well because all she could talk about was her job.<ref>[[In Which Charlotte Goes Down the Rabbit Hole]], x (PP)</ref>\n\n\n[[Maya Bennett]]\nMaya is Naomi and Sam's daughter. Naomi wanted her to get an abortion after learning that Maya was pregnant. However, when Maya chose not to, Naomi was upset at her and retreated into her work. She ignored Maya's decision to get married to her boyfriend. She later followed Maya to New York to help her adjust to college.\n\n\n[[Addison Forbes Montgomery]]\nNaomi and Addison have been friends since medical school. They consider each other best friends, but they hadn't spoken after Addison's divorce with Derek until Addison's trip to LA. After Addison joined the practice, their friendship grew stronger again. The friendship hit a rough patch during Addison's and Sam's relationship, but they were able to overcome this over time and got back to being great friends.\n\n\nDr. Naomi Bennett is a [[Board Certification|board-certified]] [[Board Certification#American Board of Obstetrics and Gynecology|reproductive endocrinologist and infertility specialist]], as well as a founding partner of the [[Oceanside Wellness Group]]. Although Dr. Bennett's primary area of expertise is in fertility, she is also board certified in obstetrics and gynecology. She is a member of the American Society for Reproductive Medicine, the Society of Reproductive Endocrinology and Infertility, and the [[Fellow of the American College of Obstetricians and Gynecologists|American College of Obstetricians and Gynecologists]].\n\nThe owner of [[Pacific Wellcare Center]], [[William White]] visited Naomi and asked her to lunch, with the intention of offering her a job as the new director of Pacific Wellcare. Naomi refused initially, but William started making points about what he could offer, such as leadership of the practice, which Naomi feels she no longer has at [[Oceanside Wellness Group]]. She eventually takes the job, and in the process, Charlotte King is fired.\n\nWilliam's reasons for hiring her were because she has a heart, where he can obtain the best people in their field for his practice, Naomi is the reason they will stay.\n\n\n*She is Catholic.\n*She loves cake, particularly cheesecake.\n*Naomi hates pilates.\n*She does the crossword puzzle in the newspaper in pen because she rarely makes mistakes in them.<ref>[[In Which Sam Receives an Unexpected Visitor]], x (PP)</ref>\n*Despite having two [[Board Certification|board certifications]] in [[Obstetrics and Gynecology|OB/GYN]] and [[Reproductive Endocrinology and Infertility|REI]], she has never been referred to as \"double-board certified\". As both certifications are issued by the [[Board Certification#American Board of Obstetrics and Gynecology|same board]], board certification in OB/GYN is required to obtain a board certification in REI as an OB/GYN sub-specialty, this is likely the reason why she is not referred to as \"double-board certified\".\n*Naomi considers abortion to be murder.\n*She owned % of the practice.\n*She eats her feelings it's her way of coping with hard problems and emotions.\n\n\n<gallery widths=\"\" position=\"center\" orientation=\"landscape\" bordersize=\"none\" spacing=\"small\" hideaddbutton=\"true\">\nPPNaomiBennett.png\nPPNaomiBennett.png\nPPNaomiBennett.png\nPPxNaomiBennett.png\n</gallery>\n\n{{GalleryLink}}\n\n\nThese episodes are Naomi-centric or are otherwise very informative about her life.\n*[[A Family Thing]]\n*[[Ex-Life]]\n*[[A Death in the Family]]\n*[[Best Laid Plans]]\n*[[Love Bites]]\n*[[God Bless the Child]]\n*[[...To Change the Things I Can]]\n*[[In Which We Say Goodbye]]\n\n\n\n\n{{Naomi Bennett Appearances}}\n{{Scrollbox}}\n\n[[de:Naomi Bennett]]\n\n{{DEFAULTSORT:Bennett, Naomi}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:GA S Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Doctors]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Dee Bennett", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPx-.jpg\n|name = Dee Bennett\n|status = Alive\n|children = *[[Sam Bennett]]\n*[[Corinne Bennett]]\n|grandchildren = [[Maya Bennett]]\n|other family = *[[Naomi Bennett]] ''(daughter-in-law)''\n*[[Olivia Davis]] ''(great-granddaughter)''\n|workplace = Print shop\n|only appearance = [[The Next Episode]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]]\n|portrayed by = [[Alfre Woodard]]\n}}\n\n'''Dee Bennett''' is the mother of [[Sam Bennett]].\n\n\nWhile Sam had cameras following him to film a reality pilot about his life, Dee came to visit him. She brought with her [[Raymond McCray|Raymond]] and [[Jillian McCray]], her boss and his wife. Raymond needed cardiac studies after being in the ER a few weeks prior with chest pain. His symptoms had been getting worse since then. His EKG showed non-specific abnormalities, so Sam moved him to St. Ambrose for a chest CT and an echo.\n\nRaymond's tests showed pulmonary hypertension. Sam started him on anti-coagulants and placed an umbrella, which he hoped would solve the problem. When Jillian and Sam left Raymond's hospital room, the camera crew caught Dee and Raymond kissing in his room. Sam walked back in time to see it as well.\n\nWhile they ate dinner that night, Dee mentioned visiting Corinne, who was doing well. Sam snapped at her for putting a lot of salt on her food and then confronted her about her relationship with Raymond. Dee defended herself, saying things happen and it was for her to deal with.\n\nDee, Raymond, and Jillian all attended a barbecue at Sam's house a few days later. Raymond pulled Sam aside and said it wasn't a fling and he really loved Dee. Sam told him to get away from him. Raymond collapsed at the party and had to be rushed to the ER. They stabilized him and moved him to the OR to remove the clots.\n\nDuring the surgery, he started to bleed into his chest. He survived the surgery, but was told he needed a lung transplant. Sam suggested they start testing family members, but Raymond and Jillian said they didn't have any children or nieces and nephews. Dee wanted to pray, but Jillian instead suggested that Sam get tested revealing that Raymond is his biological father. Jillian told Raymond she'd known all along, but hadn't said anything.\n\nDee talked to Sam about how their relationship played out. Sam decided to get tested to see if he was a match for Raymond. The test revealed that he was a match and he told Raymond he'd donate if Raymond wanted it. Raymond told Sam about how he'd watched Sam grow up and how he'd thought a lot about what would be different if they were a family. But he made the choice to stay with Jillian. He told Sam he wouldn't let Sam take a part of himself to save him. He was ready to go. Jillian took Raymond back home to die.\n\n\n\nDee had an affair for over  years with her married boss, [[Raymond McCray]]. The relationship produced two children, Sam and Corinne. After Sam was born, Dee told Raymond that if he wanted to be in Sam's life, they needed to be a family. He decided to stay with his wife, so she tried to move on, but she couldn't stay away from him.\n\n\nDee raised her two children by herself because their father was married to another woman. According to her son, despite doing it alone, she spent more time with him than other kids whose moms stayed home. When they were young, Dee told her children that their father had walked out on them, but as an adult, Sam learned that Raymond, his mom's boss, was his biological father.\n\n\nShe works at the print shop that Raymond owns.\n\n \n*[[Bizzy Forbes]] once got drunk and asked Dee if ''Amistad'' was an accurate portrayal of slavery. Dee sarcastically told Bizzy that she would \ucask her slave friends\ud. <ref>[[The Next Episode]], x (PP) </ref>\n\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\n</gallery>\n\n{{DEFAULTSORT:Bennett, Dee}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]"}]}}}}