{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Augusta King", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPxAugustaKing.png\n|name = Augusta King\n|status = Alive\n|marital = [[\"Big Daddy\" King]] \u ''(husband)''\n|children = *[[Charlotte King]]\n*[[Duke King]]\n*[[Landry King]]\n|grandchildren = *[[Mason Warner]]\n*[[Georgia King-Freedman]]\n*[[Caroline King-Freedman]]\n*[[Rachel King-Freedman]]\n|other family = [[Cooper Freedman]] ''(son-in-law)''\n|only appearance = [[Something Old, Something New]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]]\n|portrayed by = [[Tess Harper]]\n}}\n'''Augusta King''' is the mother of [[Charlotte King]].\n\n\n\nWhen her husband was dying, Charlotte came home to Alabama to turn off the machines and say goodbye. During this time, Augusta was holed up in her room on drugs. ''(\"[[Homeward Bound]]\")''\n\n\nAugusta came to Los Angeles for Charlotte and Cooper's wedding. Charlotte showed her around and despite being introduced to Cooper's parents, they kept things separate. Augusta quickly picked up on the fact that the Freedmans didn't like Charlotte.\n\nAfter Amelia's plea that the Freedmans get to know Charlotte better, they talked to Augusta at the party. The three of them agreed that Charlotte and Cooper shouldn't get married and told their children that.\n\nAfter hearing that, Charlotte and Cooper flew to Las Vegas to elope instead of having the wedding. ''(\"[[Something Old, Something New]]\")''\n\n\n\nShe was married to Big Daddy King until he died.\n\n\nShe has three kids: Duke, Landry, and Charlotte.\n\n\n*She's a drug addict.\n\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPPx-.png\nPPx-.jpg\nPPx-.jpg\nPPx-.jpg\n</gallery>\n\n{{DEFAULTSORT:King, Augusta}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Cooper Freedman", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = PPx-.jpg\n|name = Cooper Freedman\n|status = Alive\n|alias = *Coop\n*Dr. Seuss\n*Marcel\n*Husband #\n*Mr. Sage\n*Dog Whisperer\n|title = M.D., [[Fellow of the American Academy of Pediatrics|F.A.A.P.]]\n|marital = [[Charlotte King]] ''(wife)''\n|children = *[[Mason Warner]] ''(with [[Erica Warner|Erica]])''\n*[[Georgia King-Freedman]]\n*[[Caroline King-Freedman]]\n*[[Rachel King-Freedman]]\n|siblings = Andy Freedman \u\n|parents = *[[Lawrence Freedman]]\n*[[Myra Freedman]]\n|grandparents = *Walter\n*Miriam\n*Irving\n*Rivka\n|other family = *[[Duke King]] ''(brother-in-law)''\n*[[Landry King]] ''(brother-in-law)''\n*[[\"Big Daddy\" King]] \u ''(father-in-law)''\n*[[Augusta King]] ''(mother-in-law)''\n|job= [[Attending]] [[Pediatrics|Pediatrician]]\n|workplace = '''Current'''<br>[[Seaside Health and Wellness]]\n'''Former'''<br>[[Oceanside Wellness Group]]\n|first appearance = *'''[[Grey's Anatomy|GA]]:''' [[The Other Side of This Life, Part ]]\n*'''[[Private Practice|PP]]:''' [[In Which We Meet Addison, a Nice Girl From Somewhere Else]]\n|last appearance = *'''[[Grey's Anatomy|GA]]:''' [[The Other Side of This Life, Part ]]\n*'''[[Private Practice|PP]]:''' [[In Which We Say Goodbye]]\n|count = \n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season  (Grey's Anatomy)|]]\n*'''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], and [[Season  (Private Practice)|]]\n|portrayed by = [[Paul Adelstein]]\n}}\n{{Quote|Life is full of failure. It's how we learn.|Cooper Freedman}}\n\n'''Cooper Freedman''' is a [[Pediatrics|pediatrician]] at [[Seaside Health and Wellness]]. He is married to [[Charlotte King]], with whom he has three daughters, [[Georgia King-Freedman|Georgia]], [[Caroline King-Freedman|Caroline]] and [[Rachel King-Freedman]] and a son, [[Mason Warner]].\n\n\n\nCooper was adopted as a child but he never sought out his biological parents as his adoptive parents were great. He grew up in Shaker Heights, Ohio in Cuyahoga County. Around the age of , Cooper found out that his adoptive parents had a son named Andy, who died a couple of years before they adopted him. This made him extremely mad at his parents, as he believed they only adopted him to fill the void. He later realized that they truly loved him and that he wasn't a replacement, but the situation left him with a deep fear of being someone's second choice.\n\n\nHe involved himself with the law several times with a patient who was seen as kidnapped by his non-custodial father. It turned out that he did not like his step-father and that he felt that he took his mother from his father. The patient turned out to be abusing himself so that his mother would believe him, but only his father did, so they ran away. Cooper later helped him, as he and his father lived out of a car. He also didn't call the police to report the missing child.\n\n\nOne day while at work, a woman named [[Erica Warner]] approached Cooper. Cooper realized that they had a one night stand years ago in his car. Erica then introduced a young boy named [[Mason Warner|Mason]] and said that he was Cooper's son. After Erica died, Charlotte and Cooper got full custody of Mason. Right after his mother's death, Mason refused to talk to Cooper and Charlotte, but after some time, Mason bonded with both Cooper and Charlotte.\n\n\nCooper and Charlotte became pregnant with triplets. Cooper did his best to support his wife, who didn't even want kids in the first place, which is why he was over the moon when she became pregnant with triplets. One of the babies was born prematurely, but with the dedicated support from her parents and friends, she pulled through. With some extraordinary measures taken, the other two babies stayed in utero long enough to be born naturally and around the due date.\n\nAfter the birth of their triplets, Charlotte and Cooper agreed he would stay home to take care of them while she returned to work, but Cooper soon found out three kids were too much to handle. They hired people to help out and both Cooper and Charlotte returned to work at the practice and St. Ambrose, all the while raising their four kids.\ua\n\n\nViolet described him in her book as a \"man child.\" Despite this description, Cooper is a very good pediatrician. He goes beyond everything to make sure his patients are safe, sometimes even crossing legal borders.\n\n\n\nCooper has problems meeting women because he says that he cannot socialize with people over the age of twelve (because of his profession). So instead of dating face-to-face, Cooper prefers internet dating. These online relationships almost never work out and he is always left humiliated. For example, Cooper got his car stolen from a woman he met online called \"SexyBoobs\".<ref>[[The Other Side of This Life, Part ]], x</ref>\n\n[[Charlotte King]]\nCooper \"[[In Which Cooper Finds a Port in His Storm|met]]\" [[Charlotte King]], who is Chief of Staff at the local hospital and someone he knows professionally, through an on-line dating site. She was completely embarrassed by this and walked away from the date, and attempted to avoid Cooper thereafter, but later, she agreed to have a drink with Cooper, but instead, the two ended up having sex and later entered into a relationship.\n\nCooper and Charlotte did eventually break up, but Cooper still tried to get Charlotte back and was supportive of her when she believed she was pregnant. Charlotte disliked the relationship between Cooper and Violet and this was usually the point of issue in their relationship.\n\nFollowing the death of her father, Charlotte asked Cooper to marry her. He initially accepted, but later changed his mind as he wanted their wedding to be a proper wedding, and not a spur of the moment, grief-coping mechanism wedding, although they do eventually [[Something Old, Something New|marry in Vegas]].\n\nCharlotte later became pregnant with female triplets. Charlotte [[Life Support|prematurely delivered]] the first triplet, later named Georgia. Cooper stayed with the baby while she was in the [[Neonatal Intensive Care Unit|NICU]]. For a while, she was on a ventilator, but eventually she was able to breathe on her own. Charlotte later [[Full Release|delivered]] the other two triplets. Since Charlotte named Georgia, Mason named the second baby Caroline, and Cooper named the third Rachel.\n\n[[Erica Warner]]\nErica Warner is a one-night stand from Cooper's past. Years later, she arrives at Cooper's workplace and tells him she has a kid, Mason Warner, and Cooper's the father.\n\n[[Amelia Shepherd]]\nCooper kissed Amelia while engaged to Charlotte, but Amelia pushed him off and remained friends.\n\n\nCooper is a very caring father for his four children. After the birth of his three daughters, he was a stay at home dad, but it was too much for him, so he demanded that Charlotte hire a nanny.\n\nWalter\nCooper has a grandfather named Walter who was a piano tuner. He suggested Walter as a possible name when he and Charlotte thought she was pregnant.<ref>[[Know When to Fold]], x (PP)</ref>\n\n\n[[Violet Turner]]\nCooper has always been extremely close to [[Violet Turner]] having a friends only relationship with her. He helped her get through her multiple break ups with Allan. They once attempted to have \"friends, with benefits\" arrangement, but Cooper found it too weird.\n\nWhen Violet became pregnant, she asked Cooper to move in with her to take care of her as her pregnancy progressed.\n\nDuring the attack on Violet by the schizophrenic patient Katie, Cooper was standing outside the house. He later blamed himself for not being there, when Violet needed him most.\n\n[[Sam Bennett]]\n\n[[Pete Wilder]]\n\n\nDr. Cooper Freedman is a [[Board Certification|board certified]] [[Board Certification#American Board of Pediatrics|pediatrician]]. He is a [[Fellow of the American Academy of Pediatrics|member of the American Academy of Pediatrics]]. A dedicated, effective physician, Dr. Freedman is a whiz with all things adolescent. Dr. Freedman prides himself on making kids laugh. Cooper is willing to do basically anything to save his patients, sometimes even crossing legal lines.\n\n\n*He's from Akron.<ref>[[Past Tense]], x (PP)</ref>\n*Cooper is fluent in American Sign Language.\n*He thinks that long division is stupid.\n*His favorite color is chartreuse, because he likes the sound of the word.<ref>[[Past Tense]], x (PP)</ref>\n*Cooper\uaand [[Sam Bennett|Sam]] are the only characters that appeared in every episode of\ua''[[Private Practice]]''.\n*He realized that he wanted to be a pediatrician when he spent summers working at a children's camp in Indiana.<ref>[[Past Tense]], x (PP)</ref>\n*Due to his [[Pediatrics|specialty]] and his lack of practicing pediatric sub-specialties, Cooper is the lowest earning doctor, in terms of salary, at the [[Seaside Health and Wellness]]\n*As a child, he liked magic. He also used to play the piano.\n*He likes to dip his fries in a strawberry milkshake, like his son [[Mason Warner|Mason]].\n*He is Jewish.\n*He wears briefs instead of boxers.\n*He hates physical education.<ref>[[Nothing to Talk About]], x (PP)</ref>\n*He's pro-choice.<ref>[[Crime and Punishment]], x (PP)</ref>\n*When he was a child, he always\uacarried around this doll he called Ernesta.<ref>[[What Women Want]], x (PP)</ref>\n*His cell phone number is () -.<ref>[[Short Cuts]], x (PP)</ref>\n\n\n<gallery widths=\"\" position=\"center\" orientation=\"landscape\" bordersize=\"none\" spacing=\"small\" hideaddbutton=\"true\">\nPPCooperFreedman.png\nPPCooperFreedman.png\nPPxCooperFreedman.png\nPPxCooperFreedman.png\n</gallery>\n\n{{GalleryLink}}\n\n\nThese episodes are Cooper-centric or otherwise very informative about his life.\n*[[In Which Cooper Finds a Port in His Storm]]\n*[[Worlds Apart]]\n*[[Life Support]]\n\n\n:'''Cooper:''' Life is full of failure. It's how we learn.<ref>[[If I Hadn't Forgotten...]], x (PP)</ref>\n\n\n{{Cooper Freedman Appearances}}\n{{Scrollbox}}\n\n[[fr:Cooper Freedman]]\n[[de:Cooper Freedman]]\n\n{{DEFAULTSORT:Freedman, Cooper}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Doctors]]\n[[Category:Patients]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (ID)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Georgia King-Freedman", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = GeorgiaKingFreedman.png\n|name = Georgia King-Freedman\n|born = ; [[Los Angeles]], California\n|status = Alive\n|parents = *[[Cooper Freedman]]\n*[[Charlotte King]]\n|siblings = *[[Mason Warner]] ''(half-brother)''\n*[[Caroline King-Freedman]]\n*[[Rachel King-Freedman]]\n|grandparents = *[[Lawrence Freedman]]\n*[[Myra Freedman]]\n*[[Augusta King]]\n*[[\"Big Daddy\" King]] \u\n|other family = *[[Duke King]] ''(uncle)''\n*[[Landry King]] ''(uncle)''\n*Andy Freedman \u ''(uncle)''\n|first appearance = [[Life Support]]\n|last appearance = [[In Which We Say Goodbye]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]]\n|portrayed by = *Rebecca Mark\n*Sierra Mark\n}}\n'''Georgia King-Freedman''' is the eldest daughter of\ua[[Charlotte King]]\uaand\ua[[Cooper Freedman]].\n\n\n\nWhen Charlotte went into labor at  weeks, they attempted to stop her labor, but one of the babies was already presenting, so they were forced to deliver. After she was born, labor stopped and the remaining membranes were intact, so they sewed up her cervix to keep the others in while the newborn was rushed to the NICU.\n\n\nShe was born with ectopic cordis, which required immediate surgery. Sam said he'd operate that day and then in a year, when she'd grown more, she'd need a skin graft. Her heart was twisted under the graft, but Sam was able to untwist it and her surgery was successful.\n\nAfter her surgery, Cooper stole holy water from the hospital chapel and poured it over her incubator after telling her to fight. ''(\"[[Life Support]]\")''\n\nWhen she was two weeks old, she started breathing on her own, so they took her off the ventilator and allowed Cooper to hold her skin to skin, which helped her oxygenation. Later, Cooper worried about her falling pulse ox and rising heart rate. Over the objections of [[Nurse Danielle|Danielle]], he ordered tests for her. The tests showed RSV pneumonia, which meant she had to go back on the ventilator. When she continued to decline, Sam decided to try ECMO, but Addison said it was risky. They decided it was the best chance she had, so they did it despite the risks. She started to improve on ECMO, though she had to stay on the ventilator, before eventually being able to come off that again as well. When Charlotte went into labor, she visited the baby for the first time on her way to labor and delivery and named her Georgia. ''(\"[[Georgia on My Mind]]\")''\n\nWhen her sisters were born, Georgia was proclaimed well enough to leave the NICU to visit. ''(\"[[Full Release]]\")''\n\n\nAfter they went home, Cooper decided to stay home to raise the triplets. However, after doing so for a while, he decided that they needed to hire a nanny. ''(\"[[In Which We Say Goodbye]]\")''\n\n\n\nGeorgia is one of a set of triplets, along with [[Rachel King-Freedman|Rachel]] and [[Caroline King-Freedman|Caroline]]. They live with their parents and older brother, [[Mason Warner]].\n\n\n*She was born at  weeks.<ref>[[Life Support]], x (PP)</ref>\n*Addison stated that she was presenting as a footling breech.<ref>[[Life Support]], x (PP)</ref>\n*She has a different birthday than her sisters.\n*[[Charlotte King|Charlotte]]\uachose her name.<ref>[[Georgia on My Mind]], x (PP)</ref>\n\n\n\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPPxGeorgiaKingFreedman.png|[[Life Support]]\nPPxGeorgiaKingFreedman.png|[[Georgia on My Mind]]\nPPxGeorgiaKingFreedman.png|[[Full Release]]\nPPxTriplets.png|[[In Which We Say Goodbye]] (with her family)\n</gallery>\n\n\n{{Georgia King-Freedman Appearances}}\n{{Scrollbox}}\n\n[[de:Georgia King-Freedman]]\n\n{{DEFAULTSORT:King-Freedman, Georgia}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:Patients]]\n[[Category:Patients (Cardio)]]\n[[Category:Patients (Neonatal)]]\n[[Category:Patients (Neuro)]]\n[[Category:Patients (MFM)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Lawrence Freedman", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPxLawrenceFreedman.png\n|name = Lawrence Freedman\n|status = Alive\n|marital = [[Myra Freedman]] ''(wife)''\n|children = *Andy Freedman \u\n*[[Cooper Freedman]]\n|grandchildren = *[[Mason Warner]]\n*[[Georgia King-Freedman]]\n*[[Caroline King-Freedman]]\n*[[Rachel King-Freedman]]\n|other family = [[Charlotte King]] ''(daughter-in-law)''\n|only appearance = [[Something Old, Something New]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]]\n|portrayed by = [[John Rothman]]\n}}\n'''Lawrence Freedman''' is the father of [[Cooper Freedman]].\n\n\nLawrence and his wife came to Los Angeles for Cooper's wedding. When the arrived, they found Violet, whom they're very fond of. They decided to go out to lunch and neither Charlotte nor her mother was included, though Violet was invited to come along. After Violet left their lunch, they told Cooper they didn't think Charlotte was good enough for him. They thought she was cold and recalled at the times he'd told them about when she hurt him.\n\nAt the party the night before the wedding, Amelia talked to them and told them to give Charlotte a chance, to get to know her better. Instead, they talked to her mother and the three of them agreed that Charlotte and Cooper shouldn't get married.\n\nIn reaction to hearing this, Charlotte and Cooper skipped out on their wedding to elope in Vegas.\n\n\n\nHe is married to [[Myra Freedman]].\n\n\nHe and his wife had a son, Andy, who died. After Andy's death, they adopted Cooper as a newborn.\n\n\n*He taught both his sons to play piano. ''(\"[[The Hardest Part]]\")''\n*He had a heart attack when Cooper was . ''(\"[[God Laughs]]\")''\n\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPPx-.jpg\n</gallery>\n\n{{DEFAULTSORT:Freedman, Lawrence}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Myra Freedman", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPxMyraFreedman.png\n|name = Myra Freedman\n|status = Alive\n|marital = [[Lawrence Freedman]] ''(husband)''\n|children = *Andy Freedman \u\n*[[Cooper Freedman]]\n|grandchildren = *[[Mason Warner]]\n*[[Georgia King-Freedman]]\n*[[Caroline King-Freedman]]\n*[[Rachel King-Freedman]]\n|other family = [[Charlotte King]] ''(daughter-in-law)''\n|only appearance = [[Something Old, Something New]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]]\n|portrayed by = [[Cristine Rose]]\n}}\n'''Myra Freedman''' is the mother of [[Cooper Freedman]].\n\n\nMyra and her husband came to Los Angeles for Cooper's wedding. When the arrived, they found Violet, whom they're very fond of. They decided to go out to lunch and neither Charlotte nor her mother was included, though Violet was invited to come along. After Violet left their lunch, they told Cooper they didn't think Charlotte was good enough for him. They thought she was cold and recalled at the times he'd told them about when she hurt him.\n\nAt the party the night before the wedding, Amelia talked to them and told them to give Charlotte a chance, to get to know her better. Instead, they talked to her mother and the three of them agreed that Charlotte and Cooper shouldn't get married.\n\nIn reaction to hearing this, Charlotte and Cooper skipped out on their wedding to elope in Vegas.\n\n\n\nShe is married to [[Lawrence Freedman]].\n\n\nShe and her husband had a son, Andy, who died. After Andy's death, they adopted Cooper as a newborn.\n\n\n*She is said to be non-musical. ''(\"[[The Hardest Part]]\")''\n*She is Jewish.\n\n\n\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPPx-.jpg\n</gallery>\n\n{{DEFAULTSORT:Freedman, Myra}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "\"Big Daddy\" King", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPxBigDaddyKing.png\n|name = \"Big Daddy\" King\n|status = Deceased\n|alias = Big Daddy\n|marital = [[Augusta King]] ''(wife)''\n|children = *[[Charlotte King]]\n*[[Duke King]]\n*[[Landry King]]\n|grandchildren = *[[Mason Warner]]\n*[[Georgia King-Freedman]]\n*[[Caroline King-Freedman]]\n*[[Rachel King-Freedman]]\n|other family = [[Cooper Freedman]] ''(son-in-law)''\n|only appearance = [[Homeward Bound]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]]\n}}\n'''\"Big Daddy\" King''' was the father of [[Charlotte King]].\n\n\n\"Big Daddy\" had been diagnosed with lung cancer. The doctors anticipated he would only live six more months, but he lived another two years. When the time came that he was dying and someone needed to turn off the machines, Charlotte flew down to her parents' house to do so, as neither of her brothers could do it. After a stretch of time sitting with him and debating it, Charlotte went to turn off the machine, but found she couldn't do it. After she struggled for a while, Cooper took over and turned off the machine, allowing \"Big Daddy\" to die. She gave him a kiss on his forehead to say goodbye.\n\n\n\nHe was married to [[Augusta King]] until his death.\n\n\nHe had three kids: Duke, Landry, and Charlotte. According to his daughter, he was cruel to everyone but her. He loved her being a doctor and not just getting married and having babies.\n\n\n*He didn't believe in tears, so she said cancer was his chickens coming home to roost.\n\n{{DEFAULTSORT:King, \"Big Daddy\"}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:Deceased Characters]]\n[[Category:Patients]]\n[[Category:Patients (Oncology)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Caroline King-Freedman", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = CarolineKingFreedman.png\n|name = Caroline King-Freedman\n|born = ; [[Los Angeles]], California\n|status = Alive\n|parents = *[[Cooper Freedman]]\n*[[Charlotte King]]\n|siblings = *[[Mason Warner]] ''(half-brother)''\n*[[Georgia King-Freedman]]\n*[[Rachel King-Freedman]]\n|grandparents = *[[Lawrence Freedman]]\n*[[Myra Freedman]]\n*[[Augusta King]]\n*[[\"Big Daddy\" King]] \u\n|other family = *[[Duke King]] ''(uncle)''\n*[[Landry King]] ''(uncle)''\n*Andy Freedman \u ''(uncle)''\n|first appearance = [[Full Release]]\n|last appearance = [[In Which We Say Goodbye]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]]}}\n'''Caroline King-Freedman''' is the second/middle daughter of\ua[[Charlotte King]]\uaand\ua[[Cooper Freedman]].\n\n\n\nEight weeks after Georgia was born, Charlotte went into labor with the remaining two triplets. Caroline was born first and was followed not long after by Rachel.\n\nWhile holding her after birth, Mason looked at the baby and said he thought Caroline was her name. ''(\"[[Full Release]]\")''\n\n\nAfter they went home, Cooper decided to stay home to raise the triplets. However, after doing so for a while, he decided that they needed to hire a nanny. ''(\"[[In Which We Say Goodbye]]\")''\n\n\n\nCaroline is one of a set of triplets, along with [[Rachel King-Freedman|Rachel]] and [[Georgia King-Freedman|Georgia]]. They live with their parents and older brother, Mason.\n\n\n*Along with her sister, Rachel, she was born at  weeks.\n*She was the only King-Freedman triplet who was born head first.\n*Her brother,\ua[[Mason Warner|Mason]]\uachose her name.\n*She likes the pink bunny. ''(\"[[In Which We Say Goodbye]]\")''\n\n\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\">\nPPxCarolineKingFreedman.png|[[Full Release]]\nPPxTriplets.png|[[In Which We Say Goodbye]] (with her family)\n</gallery>\n\n[[de:Caroline King-Freedman]]\n{{DEFAULTSORT:King-Freedman, Caroline}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:Patients]]\n[[Category:Patients (Neonatal)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Duke King", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPDukeandLandryKing.png\n|name = Duke King\n|status = Alive\n|siblings = *[[Charlotte King]]\n*[[Landry King]]\n|parents = *[[\"Big Daddy\" King]] \u\n*[[Augusta King]]\n|other family = *[[Cooper Freedman]] ''(brother-in-law)''\n*[[Mason Warner]] ''(nephew)''\n*[[Georgia King-Freedman]] ''(niece)''\n*[[Rachel King-Freedman]] ''(niece)''\n*[[Caroline King-Freedman]] ''(niece)''\n|only appearance = [[Homeward Bound]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]]\n|portrayed by = [[Tyler Jacob Moore]]\n}}\n'''Duke King''' is the brother of [[Charlotte King]].\n\n\nWhen Big Daddy reached the end of his fight with lung cancer, Charlotte came to Alabama in order to say goodbye. Landry was supposed to turn off the machines, but he was unable to, forcing Charlotte to do it. Duke wouldn't even go into the room.\n\n\n*He wasn't able to enter his father's room while he was dying.\n\n{{DEFAULTSORT:King, Duke}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Mason Warner", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPx-.jpg\n|name = Mason Warner\n|status = Alive\n|alias = Mase\n|parents = *[[Cooper Freedman]]\n*[[Erica Warner]] \u\n*[[Charlotte King]] ''(stepmother)''\n|siblings = *[[Georgia King-Freedman]] ''(half-sister)''\n*[[Caroline King-Freedman]] ''(half-sister)''\n*[[Rachel King-Freedman]] ''(half-sister)''\n|grandparents = *[[Lawrence Freedman]]\n*[[Myra Freedman]]\n*Grandmother \u\n|other family = *[[Duke King]] ''(uncle)''\n*[[Landry King]] ''(uncle)''\n*Andy Freedman \u ''(uncle)''\n*[[Augusta King]] ''(step-grandmother)''\n*[[\"Big Daddy\" King]] \u ''(step-grandfather)''\n|first appearance = [[Deal With It]]\n|last appearance = [[In Which We Say Goodbye]]\n|count = \n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]] and [[Season  (Private Practice)|]]\n|portrayed by = [[Griffin Gluck]]\n}}\n'''Mason Warner''' is the son of [[Cooper Freedman]] and [[Erica Warner]]. His mother Erica raised him from the time he was born until she died. He is currently being raised by [[Cooper Freedman]] and [[Charlotte King]] following the death of his mother.\n\n\n\nMason was conceived in the back of Erica's car.\n\n\nMason met Cooper when he had his check-up. He was unaware that Cooper was his dad and thought he was just his doctor. They bonded nicely doing different activities together.\n\nMason decided he didn't want to keep seeing Cooper. When Cooper talked to him later, Mason asked if Cooper was his dad. Mason said they couldn't be friends if he was not going to be around, like the other guys. Erica and Cooper told Mason he was his dad and Cooper said he wasn't going anywhere.\ua\n\n\nEven though Erica explicitly said she didn't want Mason to meet Charlotte, Charlotte came home early and Mason and Cooper were there. Cooper introduced Charlotte to Mason. They started to bond when they were playing a video game together. Erica walked in and was unhappy to see Mason talking to Charlotte. They both left without Mason saying goodbye to Charlotte. At the end of the day, Erica returned with Mason, and said that he could have a sleepover and Mason bonded with Cooper and Charlotte.\n\n\nMason had to see his mother suffer through her brain tumor, yet he has no idea about it and just thought she was tired. One day while he was at Charlotte and Cooper's house, he wanted to see his mom, but he wasn't allowed. Charlotte turned her back for one minute and he ran out the door to see his mom. He was found only a few minutes later sitting outside on a bench.\n\nErica told him that she was sick when they were in Seattle, where Derek and Amelia would attempt to remove the tumor. He was upset, but forgave her after she came out of surgery safely. However, she was later admitted with severe abdominal pain and she threw up blood. Cooper quickly took Mason away from his mother, who was found to have metastases. She only had one more week to live in severe pain, so she refused to let Mason see her become weak and pathetic. Charlotte understood and explained this to Mason, so they arranged one last visit to say goodbye. They told each other they loved one another and Mason promised he'd be a good boy.\n\nAs Charlotte continued to care for Erica, she showed her some pictures of Mason Cooper took. Erica still decidedly refused to let him see her, resulting in a weird situation where Mason would hang out at the hospital with Cooper and Charlotte, knowing his mother was still alive. It was very tough on Mason, so when Charlotte went to deliver a final drawing of Mason's in Erica's final moments, she urged Erica to let Mason see her. Erica consented, so Charlotte quickly ran off to get Mason. They returned just in time for Mason to tell his mother that he loved her, after which she passed away. This final moment was what Mason needed to accept that his mother was truly dying, finally bursting into tears.\n\nDuring his grief process, Mason began to sleep in Cooper and Charlotte's bed, which he'd wet. He also refrained from talking. Charlotte eventually confronted him about this. He said he started to forget things about his mother, which made him sad. He knew she had asked them to talk about her and keep his life as normal as possible, but his life didn't feel normal to him at all, so he didn't want to talk about it. When Cooper later tried to get him to talk while tucking him in, Mason just turned his back towards him and remained silent.\n\n\nMason is hardworking and intelligent. His grades in school matter a lot to him, and sometimes, according to Erica, he pushes himself too hard.\ua He has a good heart and very polite.\ua He is similar to his father.\ua\ua\n\n\n\n[[Erica Warner]]\nErica was Mason's mom. He had a very loving relationship with her. After her death, he started to pee his bed and didn't talk to his dad or to [[Charlotte King|Charlotte]].\n\n[[Cooper Freedman]]\nCooper is Mason's dad. When Erica found out about her tumor, she brought Mason to LA to find Cooper. Mason was not very close with Cooper or Charlotte at first, and immediately following Erica's death, he didn't talk to either of them. After a while, he bonded with Charlotte and Cooper, as well as his three little sisters who were born later on.\n\n\n[[Charlotte King]]\nMason was initially not allowed to see Charlotte, but when she came home early and Mason was there, she was introduced and they bonded together.\n\n\n*He named his sister, Caroline.\n*He calls [[Charlotte King|Charlotte]] Mama.\n*To date, he's the only child to be a member of the main cast of [[Private Practice]] or its parent show, [[Grey's Anatomy]] or its other spin-off show, [[Station ]].\n*He likes to dip his fries in a strawberry milkshake.\n*He's allergic to chocolate.<ref>[[Don't Stop 'Till You Get Enough]], x (PP)</ref>\n*He only sleeps on Jersey sheets.\n*His mother let him have twenty minutes to be upset about something, then he had to have fun.\n*While he has never appeared on Grey's Anatomy, [[Amelia Shepherd|Amelia]] showed [[Derek Shepherd|Derek]] a picture of him in [[Have You Seen Me Lately?]].\n*He loves the Disney show Phineas and Ferb.\n\n\n<gallery widths=\"\" position=\"center\" orientation=\"landscape\" bordersize=\"none\" spacing=\"small\" hideaddbutton=\"true\">\nPPxMasonWarner.png\nPPxMasonWarner.png\nPPxMasonWarner.png\nPPxMasonWarner.png\n</gallery>\n\n{{GalleryLink}}\n\n\nThese episodes are Mason-centric or are otherwise very informative about his life.\n*[[Remember Me]]\n*[[It Was Inevitable]]\n\n\n:'''Mason (to [[Cooper Freedman|Cooper]]):''' [''Sticks tongue out''] Mom says it's not allowed.\n:'''[[Erica Warner|Erica]]:''' It is when the doctor asks.\n:'''Mason:''' So if the doctor asks me to say \"crap\"...\n:'''[[Erica Warner|Erica]]:''' Mason!\n\n\n{{Mason Warner Appearances}}\n{{Scrollbox}}\n\n[[de:Mason Warner]]\n\n{{DEFAULTSORT:Warner, Mason}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Trauma)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Landry King", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PPDukeandLandryKing.png\n|name = Landry King\n|status = Alive\n|siblings = *[[Charlotte King]]\n*[[Duke King]]\n|parents = *[[\"Big Daddy\" King]] \u\n*[[Augusta King]]\n|other family = *[[Cooper Freedman]] ''(brother-in-law)''\n*[[Mason Warner]] ''(nephew)''\n*[[Georgia King-Freedman]] ''(niece)''\n*[[Rachel King-Freedman]] ''(niece)''\n*[[Caroline King-Freedman]] ''(niece)''\n|only appearance = [[Homeward Bound]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]]\n|portrayed by = [[Caleb Moody]]\n}}\n'''Landry King''' is the brother of [[Charlotte King]].\n\n\nWhen Big Daddy reached the end of his fight with lung cancer, Charlotte came to Alabama in order to say goodbye. Landry was supposed to turn off the machines, but he was unable to, forcing Charlotte to do it.\n\n{{DEFAULTSORT:King, Landry}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Rachel King-Freedman", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = RachelKingFreedman.png\n|name = Rachel King-Freedman\n|born = , [[Los Angeles]], California\n|status = Alive\n|parents = *[[Cooper Freedman]]\n*[[Charlotte King]]\n|siblings = *[[Mason Warner]] ''(half-brother)''\n*[[Georgia King-Freedman]]\n*[[Caroline King-Freedman]]\n|grandparents = *[[Lawrence Freedman]]\n*[[Myra Freedman]]\n*[[Augusta King]]\n*[[\"Big Daddy\" King]] \u\n|other family = *[[Duke King]] ''(uncle)''\n*[[Landry King]] ''(uncle)''\n*Andy Freedman \u ''(uncle)''\n|first appearance = [[Full Release]]\n|last appearance = [[In Which We Say Goodbye]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]]\n}}\n'''Rachel King-Freedman''' is the youngest daughter of\ua[[Charlotte King]]\uaand\ua[[Cooper Freedman]].\n\n\n\nEight weeks after Georgia was born, Charlotte went into labor with the remaining two triplets. She delivered Caroline easily, but Rachel was transverse. Addison decided she could rotate the baby and deliver her breech. Despite the problem, Rachel was healthy at birth. Cooper then decided on the name Rachel for her. ''(\"[[Full Release]]\")''\n\n\nAfter they went home, Cooper decided to stay home to raise the triplets. However, after doing so for a while, he decided that they needed to hire a nanny. ''(\"[[In Which We Say Goodbye]]\")''\n\n\n\nRachel is one of a set of triplets, along with [[Georgia King-Freedman|Georgia]] and [[Caroline King-Freedman|Caroline]]. They live with their parents and older brother, Mason.\n\n\n*Along with her sister, Caroline, she was born at  weeks.\n*Addison stated that she was presenting sideways at the time of delivery.\n*She was born breech.\n*[[Cooper Freedman|Cooper]] chose her name.\n*She likes the green bunny. ''(\"[[In Which We Say Goodbye]]\")''\n\n\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\">\nPPxRachelKingFreedman.png|[[Full Release]]\nPPxTriplets.png|[[In Which We Say Goodbye]] (with her family)\n</gallery>\n\n[[de:Rachel King-Freedman]]\n\n{{DEFAULTSORT:King-Freedman, Rachel}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:Patients]]\n[[Category:Patients (Neonatal)]]"}]}}}}{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"": {"pageid": , "ns": , "title": "Charlotte King", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = PPx-.jpg\n|name = Charlotte King\n|status = Alive\n|alias = *canyouhandleme\n*Charlie\n*Char\n*Cruella\n*Herr Charlotte\n*Satan\n*The Wicked Witch of St. Ambrose\n*Big Bad Bitch Charlotte\n|title = M.D.\n|marital = *[[Billy Douglas]] ''(ex-husband)''\n*[[Cooper Freedman]] ''(husband)''\n|children = *[[Mason Warner]] ''(stepson)''\n*[[Georgia King-Freedman]]\n*[[Caroline King-Freedman]]\n*[[Rachel King-Freedman]]\n|siblings = *[[Duke King]]\n*[[Landry King]]\n|parents = *[[\"Big Daddy\" King]] \u\n*[[Augusta King]]\n|other family = *Buster Hodges ''(uncle)''\n*[[Lawrence Freedman]] ''(father-in-law)''\n*[[Myra Freedman]] ''(mother-in-law)''\n*Andy Freedman \u ''(brother-in-law)''\n|job = *[[Chief of Staff]]\n*[[Sexology|Sexologist]]\n*[[Attending]] [[Urology|Urologist]]\n|workplace = '''Current'''<br>[[St. Ambrose Hospital]]<br>[[Seaside Health and Wellness]]\n'''Former'''<br>[[Oceanside Wellness Group]]<br>[[Pacific Wellcare Center]]\n|first appearance = [[In Which We Meet Addison, a Nice Girl From Somewhere Else]]\n|last appearance = [[In Which We Say Goodbye]]\n|count = \n|seasons = '''[[Private Practice|PP]]:''' [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], [[Season  (Private Practice)|]], and [[Season  (Private Practice)|]]\n|portrayed by = [[KaDee Strickland]]\n}}\n{{Quote|Here's some free advice. Kindergarten's over. Training wheels are off. Nobody's gonna catch you if you fall. If you don't like your life, you do something about it. You reach down, you pull one foot out of the mud, then the other. You walk away from it. You can't walk, you crawl. You do something. Join a gym. Join a club. Join a cult. Do something, anything. What you don't do is whine to me about it.|[[Charlotte King]]}}\n\n'''Charlotte King''' is the [[Chief of Staff]] and [[Attending|attending]] [[Urology|urologist]] at [[St. Ambrose Hospital]]; additionally, she is a [[Sexology|sexologist]] at [[Seaside Health and Wellness]]. She is married to\ua[[Cooper Freedman]]\uawith whom she has four kids:\ua[[Mason Warner]], and\ua[[Georgia King-Freedman|Georgia]],\ua[[Caroline King-Freedman|Caroline]], and\ua[[Rachel King-Freedman]].\n\n\n\nShe is from Monroeville, Alabama.\n\nGrowing up, she was told, by her father, how sweet she was for taking care of her younger brothers.\n\nWhen she was fifteen, she had to shoot her horse Marjorie after it sprained its ankle. Marjorie was her last pet and when she thought she might have been pregnant, she thought about naming the baby Marjorie.\n\nShe always wanted to make her father, Big Daddy, proud, so she became a doctor.\n\n\nCharlotte met\ua[[Billy Douglas]], with whom she eventually married. At one point, she came home from the hospital after work and found him in bed with another woman. Charlotte lost her self control and dragged the woman off her husband and jumped Billy, yelling at him. The woman then grabbed a vase and smashed it on Charlotte's head, knocking her out. Billy called , but left before the paramedics arrived. Charlotte couldn't forgive him for what happened, ending the marriage<ref>[[If I Hadn't Forgotten...]], x (PP)</ref>.\n\n\nFollowing the attack, Charlotte became addicted to the pain medication. She tried to get her colleague, who treated her after the attack, to write her another prescription, but he was aware of the dangers of addiction. She tried to convince him saying she'd know when to stop as a doctor, but he only offered to write her a prescription for pills with a lighter effect. She declined and left.\n\nSome time later, drugged after a shift, Charlotte was driving her car through a storm. She began to fall asleep at the wheel and deviated from her lane. She didn't notice the car approaching in the opposite direction, causing the other driver to have to get out of the way, slipping and crashing into a pole. The crash brought Charlotte back to her senses. She pulled over and went to help the woman, but the woman had flown through her windshield. Charlotte called , but the woman didn't make it. The truth about the accident was never uncovered, as the woman was deemed a careless driver for not wearing a seat belt and Charlotte never told the truth.\n\n\nCooper and Charlotte first started dating after meeting on a sex site. They didn't expect the person they'd agreed to meet to be each other, but they agreed to give it a shot. Their relationship started out with just being \"Friends with Benefits,\" but Cooper wanted it to be more. Charlotte wasn't open to that until she realized that she was falling in love with Cooper. The two were on and off after Charlotte admitted to having sex with [[Archer Montgomery]]. Cooper forgave her, but then they got into another argument when Cooper found out Charlotte was the new owner of the competing clinic right below Oceanside Wellness. They eventually made up.\n\n\nAfter telling Cooper that she had become more of an administrative position at St. Ambrose and less of a doctor, she took a job interview. She had been recruited to run the [[Pacific Wellcare Center]] on the newly leased fourth floor of the building that also housed [[Oceanside Wellness Group]]. Charlotte kept this from Cooper, but was found out by Violet. Violet agreed to keep the secret so that Charlotte had the chance to come clean about it to Cooper. After giving her several chances, Charlotte did not tell Cooper and so Violet confronted Cooper. Cooper became very angry that Charlotte was running an opposing medical practice in his building and they broke up.\n\n\nAfter William White fired Charlotte from her position at Pacific Wellcare Center, she approached Sam for a position at Oceanside Wellness Group and explained why she was a good hire for the practice. Sam and Addison had a conversation about it, and eventually decided to hire her. She moved into Pete's old office and practiced as a [[Sexology|sexologist]].\n\n\nIn [[St. Ambrose Hospital]] as [[Chief of Staff]], she told a noisy patient to wait his turn. However, that man had mental problems. He thought that women had to respect him and because Charlotte was mean to him, he assaulted her later that day.\uaGetting ready to go home, Charlotte left her office in the hospital. When she turned around after having closed the door, the man knocked her head against the door and dragged her back into her office.<ref>[[All in the Family]], x (PP)</ref>\n\nShe tried to resist and scratched the assaulter, which only enraged him more. He continued punching her eventually raped her in her own office.\uaShortly after, she left her office, bruised and bleeding. She hobbled to the nearest supply closet to get some bandages, but Pete Wilder, who was working in the ER that night, noticed her. He followed her and caught her when she fell down. He carried her into a room in the hospital.\n\nCharlotte chose not to tell anyone that she was raped and even hurt badly, she continued bossing everyone at the hospital around. She only allowed nurse Sheila in her room, not any of the \"nosy bitchy ones\" and the doctors from the practice. However, Addison didn't buy the story that the assaulter took her wallet and she asked everyone to leave the room. When they were alone in the room, Charlotte came clean to Addison. She told her that she was raped. Addison did a pelvic exam and tried to pursue Charlotte to report the assault, but Charlotte refused. However, Addison secretly did a rape kit and kept it in the hospital under the name of Jane Doe, thinking Charlotte might want the assaulter's DNA later.<ref>[[Did You Hear What Happened to Charlotte King?]], x (PP)</ref>\n\nSome time later, Charlotte returned to work, but she still hadn't fully recovered yet. Upon entering her office, she started getting flashbacks of the assault and she went to the practice instead. Her colleagues there tried to act normal around her, but they all failed to do so. Sheldon was the only one who actually left her alone like she wanted them to. Pete came into her office to check on her wounds, reminding Charlotte of the rape and she almost started crying in front of him. Violet offered to help her too, but Charlotte refused, saying it was impossible for Violet to know what she was going through. She also completely shut out Addison, because Addison saw her at her most fragile point. Amelia offered her donuts and said she was going to meetings for addicts. She also talked to her about craving to pills after something terrible happened, but Charlotte denied she was craving for pills.\n\nAddison eventually told Sam that Charlotte was raped. On his turn, he asked Violet to talk to Charlotte without actually saying that she was raped. However, Violet suspected something and talked to Pete, who suspected the same. When talking with Violet in his office about the night Charlotte was assaulted, Sheldon said he was in the police office talking to a rapist. Seeing the way Violet reacted to the word \"rapist\", he asked her if Charlotte was raped. Violet said she also suspected that Charlotte was raped.\n\nCooper told Charlotte he simply couldn't leave her alone after what happened. This seemed to help her deal with it a little bit better, as she dared to enter her office again shortly after, without having flashbacks. Violet later came to Charlotte's office, and she started talking about the time she was raped herself, leaving Charlotte devastated. She went to Amelia's office and asked her to go to a meeting with her, admitting she was craving pills.\uaMeanwhile, Addison made calls to have the pelvic washings from Charlotte processed.<ref>[[What Happens Next]], x (PP)</ref>\n\n\nWhen Erica Warner showed up at the practice claiming that Cooper was the father of her son, Cooper was delighted and immediately believed her. Charlotte was more cautious. At first, she approached Erica and paid her money to leave Cooper alone. Erica took the money, but only to give it back to Cooper as that was not what she was after. She wanted to disappear from his life, but Cooper convinced her he had nothing to do with it. Charlotte later realized that she crossed a line, but she only did so to protect her family. She did a paternity test behind Cooper's back, which revealed that Mason was indeed his son.\n\nErica then allowed Cooper to come visit his son, but didn't allow Charlotte be near him, so Charlotte kept her distance. Over time, Erica came to realize that Charlotte had meant no harm and she noticed that Mason had grown to like Charlotte, and vice versa. She then allowed Mason to spend the night at Cooper and Charlotte's, and Mason and Erica progressively became part of their family.\n\n\n\nCharlotte was frustrated when she discovered she was pregnant. While she had happily accepted being Mason's mother, she was not interested in having more kids. She then became horrified upon finding out that she was expecting triplets. While abortion was not an option for her because of her faith, she did hope for a miscarriage in the early stages of the pregnancy. That didn't happen and the family began to prepare for the three new additions.\nAddison had to sew up Charlotte's cervix after she had one of the babies prematurely at only twenty-six weeks.\n\n\nGenerally, the character has served as somewhat of a foil to the other doctors at [[Oceanside Wellness Group]], often impeding their progress in helping patients through somewhat unorthodox methods by applying and enforcing legal, medical and ethical implications. However, while being treated for insomnia, Charlotte revealed that she has trouble connecting with others because signs of affection were discouraged in her family. She later became less obstructive and the relationship with [[Cooper Freedman|Cooper]] somewhat humanized her..\n\n\n\n[[Billy Douglas]]\nAt Oceanside Wellness, Charlotte told a patient that she married her first love and they had a fairy tale-like relationship. However, she caught him in their bed having sex with another woman. She couldn't forgive him for that, and they broke up.\n\nBefore Charlotte married Cooper, she talked with Billy about their marriage. It turned out Billy was gay and cheated on her because he wanted to know if he'd feel different with another woman, but he said he didn't.\n\n[[Cooper Freedman]]\nMuch later, she started up a relationship with Cooper Freedman after meeting through an internet dating service. They stayed together for a while, but after they broke up, she began to feel sick which made Cooper think that she was pregnant. After he convinces Charlotte that she might be pregnant, she takes a pregnancy test and while they are waiting for the results, they begin to think of names and when they see that the test came back negative, Charlotte tries to get back together with Cooper, but he refuses.\n\nFollowing the death of her father, Cooper goes with her and comforts her and they eventually get back together, but Charlotte dislikes Cooper living with Violet and they argue over that. Charlotte creates another roadblock in their relationship when she sleeps with [[Archer Montgomery]] and is caught by [[Addison Forbes Montgomery|Addison]], but Cooper sees this as a sign of her pushing him away, and he forgives her. Eventually, Charlotte begins to bond with Violet over Cooper and her pregnancy, but eventually they part ways when she reveals that she slept with [[Archer Montgomery]] and Violet tells her, professionally and personally, that it's not okay that she did that. Charlotte and Cooper stay together and eventually have a [[Something Old, Something New|Vegas wedding]].\n\nHer relationship with Cooper took kind of a blow when she found out that Cooper has a son and Charlotte tried to pay Mason's mother to leave them alone, but they eventually reconciled. Charlotte developed motherly feeling for Mason when it became clear that his mother would die.\n\nCharlotte became pregnant with triplets which both she and Cooper refer to as the 'Cooplets'. Charlotte went into premature labor and [[Life Support|delivered the first triplet]], whom they later named Georgia. Two months later, [[Full Release|she delivered the last two triplets]]. Because she named Georgia, Mason named the second baby Caroline, and Cooper chose Rachel for the third.\n\n[[Sheldon Wallace]]\nCharlotte and Sheldon started sleeping together after Charlotte and Cooper broke up. She stated to [[Amelia Shepherd|Amelia]] that the rumors about Sheldon's penis are true. She used sex with Sheldon to cover up the pain of her and Cooper's break up. Sheldon eventually realized this and broke it off with Charlotte, advising her to pursue Cooper since she was still in love with him. Sheldon and Charlotte remained friends and he gave her advice on how to be friends with Cooper and how to eventually get him back. Sheldon stopped the elevator with Addison in it to tell her that he loved Charlotte. He couldn't stop thinking about her and kept going to her office to borrow postage stamps even though he paid his bills online.<ref>[[In the Name of Love]], x (PP)</ref>\n\n[[Archer Montgomery]]\nCharlotte had a sexual affair with Archer in his office at [[Pacific Wellcare Center]]. Charlotte did this to hurt Cooper, because she was afraid of their growing relationship and wanted it to blow up in her face.\n\n\n[[Amelia Shepherd]]\n[[Naomi Bennett]]\n\n\nDr. King is a graduate of [[Johns Hopkins Medical School]] and is the [[Chief of Staff]] at [[St. Ambrose Hospital]] in [[Santa Monica]].\n\nShe also opened a rival practice, [[Pacific Wellcare Center|Pacific Wellcare]]\ualocated on the fourth floor of the same building as the Oceanside Wellness Group.<ref>[[Know When to Fold]], x (PP)</ref>\uaThe owner of the practice, [[William White]], fired Charlotte as director of Pacific Wellcare and hired Naomi to replace her. His reasoning was that good leaders have a heart, and not only capable of attracting and hiring quality doctors.<ref>[[Yours, Mine & Ours]], x (PP)</ref>\n\nFollowing the revelation that [[Cooper Freedman|Cooper]] is broke and that the remaining staff at the [[Oceanside Wellness Group]] are looking to buy Naomi's share of the business, Charlotte gives [[Addison Forbes Montgomery|Addison]] and [[Sam Bennett|Sam]] a check for Cooper's share, as well as a blank check for her to buy into the practice.<ref>[[Pushing the Limits]], x (PP)</ref> After much debate between Addison and Sam, including Charlotte confronting Sam, Sam and Addison decided to hire Charlotte as a new member of staff at Oceanside Wellness.<ref>[[Strange Bedfellows]], x (PP)</ref>\n\nCharlotte moved into Pete's old office after his move to the rival practice, offering sexology as her specialty. Charlotte had had that idea for a long period of time. She hired a web designer to build her a website that allows her to offer advice, as well as provide consultations by email and book appointments to see her.\n\n\n*There is an inconsistency in where Charlotte graduated from medical school. In Private Practice promotional material, it claims she is a Yale graduate, whereas Cooper claims she is a Johns Hopkins graduate. It's possible that she attended Yale for medical school and completed her residency at [[Johns Hopkins Hospital]].<ref>[[Homeward Bound]], x (PP)</ref>\n*Charlotte has neonatal rounds at [[St. Ambrose Hospital]], which she has asked [[Addison Forbes Montgomery|Addison]] to cover for her when she returned home to see her father.<ref>[[Homeward Bound]], x (PP)</ref> Since [[Chief of Staff]] is a bureaucratic and administrative role, it is assumed that these rounds are part of her duties as a [[Urology|urologist]] at St. Ambrose, indicating that Charlotte practices pediatric urology.\n*Charlotte is the only character of the original main characters of ''Private Practice'' to never appear in a ''[[Grey's Anatomy]]'' episode. She has, however, visited\ua[[Seattle Grace Mercy West Hospital]].<ref>[[You Break My Heart]], x (PP)</ref>\n*Charlotte was revealed to be a [[Surgery|surgeon]] in \"[[Strange Bedfellows]]\", specializing in [[Urology|urology]], electing sexology as a new specialty to practice at Oceanside Wellness.\n*[[Pete Wilder]]\uawas her work husband. He brought her coffee and waited for her so they could get lunch together.\n*Charlotte loves fried chicken.\n*Her least favorite meal of the day is breakfast.<ref>[[Life Support]], x (PP)</ref>\n*Charlotte has a slight fear of needles.\n*She likes to read, her favorite book being \"''[http://en.wikipedia.org/wiki/To_Kill_a_Mocking_Bird To Kill a Mocking Bird]''\". It was written by Harper Lee, who is from the same town as Charlotte, Monroeville.\n*\"[[In Which Sam Gets Taken for a Ride]]\"\uais the only ''[[Private Practice]]'' episode in which Charlotte doesn't appear.\n*[[Mason Warner|Mason]] calls her Mama.\n*She is in NA and allergic to local anesthetic.<ref>[[Did You Hear What Happened to Charlotte King?]], x (PP)</ref>\n*She loves to drink martinis, which is why she knows how to make extremely good martinis.\n*The password for her computer at St. Ambrose was \"Big Daddy\". Although unconfirmed, it's assumed that she changed it after Cooper used it break into her computer.\n*She sometimes refers to her children as \"Rugrats\".\n*She's allergic to cats.\n*She snores.<ref>[[In Which Charlotte Goes Down the Rabbit Hole]], x (PP)</ref>\n\n\n<gallery widths=\"\" position=\"center\" orientation=\"landscape\" bordersize=\"none\" spacing=\"small\" hideaddbutton=\"true\">\nPPCharlotteKing.png\nPPCharlotteKing.png\nPPxCharlotteKing.png\nPPxCharlotteKing.png\n</gallery>\n\n{{GalleryLink}}\n\n\nThese episodes are Charlotte-centric or are otherwise very informative about her life.\n*[[In Which Charlotte Goes Down the Rabbit Hole]]\n*[[Homeward Bound]]\n*[[Did You Hear What Happened to Charlotte King?]]\n*[[What Happens Next]]\n*[[Can't Find My Way Back Home]]\n*[[Blind Love]]\n*[[Something Old, Something New]]\n*[[...To Change the Things I Can]]\n*[[Aftershock]]\n*[[Georgia on My Mind]]\n*[[Full Release]]\n\n\n:'''[[Cooper Freedman|Cooper]]:''' Sure thing, Charlie.\n:'''Charlotte:''' You call me that again... You will be hobbling down that aisle! <ref>[[What We Have Here...]], x (PP)</ref>\n----\n: '''Charlotte:''' I don't like people. It's rare that someone comes along I can even tolerate.<ref>[[Two Steps Back]], x (PP)</ref>\n----\n:'''[[Pete Wilder|Pete]]:''' People need connection to stay healthy, positive connection with another human.\n:'''Charlotte:''' I don't--I don't need your pity positivity. I don't know what Violet told you, but I connect. Okay?\n:'''[[Pete Wilder|Pete]]:''' Yeah, when?\n:'''Charlotte:''' None of your business--\n:'''[[Pete Wilder|Pete]]:''' Business. Right. Maybe I'm not the guy to help you. Maybe you need someone--\n:'''Charlotte:''' Who I can't irritate? Find that man for me and I'll marry him. My family didn't believe in displays.\n:'''[[Pete Wilder|Pete]]:''' Of affection?\n:'''Charlotte:''' My mother, there was the occasional sloppy kind that followed cocktails.\n:'''[[Pete Wilder|Pete]]:''' And since then?\n:'''Charlotte:''' Who has time for that kind of thing?\n:'''[[Pete Wilder|Pete]]:''' I'm sorry, Charlotte. Do you want to try again?\n:'''Charlotte:''' Why not? My hair's already shot.<ref>[[In Which Charlotte Goes Down the Rabbit Hole]], x (PP)</ref>\n\n{{Charlotte King Appearances}}\n{{Scrollbox}}\n\n[[fr:Charlotte King]]\n[[de:Charlotte King]]\n\n{{DEFAULTSORT:King, Charlotte}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:PP S Characters]]\n[[Category:Doctors]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (MFM)]]\n[[Category:Patients (CAM)]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (Trauma)]]\n[[Category:Patients (Ortho)]]\n[[Category:Patients (General)]]\n[[Category:Patients (ID)]]"}]}}}}