{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50264": {"pageid": 50264, "ns": 0, "title": "Colette", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP304Colette.png\n|name = Colette\n|status = Alive\n|diagnosis = *Emotional trauma\n*Pregnancy\n|doctors = [[Violet Turner]]\n|treatment = Couples counseling\n|marital = [[Ty]] ''(husband)''\n|children = Expecting\n|only appearance = [[Pushing the Limits]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Tracie Thoms]]\n}}\n'''Colette''' is a woman who was raped and became pregnant.\n\n==History==\nColette had been raped and was having difficulty in her marriage because of it. She said her husband, Ty, couldn't even look at her. He said he didn't want to keep bringing it up, but Violet told him it happened and if he couldn't work through what had happened to her, they wouldn't be able to move forward together. After Ty left the room at the end of their session, Colette told Violet that she was pregnant. Because of the timing, she wasn't sure if her husband or her rapist was the father.\n\nIn Violet's office, Colette told Ty she was pregnant. He was excited, because they'd been trying, but then he was told the paternity test revealed he wasn't the father. He asked how soon they could abort. Colette said she knew it was awful, but they'd been trying for so long to have a baby and this could be their chance. Ty said he didn't want that and left.\n\nColette returned the next day and said that Ty hadn't come home. Violet explained that he didn't understand why she'd consider keeping the baby. She said she loved Ty, but she was having a baby. She told Violet she believed she was up for it, but Violet asked if she knew what it would be like to see that baby every day, to remember being raped every day. Colette left in horror.\n\nTy came into the practice to thank Violet, saying that Colette had scheduled an abortion for the next day. Violet asked if she was sure about it, but Ty said Colette wouldn't talk to him.\n\nViolet called Colette and Ty back in and apologized, saying she'd imposed too much of her personal situation into theirs. Ty then stopped and asked Colette what she wanted.\n\n==Relationships==\n===Romantic===\nShe is married to [[Ty]]. They met when they were summer camp counselors together.\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (Trauma)]]\n[[Category:Patients (OB/GYN)]]"}]}}}}