{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50453": {"pageid": 50453, "ns": 0, "title": "Colin Bowman", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP312ColinBowman.png\n|name = Colin Bowman\n|status = Alive\n|diagnosis = Neurotoxicity\n|doctors = *[[Gabriel Fife]]\n*[[Pete Wilder]]\n|treatment = *Electronic arm\n*Antibiotics\n*Antibiotic implants\n|marital = Fiancée\n|workplace = US Military\n|only appearance = [[Best Laid Plans]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Chris McKenna]]\n}}\n\n'''Colin Bowman''' is a patient who developed an infection around a bolt placed in his arm to control an electronic arm.\n\n==History==\nColin lost part of his arm in an accident. He worked with an electronic arm, which gave him previous unattainable range of motion and the ability to catch a tossed object out of the air. The arm was connected directly to his nervous system, so he merely had to think about moving the arm and it moved. While working with the arm, Colin suddenly felt extreme pain in his residual limb. Pete was shocked to see a bolt implanted directly into the end of Colin's arm. [[Gabriel Fife]] had sent him to Sweden to have the surgery, which is illegal in the US. He had a serious infection around the bolt and Pete took him to the hospital. It had been hurting for a month, but he hadn't said anything because he was worried he wouldn't be able to keep the arm. Pete said they needed to remove the bolt, but Gabriel and Colin asked him about other options. Pete said there were alternative options, but the FDA hadn't done safety studies on them, so he recommended just removing the bolt, because it was the source of the infection. Colin explained to Pete that he wanted to be able to dip his fiancée at their wedding and needed two arms to do that, but Pete was adamant because it could kill him.\n\nDespite Pete's recommendation, Gabriel looked into the drug protocols and decided to try one, despite the risks. Colin said he had tingling in his arm, like it was asleep and he couldn't wake it up. He had developed neurotoxicity, so Gabriel decided to lower the dose. Despite this, Colin continued to get worse as his infection spread. Pete came in and started a central line for antibiotics. Pete told Gabriel to remove the bolt, but he again refused because Colin didn't want it.\n\nGabriel told Colin the results weren't what they hoped, with the infection. He said they'd need to remove the bolt and the surround tissue. It might involve amputation the rest of his arm. However, Pete suggested that they could do antibiotic implants, which would give him the chance to keep the part of his arm he had left.\n\n==Relationships==\n===Romantic===\nHe became engaged before he deployed. They planned the whole wedding via letter while he was gone, including the dance, which involved him dipping her. He wanted to be able to do that at their wedding.\n\n==Career==\nHe is a member of the US military. He was deployed in Afghanistan and an injury caused him to lose part of his right arm.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP3x12-10.jpg\nPP3x12-13.jpg\nPP3x12-14.jpg\nPP3x12-26.jpg\n</gallery>\n\n{{DEFAULTSORT:Bowman, Colin}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Genetics)]]\n[[Category:Patients (Prosthesis)]]\n[[Category:Patients (CAM)]]"}]}}}}