{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50052": {"pageid": 50052, "ns": 0, "title": "Corinne Bennett", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PP5x17-16.jpg\n|name = Corinne Bennett\n|status = Alive\n|siblings = [[Sam Bennett]]\n|parents = *[[Dee Bennett]]\n*[[Raymond McCray]] ''(estranged)''\n|other family = *[[Naomi Bennett]] ''(sister-in-law)''\n*[[Maya Bennett]] ''(niece)''\n*[[Olivia Davis]] ''(grand-niece)''\n*Aunt\n|first appearance = [[The Time Has Come]]\n|last appearance = [[The Letting Go]]\n|count = 5\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Private Practice)|5]]\n|portrayed by = [[Anika Noni Rose]]\n}}\n\n'''Corinne Bennett''' is [[Sam Bennett|Sam Bennett's]] estranged sister.\n\n==History==\n===Arrest===\nShe had been missing for 20 years when Sam got a call to pick her up from the jail after she was arrested for taking the cash out of a convenience store register. ''(\"[[The Time Has Come]]\")''\n\n===Seeing Sheldon===\nSam brought Corinne back to his place. He gave her medicine, which she took willingly. He then took her to the practice and consulted with Sheldon, who said her previous doctors had been lazy. They hadn't properly diagnosed her. They'd just over-drugged her, which left her glassy-eyed and unable to function. Sheldon said they could take her off the meds and find a true diagnosis.\n\nOnce the fog lifted, Sheldon asked if she'd been officially diagnosed. She said she'd been diagnosed schizophrenic, manic-depressive, and had paranoid delusions. Every shrink had a different idea, but they all just drugged her.\n\nWhile she was in the bathroom, Sam talked about Corinne's history and her past behaviors. Sheldon decided to keep her on a mild sedative only, because they weren't sure what to expect from her. Sam later sat next to Corinne as she lay on a beach chair looking out at the ocean. ''(\"[[Too Much]]\")''\n\nAfter the medical fog had lifted, Corinne came in to see Sheldon again. She said she felt good. She'd gotten up at six and done several tasks before her session. She said she wasn't sure where to start talking about her past, so Sheldon suggested they focus on the present because they had limitations on what could be done. Despite this, Corinne believed she was ready.\n\nSam later confronted Sheldon about being pessimistic, but Sheldon said she seemed manic in their session. During a conversation that night, Sam found out Corinne had been back in LA for five years and hadn't contacted her family.\n\nIn her next session with Sheldon, Corinne was subdued and withdrawn. She said she fantasized about an earthquake hurting her and believed she was a waste of skin. He told her she had bipolar disorder and there were treatments they could use to lesson the swings, but Corinne believed it was hopeless. ''(\"[[You Break My Heart]]\")''\n\nCorinne continued to see Sheldon. She had a notebook in which she wrote down all her moods. She also told him Sam had suggested she try to get a part-time job or volunteer. She worried about letting him down if she couldn't keep the job. ''(\"[[Andromeda]]\")''\n\n===ER Trip===\nThat night, Addison found Corinne outside, manic and frantically writing down information about stars. Sam was able to get her back inside, but they had a rough night. The next day, she brought food for everyone in the practice and was still very manic. Sam was able to get her to leave with him, but that night, she was convinced she'd discovered a new galaxy and needed to write it all down. There was a struggle and Corinne went through Sam's porch door, cutting her face and arms.\n\nSam took her to the ER, where Pete removed the shards of glass and stitched her cuts. Sheldon told Sam that Corinne needed in-patient care, but he refused as he'd already lost 20 years with her. ''(\"[[Andromeda]]\")''\n\nWhen she woke up the next morning, Corinne was apologetic about what had happened, though Sam claimed it wasn't a big deal. Sheldon continued to press Sam to get her in-patient care. Corinne told Sam she wanted to go home, but he said she wasn't ready to go home yet. When she said being in the hospital felt like being a prisoner, he agreed to take her home.\n\nAt home, Corinne said she was having suicidal thoughts, but she said she didn't have the courage to commit suicide. Because of that, Sam tried to suicide-proof the house, including getting rid of all the knives in the house. Sam said that if she was going to stay there, there had to be rules, such as taking all her medicine, eating, and sleeping. When she refused to take her meds, they had a physical altercation during which he forced her to take her pills.\n\nSam then went to Sheldon to ask him for more information about in-patient care for Corinne. Sam then went to talk to Corinne about it. She tried to refuse, but Sam said she needed the care they could provide that he couldn't. As they did her intake, Corinne said she never should have called Sam before entering the ward. ''(\"[[The Letting Go]]\")''\n\n==Relationships==\n===Familial===\nShe and Sam were close as children, but they spent 20 years apart as adults that put distance between them. The week before Corinne left, Sam told his mom he didn't want a birthday party because he didn't want Corinne to ruin it like she ruined everything, so he blamed himself for her leaving. She assured him that she hadn't left because of him, but because she was sick. ''(\"[[You Break My Heart]]\")''\n\n==Notes and Trivia==\n*She once almost burned the house down making popcorn. She thought the fire looked cool, so she fanned the flames to make it bigger instead of trying to put it out.<ref>[[Too Much]], 5x14 (PP)</ref>\n*She and Sam used to go to a beach house in North Carolina during the summers.<ref>[[Too Much]], 5x14 (PP)</ref>\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPP5x13CorinneBennett.png|[[The Time Has Come]]\nPP5x14CorinneBennett.png|[[Too Much]]\nPP5x15CorinneBennett.png|[[You Break My Heart]]\nPP5x16CorinneBennett.png|[[Andromeda]]\nPP5x17CorinneBennett.png|[[The Letting Go]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP5x14-3.jpg\nPP5x14-6.jpg\nPP5x14-7.jpg\nPP5x17-15.jpg\nPP5x17-16.jpg\nPP5x17-20.jpg\nPP5x17-22.jpg\nPP5x17-23.jpg\nPP5x17-27.jpg\n</gallery>\n\n==Appearances==\n{{Corinne Bennett Appearances}}\n\n{{Scrollbox}}\n\n{{DEFAULTSORT:Bennett, Corinne}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (Trauma)]]"}]}}}}