{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50278": {"pageid": 50278, "ns": 0, "title": "Curtis Donovan", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP306CurtisDonovan.png\n|name = Curtis Donovan\n|status = Alive\n|doctors = *[[Naomi Bennett]]\n*[[Gabriel Fife]]\n|treatment = Selective IVF\n|marital = [[Sally Donovan]] ''(wife)''\n|job = Accountant\n|only appearance = [[Slip Slidin' Away]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Nic Novicki]]\n}}\n\n'''Curtis Donovan''' and his wife wanted to use selective IVF to ensure their baby was a dwarf.\n\n==History==\nCurtis and his wife, Sally, came to [[Pacific Wellcare Center]] because they wanted a baby. Specifically, they wanted a dwarf baby as they were both dwarfs and wanted their baby to be like them.\n\nNaomi, not wanting to mess with genetic engineering like that, told the Donovans she was happy to help them have a baby, but not selecting for dwarfism. They said that when people look at them, they see dwarfs first, but their other dwarf friends see the other things about them. If their baby were average height, that's all their friends would see about the baby.\n\nNaomi agreed, but when she learned that the embryos that had the markers for dwarfism also had the markers for VHL, which gave them a 40% chance of developing cancer by their 20s. Gabriel was convinced he'd be able to take care of the cancer in 20 years. He'd told the Donovans and they still wanted to go forward.\n\nNaomi refused to help and the Donovans believed it was because she believed they were freaks. They said she doesn't understand what it's like to be laughed at. She told them she was fat as a kid and she didn't meant to suggest that it was comparable, but everyone has scars to bear. Their kid, if he was healthy, would survive being the giant among their group of friends, just like they survived being dwarfs among average-sized people. She said she couldn't implant a sick embryo, not matter what Gabriel promised them. No matter what happened, their baby would be theirs and they'd love the baby.\n\n==Relationships==\n===Romantic===\nHe is married to [[Sally Donovan]].\n\n==Career==\nHe is an accountant.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP3x06-6.jpg\nPP3x06-15.jpg\nPP3x06-19.jpg\n</gallery>\n\n{{DEFAULTSORT:Donovan, Curtis}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]\n[[Category:Patients]]\n[[Category:Patients (REI)]]\n[[Category:Patients (Genetics)]]"}]}}}}