{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50518": {"pageid": 50518, "ns": 0, "title": "Cyndy Roberts", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP317Cyndy.png\n|name = Cyndy Roberts\n|status = Alive\n|marital = [[Joe Roberts]] ''(husband)''\n|children = [[Maggie Roberts]]\n|other family = Sister-in-law †\n|only appearance = [[Triangles]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Lauren Bowles]]\n}}\n'''Cyndy Roberts''' is the mother of [[Maggie Roberts]].\n\n==History==\nCyndy's daughter, Maggie, came into the practice with a cut on her forehead. Cooper cleaned it and said she wouldn't need stitches, just a few bandages. When he put the bandages on, Maggie said that Eli didn't believe her. Her parents explained that Eli was her imaginary friend. Maggie then went on to say the Eli believed it was his fault, because he wanted her to make new friends and so she introduced him to someone other girls, but they were rude.\n\nWorried about Maggie, Cooper consulted with Sheldon, thinking Maggie was using her imaginary friend to isolate herself.\n\nAfter seeing Maggie, Sheldon said he believed Maggie was schizophrenic. Her having an imaginary friend wasn't the problem. The problem is that she believes he's real. He wanted to prescribe anti-psychotics. Time was critical because she was pre-pubescent and starting the medicine early gave her a shot at a functional adulthood.\n\nThey met with her parents and talked about her situation. Her father, Joe, denied it, saying she was just a creative kid. He and his wife, Cyndy, then left.\n\nCyndy returned to the practice alone and said she had concerns about Maggie. She believed Sheldon was right and she didn't know what to do because her husband wasn't seeing it.\n\nThey called Maggie back in and her parents and Cooper watched through the glass while Maggie talked to Sheldon. He asked her about Eli and she admitted that sometimes Eli made her do things she didn't want to do, like drowning her cat.\n\nJoe was still adamant that he didn't want to send Maggie away and didn't believe the diagnosis was correct. Sheldon figured out that Joe had been through it before. He admitted that his sister had schizophrenia. They put her in residential care and medicated her and she ultimately killed herself. He felt guilty because Maggie got it from his side of the family. Sheldon assured him that treatment has evolved since his sister and they don't do things the same way anymore.\n\nThey made the decision to put Maggie in residential care.\n\n==Relationships==\n===Romantic===\nShe is married to [[Joe Roberts]].\n\n{{DEFAULTSORT:Roberts, Cyndy}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]"}]}}}}