{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50003": {"pageid": 50003, "ns": 0, "title": "Cynthia", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP212Cynthia.png\n|name = Cynthia\n|status = Alive\n|diagnosis = Transient ischemic attack\n|doctors = *[[Sam Bennett]]\n*[[Violet Turner]]\n|treatment = Evaluation\n|marital = Husband †\n|children = [[Seth]]\n|other family = Grandchildren\n|only appearance = [[Homeward Bound]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Patty McCormack]]\n}}\n'''Cynthia''' is a woman who'd had a stroke and was at a risk for another.\n\n==History==\nCynthia had had a stroke and was at the practice for an exam. Her son, Seth, pressured Sam to say that she needed to move to be close to Seth and his family in Florida. Sam said that it would be beneficial to be near someone else because she was at risk for another stroke. She insisted that she wasn't alone. Sam asked her to speak with Violet, which he said would make him feel more comfortable about letting her live on her own.\n\nIn her session, Cynthia said that she couldn't move, but she couldn't talk to her son about why she couldn't move. After being assured that Violet wouldn't tell Seth or Sam, Cynthia told Violet why she couldn't move. Violet then talked to Sam and Seth, saying that she was able to make good decisions about her own care and that she agreed to take additional steps to ensure her safety. While they were talking and Seth was trying to convince her to move, she had a transient ischemic attack, a warning sign for a stroke.\n\nIn the hospital [[Annette]] visited her and Cynthia confessed to her son that she was in love with Annette and they'd been in love for a long time, even when his father was still alive. Seth left and later, Annette told Sam to call Seth and get him back, to tell him she'd move because she said Cynthia needed her son and grandchildren more than she needed Annette.\n\nSeth returned, but only to get his laptop. He believed he should have figured out that his mother was gay. Knowing made him rethink every event from his childhood.\n\nSeth tried to leave, but he came back. He said he was still trying to understand it, but he saw that she'd kept him and his father happy their whole lives and it was her turn to be happy. He said he'd visit and she said they could visit him, too.\n\n==Relationships==\n===Romantic===\n====Husband====\nShe was married until her husband died. She said she loved him despite being gay.\n\n====[[Annette]]====\nShe met Annette while she was married. Their kids were the same age. Despite them both being married, they started a romantic relationship which lasted for many years, even after Cynthia's husband died.\n\n===Familial===\nCynthia loves her son deeply and was devastated when she believed he'd left forever.\n\n==Notes and Trivia==\n*She was 70 at the time of her stroke.\n*She knew she was gay when she was 15.\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (General)]]\n[[Category:Patients (Psych)]]\n[[Category:Patients (Neuro)]]"}]}}}}