{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"86702": {"pageid": 86702, "ns": 0, "title": "Cynthia (When I Get to the Border)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = 19x05Cynthia.png\n|name = Cynthia\n|status = Alive\n|title = M.D.\n|marital = Husband\n|job = [[Attending]] [[Obstetrics and Gynecology|OB/GYN]]\n|workplace = Eastern Washington Family Planning Clinic\n|only appearance = [[When I Get to the Border]]\n|seasons = '''[[Grey's Anatomy|GA]]:''' [[Season 19 (Grey's Anatomy)|19]]\n|portrayed by = [[Laura Niemi]]\n}}\n\n'''Cynthia''' is a doctor who operates a clinic in Washington close to the border to Idaho.\n\n==History==\nCynthia ran a clinic in Pullman, Washington, near the border with Idaho. After Roe v. Wade was overturned, Idaho effectively banned abortion, so many Idaho residents crossed the border to seek care at her clinic. With the help of volunteers, she modified her clinic to accommodate the additional need. Addison and Bailey came to her clinic to help out and she showed them how things operated. When she heard that [[Susan (When I Get to the Border)|Susan]] had an ectopic pregnancy and a doctor who refused to remove it and was across the border, she sent Addison and Bailey to pick her up and bring her back so they could treat her. Unfortunately, Susan hemorrhaged on the way back and died.\n\n==Relationships==\n===Romantic===\nShe is married. She moved to Pullman because her husband got a job teaching music at the university there.\n\n===Friendships===\nShe and [[Miranda Bailey]] were roommates when they were freshmen in college. Cynthia fit a couch and a mini-fridge into their small dorm.\n\n==Career==\nShe is an OB/GYN at Eastern Washington Family Planning Clinic, which has been open for 45 years.\n\n==Notes and Trivia==\n*She grew up in Chicago.\n*Her clinic sees over 2000 patients a year.\n\n{{DISPLAYTITLE:Cynthia}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S19 Characters]]\n[[Category:Doctors]]"}]}}}}