{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"83276": {"pageid": 83276, "ns": 0, "title": "Dan Barnes", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Firefighter Infobox\n|image = S195x01DanBarnes.png\n|name = Dan Barnes\n|status = Alive\n|job = Firefighter\n|workplace = [[SFD Station 23]] ''(former)''\n|first appearance = [[Phoenix from the Flame]]\n|last appearance = [[When the Party's Over]]\n|count = 10\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Shaun Heard]]\n}}\n\n'''Dan Barnes''' was a firefighter at station 23 until its closure.\n\n==History==\n===Storytelling===\nWhile the firefighters of station 23 enjoyed a meal together, Dan told the story of a woman he helped who asked him to hoist her up so she could change the battery herself, which he took as a come on. ''(\"[[Phoenix from the Flame]]\")''\n\n===Structure Fire===\nDan went along with the rest of station 23 when they were called to back up station 19 at a basement fire where several members of station 19 had passed out. As they rode back afterward, Dan commented on Sullivan knocking a phone out of a teenager's hand after he tried recording the firefighters after they were rescued. He went with the rest of the firefighters on the scene to the hospital to get checked out before going home. ''(\"[[Can't Feel My Face]]\")''\n\n===Conflict Resolution Training===\nIn order to expand Crisis One to the entire SFD, Dean arranged for Diane to train them all in conflict resolution and how to deal with a variety of scenarios they might see. For the first scenario, she asked Andy and Sullivan to play a married couple with a domestic dispute. She was unaware they were separated. She played the responder in the scenario. When Sullivan had to leave to respond to a call, Theo took his place and the scenario continued. Vic swapped in as the responder, but this ended with her and Theo flirting. Dean suggested he pick the pairings to avoid interpersonal relationships, which Diane agreed to. Next, he had Jack and Maddox play co-workers, the latter of whom had locked himself in the conference room. Dean played the responder. When Maddox got very hammy, Dean accused him of not taking it seriously, so Diane called for them to take a break. For another scenario, Aquino was having a crisis and Ben played the responder and was able to talk him through it. They continued their training and at the end of the day, Diane felt they were prepared to work with the program. ''(\"[[100% or Nothing]]\")''\n\n===Gas Main Explosion===\nBarnes accompanied the rest of station 23 when they were called as backup after a gas main explosion about half a mile from station 19.\n\nAfter [[Pat Aquino]] and [[Dean Miller]] were seriously injured, station 23 drove to the hospital. Deja asked if the shift was normal and Theo told her that it wasn't. They all cried together, despite Andy's insistence that Dean would live. ''(\"[[Things We Lost in the Fire (Station 19)|Things We Lost in the Fire]]\")''\n\n===Andy's Stint as Captain===\nAndy filled in as acting captain while Aquino was recovering. During this time, they fought a large apartment fire. When they returned from the fire, Andy called everyone's attention to her and said that the attitude around the station needed to change, that the hazing and the sexism and ignoring her orders needed to stop or there would be consequences. ''(\"[[A House Is Not a Home]]\")''\n\nMcCallister took early retirement after the gas main explosion, leading to the appointment of [[Natasha Ross]] as the new fire chief. She visited both station 23 and 19 to meet all the firefighters. After her visit to 23, they were called out to Leon's Ridge, where a car had gone over a cliff. Barnes helped at the top of the cliff, blocking traffic and getting supplies ready. ''(\"[[Started from the Bottom]]\")''\n\n===10K N Turnouts===\nDan, along with the rest of stations 19 and 23, participated in the 10K N Turnouts fundraiser. After it was over, all the members of 23 went home to enjoy their day off. ''(\"[[Searching for the Ghost]]\")''\n\n===Candy Factory Fire and Station Closure===\nOn their next shift, Ross visited the station and told them she was shutting the station down. She informed them they'd all receive reassignments or severances soon. The station was then called out to a fire at a candy factory, where Barnes and Theo were sent to do search and rescue. Inside the building, they found and evacuated [[Stella]], a pregnant employee.\n\nThe next morning, as the next shift arrived to relieve them, Andy gave a speech about them all being part of the history of 23. ''(\"[[Cold Blue Steel and Sweet Fire]]\")''\n\nThe firefighters gathered at the station one last time, taking pictures, before the flag was lowered and the lights were turned off for the last time. Then they went to Joe's for drinks, where Andy bought the first round for everyone. They then sat and shared stories of calls they'd been on together. When Deja overheard Andy telling Theo about her conversation with Ross, she told the others and they all became upset with Andy, blaming her for the station being closed, and left. ''(\"[[Alone in the Dark]]\")''\n\nAt another bar, they continued to drink and play pool. ''(\"[[When the Party's Over]]\")''\n\n==Career==\nHe is a firefighter at [[SFD Station 23]]. Station 23 was the only firehouse he'd ever worked at until its closure. ''(\"[[Alone in the Dark]]\")''\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nS195x01DanBarnes.png|[[Phoenix from the Flame]]\nS195x02DanBarnes.png|[[Can't Feel My Face]]\nS195x04DanBarnes.png|[[100% or Nothing]]\nS195x05DanBarnes.png|[[Things We Lost in the Fire (Station 19)|Things We Lost in the Fire]]\nS195x07DanBarnes.png|[[A House Is Not a Home]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS195x07-30.jpg\nS195x13-1.jpg\nS195x13-11.jpg\n</gallery>\n\n==Appearances==\n{{Dan Barnes Appearances}}\n\n{{DEFAULTSORT:Barnes, Dan}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:Firefighters]]"}]}}}}