{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52552": {"pageid": 52552, "ns": 0, "title": "Dana Nelson", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP6x09DanaNelson.png\n|name = Dana Nelson\n|status = Alive\n|doctors = [[Violet Turner]]\n|treatment = *Sedative\n*Talk therapy\n|marital = [[Ron Nelson]] ''(husband)''\n|children = [[Sarah Nelson]]\n|first appearance = [[You Don't Know What You've Got Till It's Gone]]\n|last appearance = [[I'm Fine]]\n|count = 4\n|seasons = '''[[Private Practice|PP]]:''' [[Season 6 (Private Practice)|6]]\n|portrayed by = [[Chryssie Whitehead]]\n}}\n\n'''Dana Nelson''' is the mother of [[Sarah Nelson]].\n\n==History==\n===Sarah's Injury and Disappearance===\nDana's daughter, Sarah, who broke her wrist jumping down the basement stairs, came into the ER with her husband, Ron, from whom she was separated. It was Ron's weekend with Sarah, so he was distracted unpacking her bag. Because Sarah had several recent ER visits, James wanted to call DCFS to investigate, but Cooper called in Violet instead to talk to Sarah.\n\nDana arrived just as Violet went to talk to Sarah and was angry at Ron for Sarah getting injured. She wanted to take Sarah home with her after her cast was on and told Ron she was going to sue him for full custody. Sarah said she wanted to be with Ron, too. They started arguing and James forced them both to leave.\n\nViolet talked to Sarah about her home life and her parents' arguing. She said that her parents' fighting made her want to run away.\n\nWhen Violet asked to talk to each of the parents separately, they started to bicker and Sarah came out of her bay to yell at them to stop. Dana went to sit with her while Ron went to talk to Violet.\n\nRon told Violet that he'd slept with his assistant and when he told Dana about it, she threw him out and refused any attempt at reconciliation. He also told Violet that Sarah was the best thing in his life and he'd never hurt her. Violet asked to sit down with both of them, but Dana started arguing. Violet said that them fighting was damaging Sarah and they needed to stop. Dana went to give Sarah the ice cream she'd gotten, but Sarah wasn't in her bed. Dana looked frantically around the ER for Sarah while Charlotte called a Code Pink.\n\nThey searched the hospital for Sarah while Ron and Dana waited. Violet gave Dana a sedative to calm her down, but Ron refused one, saying he wanted to stay clear. They found Sarah's raincoat on a bench outside the hospital and told her parents she wasn't anywhere in the hospital. She was officially missing. When morning came and Sarah was still gone, Violet came to the Nelsons and told them it was time to go home because there was nothing more they could do there. ''(\"[[You Don't Know What You've Got Till It's Gone]]\")''\n\n===Search for Sarah===\nPeople gathered outside the hospital, including Ron and Dana, every day after Sarah disappeared. Search parties were launched twice every day. The film crew for Sam's pilot filmed their plea for their daughter's return. They were determined to find Sarah and be reunited as a family. ''(\"[[The Next Episode]]\")''\n\n===Therapy===\nRon and Dana continued to search for Sarah. Six weeks after her disappearance, they were seeing Violet about their grief. Dana was using sedatives to cope with the feelings. Violet suggested they start weaning her off the drugs, but Ron said it was the only way she could get through the day. Ron later called Violet when Dana crawled into Sarah's bed and wouldn't move. Violet said she didn't know where Sarah was or what would happen, but they needed to move forward instead of staying still. ''(\"[[The World According to Jake]]\")''\n\nIn a later session, Dana was upset because Ron had returned to work to pay the bills. She felt he was trying to move on and pretend they never had a daughter, but he said that the time he was at work was time he got to escape what was happening to them. He told Dana that Sarah was dead. He couldn't pretend to hope anymore. Dana said she knew that Sarah was still alive. Ron said he needed to believe she was dead because if she was alive, he couldn't cope with the things that must have happened to her. ''(\"[[I'm Fine]]\")''\n\n===Finding Sarah===\nNinety-Five days after she went missing, Sarah was found in the basement of [[Nick Calhoun|Nick Calhoun's]] house. Sheldon carried her out of the house, where she was reunited with her parents. ''(\"[[I'm Fine]]\")''\n\n==Relationships==\n===Romantic===\nShe is married to [[Ron Nelson]]. They separated when Ron slept with his secretary and had a highly contentious relationship.\n\n===Familial===\nHer daughter, Sarah, disappeared from the ER at [[St. Ambrose Hospital]]. After 95 days, she was found. ''(\"[[I'm Fine]]\")''\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPP6x04DanaNelson.png|[[You Don't Know What You've Got Till It's Gone]]\nPP6x05DanaRonNelson.png|[[The Next Episode]]\nPP6x07DanaNelson.png|[[The World According to Jake]]\nPP6x09DanaNelson.png|[[I'm Fine]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton='true\">\nPP6x04-12.jpg\nPP6x04-13.jpg\nPP6x04-14.jpg\nPP6x04-19.jpg\nPP6x04-27.jpg\n</gallery>\n\n==Appearances==\n{{Dana Nelson Appearances}}\n\n{{DEFAULTSORT:Nelson, Dana}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S6 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Psych)]]"}]}}}}