{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"82854": {"pageid": 82854, "ns": 0, "title": "Dani Delgado", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S194x16DaniDelgado.png\n|name = Dani Delgado\n|status = Alive\n|children = *[[Zaza Delgado]]\n*Expecting\n|only appearance = [[Forever and Ever, Amen]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 4 (Station 19)|4]]\n|portrayed by = [[Cher Alvarez]]\n}}\n\n'''Dani Delgado''' is the mother of [[Zaza Delgado]].\n\n==History==\nDani was waiting outside while firefighters attempted to put out her neighbors' house. She told Maya she thought there were at least six people living in the house, a large family that had chosen to quarantine together. Later, Dani searched the area for her son, Zaza, whom she said loved fire trucks. She believed he was hanging around somewhere as she hadn't found him in his bed. Maya promised they'd keep an eye out for him. They eventually learned that Zaza was inside the Garcia house as he had helped their Abuelita get back to bed.\n\nSoon after, they found Zaza in a closet with burns over 30% of his body and brought him outside. With an aid car eight minutes away, Dani said she would transport him in her own car, but was told it wasn't safe as he needed treatment along the way. Maya then went against [[Fire Chief McCallister|Fire Chief McCallister's]] direct order to wait for the aid car and decided to transport Zaza in the fire engine.\n\n==Relationships==\n===Familial===\nShe has a nine year old son, Zaza, and is expecting another child.\n\n{{DEFAULTSORT:Delgado, Dani}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S4 Characters]]"}]}}}}