{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52341": {"pageid": 52341, "ns": 0, "title": "Dani", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP5x16Dani.png\n|name = Dani\n|status = Alive\n|marital = [[Laurel]] ''(wife)''\n|children = Expecting twins\n|grandparents = Sarah\n|only appearance = [[Andromeda]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Private Practice)|5]]\n|portrayed by = [[Ashley Jones]]\n}}\n'''Dani''' is the wife of [[Laurel]].\n\n==History==\nDani came into the practice with her wife, Laurel, who was pregnant with twins. During an ultrasound, Addison saw a severe diaphragmatic hernia on one of the babies. They asked about surgery after he was born, but she said if he were born with it, his quality of life would be severely diminished. They then asked about fetal surgery, but because Laurel was carrying twins, there was risk to the other fetus if she operated.\n\nAddison asked Violet to talk to them, to help them make the right decision for their family. They saw Violet, but Laurel said they'd made a decision. They weren't having the surgery. However, Dani said she didn't actually agree to that. She wanted to take the chance. Laurel said that it was her body, so it was her decision. Dani said it was her eggs. They started to fight about it. Dani said that if Laurel let one of their babies die without trying everything she could, she'd never forget it.\n\nLaurel came to Addison alone and said Dani had left her and wasn't answering her phone. She regretted saying that it was her body because she was only carrying because she won the coin toss. She asked Addison about the surgery. Addison said she was confident she could do it, but didn't want Laurel to have the surgery because Dani left her. Laurel said she couldn't live without Dani.\n\nDani showed up at the hospital when Laurel went into surgery. She wanted to see Laurel before the surgery, so Laurel would know she was there. She said when she gets scared, she gets mad, but Laurel just gets scared. Dani said Laurel needed to know she loved her. Addison said that was why she was having the surgery. Addison then agreed to let Dani go into the gallery to see Laurel and calm her down for a minute before her surgery.\n\nDuring the surgery, Addison found an amniotic band on the other fetus that didn't show up on the scans. Jake helped her remove the band while she placed the balloon into the other fetus's trachea.\n\nWhen Laurel woke up after surgery, Addison told them about the amniotic bands and they were relieved that they'd chosen to have surgery.\n\n==Relationships==\n===Romantic===\nShe is married to [[Laurel]].\n\n===Familial===\nShe and Laurel are expecting twins.\n\n==Notes and Trivia==\n*She and Laurel both have grandmothers named Sarah.\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]"}]}}}}