{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50267": {"pageid": 50267, "ns": 0, "title": "Danielle Palmer", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP304Danielle.png\n|name = Danielle Palmer\n|status = Alive\n|doctors = [[Addison Forbes Montgomery]]\n|children = Elliot Palmer\n|parents = [[Susanna Palmer]]\n|only appearance = [[Pushing the Limits]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Lucy Kate Hale]]\n}}\n\n'''Danielle''' is the mother of Elliot, a two year old with a mysterious illness.\n\n==History==\nDanielle was homeless and living on the street with her son, Elliot. At the homeless shelter's clinic day, Addison examined her and gave her birth control samples and hygiene products. Addison recommended that in order to get her and her son regular doctors visit, she could apply for Medi-Cal, but she said she didn't have the required documents. Addison asked if she had anyone else helping, because she was so young herself. She said her mom was out of the picture, had told her that if she wanted to keep her baby, she had to leave.\n\nElliot had had a runny nose for weeks. Danielle said she had given him cold medicine, but it hadn't helped. Addison said he had a fever and called Cooper over to look at him. Cooper found a large rash on his belly and said that they needed to go back to the practice for an EKG. The EKG revealed aneurysms in the blood vessels leading to his heart, indicating Kawasaki syndrome. Cooper said they could treat with immunoglobulin, but because Elliot and Danielle were homeless, Sam suggested a bypass procedure as a more permanent solution. To help, Addison suggested that they try to find Danielle's mom.\n\nElliot was admitted to the hospital for treatment. Danielle was worried about getting back to the shelter by eight, but Sam said she could stay in the room with Elliot. Addison located Danielle's mom and said she was on her way to the hospital. Susanna came and said that she'd looked for Danielle, but couldn't find her. She said that Danielle could come home, but Danielle said that her mother had driven her to an abortion clinic and when she wouldn't do it, told her she had to give the baby up for adoption. When Susanna wouldn't leave, Danielle said she would and took Elliot and left.\n\nCooper and Addison went out to look for them and found Danielle trying to stop Elliot from crying. Addison said that they needed to get him back to the hospital and called an ambulance.\n\nOne of his aneurysms had ruptured. Danielle was presented with options and told that bypass was the better option and Sam said he could do it. Danielle told him to do it.\n\nSusanna told Addison she'd spoken to an attorney and she'd be petitioning for custody after the surgery. Addison told her she was an ass. Danielle's a mother now, too, and she should be considerate of that. Susanna said she needed to think for Danielle and not about her.\n\nCooper later found Danielle stealing supplies from a hospital supply room. He told her that when she decided to have Elliot, she made the decision to do what was best for him. She told him about not being able to buy Elliot cheese puffs because she needed the money for the bus.\n\nWhen Elliot was out of surgery, Danielle and Susanna were told he'd be okay. Susanna went to leave, but Danielle invited her to go see Elliot.\n\n==Relationships==\n===Familial===\nShe was estranged from her mother for a few years after her son was born.\n\n==Notes and Trivia==\n*She was 15 at the time Elliot's hospitalization.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP3x04-4.JPG\nPP3x04-8.JPG\nPP3x04-10.JPG\nPP3x04-13.JPG\nPP3x04-15.JPG\nPP3x04-17.JPG\nPP3x04-19.JPG\nPP3x04-20.JPG\n</gallery>\n\n{{DEFAULTSORT:Palmer, Danielle}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Clinic)]]"}]}}}}