{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50952": {"pageid": 50952, "ns": 0, "title": "Daniel Woods", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x05DanielWoods.png\n|name = Daniel Woods\n|status = Alive\n|marital = [[Tracy Woods]] ''(wife)''\n|children = Kyla Woods\n|only appearance = [[In or Out]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[David Giuntoli]]\n}}\n\n'''Daniel Woods''' is the father of Kyla Woods, who was born with a large tumor on her lung.\n\n==History==\nDaniel's wife, Tracy, labored and gave birth at the practice while Daniel recorded the birth. However, once the baby, Kyla, was born, she wasn't crying due to a large tumor on her lung, which was putting pressure on her heart. The doctors planned surgery to remove it, but before that, they called in an oncologist, [[Eric Rodriguez]], who suggested chemotherapy to shrink the tumor instead of surgery to remove it. He and Addison disagreed over which treatment option was better.\n\nWhile they were discussing it, Tracy collapsed by Kyla's bedside. She had a postpartum hemorrhage, which Addison repaired in surgery. While she was unconscious, Eric talked to Daniel and convinced him to go with chemo instead of surgery.\n\nWhen Tracy woke up, she was shocked to learn that Daniel had cancelled the surgery and chosen chemo. Tracy was upset that he'd made the decision without her. Addison asked them to make a decision. Tracy was adamant that she wanted the surgery, so Daniel left the room.\n\nSam found Daniel outside the nursery and talked to him. He agreed to the surgery. In surgery, they found that the tumor was more entwined than the scans showed. A vessel burst because the tumor invaded it, but they were able to remove the whole tumor and Kyla was stable after surgery.\n\n==Relationships==\n===Romantic===\nHe is married to [[Tracy Woods]].\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP4x05-2.jpg\nPP4x05-14.jpg\n</gallery>\n\n{{DEFAULTSORT:Woods, Daniel}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]"}]}}}}