{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49907": {"pageid": 49907, "ns": 0, "title": "Daniel Larson", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP2x06-17.jpg\n|name = Daniel Larson\n|status = Alive\n|alias = Danny\n|marital = *[[Laura Larson]] ''(wife)''\n*[[Amy Larson]] ''(wife)''\n|children = *Daisy Larson ''(expecting)''\n*Two other children\n|only appearance = [[Serving Two Masters]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Alexis Denisof]]\n}}\n\n'''Daniel Larson''' is the husband of [[Amy Larson]] and [[Laura Larson]].\n\n==History==\nDaniel came into the practice with his wife, Laura, who was pregnant. An ultrasound showed signs of DiGeorge Syndrome, a serious condition. Panicked, Daniel brought in his other wife, Amy, who was also pregnant, worried that her regular OB might have missed something. Addison was shocked that Daniel had two wives and said that she would do the ultrasound, but for Amy, not for him.\n\nKnowing that she couldn't directly tell either woman about the other, Addison called them both into the practice and left them in a room together. They quickly figured out they were married to the same man and argued. Daniel was furious that Addison had told them and both women declared that they were leaving him.\n\nAmy later went into labor. She said she didn't want to give birth alone, but she also didn't want Daniel there. Laura held her hand while she gave birth. Daniel came in shortly after and wanted to mend fences, but they asked him to leave.\n\n==Relationships==\n===Romantic===\n====[[Laura Larson]]====\nHe is married to Laura Larson. He'd met her three years prior while already married to Amy. When he's away, he sends roses for her and daisies for their baby, Daisy.\n\n====[[Amy Larson]]====\nHe's been married to Amy for 12 years. He says he's been with Amy since he was 21.\n\n===Familial===\nHe has two children with Amy, a son and a newborn. He's also expecting a daughter with Laura, whom they had named Daisy.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP2x06-1.jpg\nPP2x06-3.jpg\nPP2x06-6.jpg\nPP2x06-8.jpg\nPP2x06-11.jpg\nPP2x06-12.jpg\nPP2x06-15.jpg\nPP2x06-17.jpg\nPP2x06-18.jpg\nPP2x06-23.jpg\nPP2x06-33.jpg\n</gallery>\n\n{{DEFAULTSORT:Larson, Daniel}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]"}]}}}}