{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49840": {"pageid": 49840, "ns": 0, "title": "Darcy", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP108Darcy.png\n|name = Darcy\n|status = Alive\n|diagnosis = Pregnancy\n|treatment = Vaginal delivery\n|children = Melanie\n|parents = Mother\n|only appearance = [[In Which Cooper Finds a Port in His Storm]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 1 (Private Practice)|1]]\n|portrayed by = [[Joy Lauren]]\n}}\n\n'''Darcy''' is a young girl who surrendered her baby after she was born.\n\n==History==\nDarcy gave birth in her house alone because she didn't want to tell her mother she was pregnant. She climbed on the top bunk and played her music really loudly to cover the noise. When the baby was born, she clipped the cord with a barrette. She called the Safe Surrender hotline and Pete and Addison came to pick up the baby. Darcy worried because the baby wasn't crying at all. Addison offered to do an exam, but Darcy declined, saying they just needed to take the baby and go. Addison gave Darcy her card and the matching bracelet and they left with the baby.\n\nDarcy later showed up at the practice with her mother, who was horrified that Darcy had given her baby away. They reunited her with the baby, whom she named Melanie, and they took her home.\n\n==Relationships==\n===Familial===\nDarcy's mother was unaware that she was pregnant and had given birth. When she found out, she and Darcy came to the practice to pick up the baby, saying she would never let Darcy give up her baby. Once they were reunited, Darcy named her baby Melanie.\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S1 Characters]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]"}]}}}}