{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52828": {"pageid": 52828, "ns": 0, "title": "Darlene Meyer", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Other Characters Infobox\n|image = PP6x12Meyers.png\n|name = Darlene Meyer\n|status = Alive\n|marital = [[Dan Meyer]] ''(husband)''\n|only appearance = [[Full Release]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 6 (Private Practice)|6]]\n|portrayed by = [[Jama Williamson]]\n}}\n'''Darlene Meyer''' is a woman who competed with Cooper for the house he wanted to buy for his family.\n\n==History==\nDarlene and her husband, Dan, put in the same offer as Cooper to buy a house owned by [[Mrs. Taylor]]. She asked to meet both of them in order to decide who would get the house. She wanted to sell the house to someone who would cherish the house like her family had. Dan and Darlene showed up early to their meeting, interrupting Cooper's. They brought a pie and talked about their charity work, including their work with the children's hospital's annual fundraiser, which Mrs. Taylor was familiar with. Despite this, Cooper ultimately was chosen to buy the house.\n\n==Relationships==\n===Romantic===\nShe is married to [[Dan Meyer]]. They met while working at women's shelter. Dan says he knew from the beginning that Darlene was the one.\n\n==Notes and Trivia==\n*She was premed when she met Dan while working at a Women's shelter and decided to go another way.\n\n{{DEFAULTSORT:Meyer, Darlene}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S6 Characters]]"}]}}}}