{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50249": {"pageid": 50249, "ns": 0, "title": "Darren Larsen", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP302DarrenLarsen.png\n|name = Darren Larsen\n|status = Alive\n|diagnosis = *Stab wounds\n*Seizure\n*Cerebral contusion\n|doctors = [[Sam Bennett]]\n|treatment = *Mannitol\n*Drug-induced coma\n*Steroids\n|marital = [[Michelle Larsen]] ''(wife)''\n|children = *[[Tammy Larsen]]\n*Expecting\n|only appearance = [[The Way We Were]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Ken Marino]]\n}}\n'''Darren Larsen''' is a man who came into the ER with a stab wound.\n\n==History==\nMichelle, Darren, and Tammy Larsen came into the ER after a violent incident at their home. Tammy's arm was broken when her father threw her across the room and Michelle was beaten. However, Darren's injuries were the most severe. Michelle had stabbed him nine times. Cooper splinted Tammy's arm and said they'd cast it later. He also asked her if she wanted to talk about it and she said she couldn't. He said that people wanted to help her and she could talk about it later. She was worried about her dad.\n\nSam examined Darren and ordered a head CT. Darren asked if he'd be okay and asked about Michelle and Tammy. Sam told him it was a little late to be worried about them.\n\nSince Michelle was pregnant, Addison did an ultrasound and said that the baby looked fine for ten weeks. She then asked Michelle if Darren hitting her and Tammy happened often. Michelle said it was an accident and asked to see Tammy. Addison asked again about the attack. Michelle said it wasn't like that. She said she was cooking. She and Darren started arguing and Tammy got in the way, so Darren pushed her. She got mad, overreacted, and stabbed him. As Addison took her to see Tammy, police officers showed up at the hospital to arrest Michelle. Addison said she needed medical care, so they told Addison to admit her to the jail ward and handcuffed her.\n\nMichelle and Darren had conceived with assistance from Naomi because they wanted a sibling for Tammy.\n\nDarren continued to insist to Sam that it was an accident. Darren had a seizure due to a brain contusion, which caused swelling in his brain. Sam put him in a drug-induced coma. They gave him mannitol to try to reduce the swelling in his brain.\n\nMichelle maintained that Darren wasn't abusive, even when Addison advised her that she could go to jail if Darren died.\n\nCooper talked to Tammy about her dad being in a coma. He asked her to talk about what happened because her mom wasn't talking. He wanted her to tell the truth about what happened. She admitted that she was supposed to say it was an accident, but it wasn't. She was cutting a cantaloupe. Her dad came in and was being silly, singing along with the radio, but she got mad. She just gets so mad sometimes. Her dad could see that was happening. He held her to try to calm her down, but she bit him. He called for her mom, but Tammy still had the knife in her hand and stabbed him. And she was upset because he was going to die.\n\nWhen Michelle was released from custody, she realized that meant that Tammy told the truth about what had happened. She believed it was her fault because she'd used drugs during her pregnancy with Tammy. Tammy had ADHD and then the rages started. Her school counselor said it was just adolescence, but Michelle was convinced it was her fault, because the test hadn't showed any other cause. She said Darren was the strong one and she needed him, but he was in a coma and she was worried Tammy would be taken away.\n\nWhen juvenile officers came to take Tammy, Cooper asked to keep Tammy in the hospital for longer. He went to Tammy's room and found her in a rage, attacking a nurse. He restrained her an ordered lorazepam to calm her down.\n\nThe next day, Cooper consulted with Addison. Everything Cooper ran was negative, but Addison ordered an abdominal MRI, which showed an ectopic pheochromocytoma on her ovary. It released the excess adrenaline, which caused the rages. Addison told Michelle and Tammy about it and assured Michelle that nothing she did caused it. It was a simple surgery to remove it and then she wouldn't have the rage anymore. Tammy said she still felt guilty about her father.\n\nDarren was still in his coma when Addison took Tammy into surgery. He wasn't a surgical candidate, but wasn't waking up.\n\nCooper talked to Tammy about her guilt, saying it wasn't her fault and he knew that people saying that wasn't making her feel better. She asked what would happen if he died and she didn't get to say she was sorry.\n\nDarren woke up and Tammy visited to tell him she was sorry.\n\n==Relationships==\n===Romantic===\nHe is married to [[Michelle Larsen]].\n\n===Familial===\nHis daughter, Tammy, had violent rages caused by a tumor on her ovary. One of them caused her to stab him in the abdomen. He and his wife are expecting their second child.\n\n{{DEFAULTSORT:Larsen, Darren}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Trauma)]]\n[[Category:Patients (Neuro)]]"}]}}}}