{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"83547": {"pageid": 83547, "ns": 0, "title": "Davey", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S195x03Davey.png\n|name = Davey\n|status = Alive\n|parents = Father\n|only appearance = [[Too Darn Hot]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Mark Mandia]]\n}}\n\n'''Davey''' is a football player who came to station 19 during the heat wave.\n\n==History==\nDavey was doing football drills with his father and [[Trent]] during a heat wave. Davey wanted to stop because he was hot, but his father told him he couldn't stop until he finished the drill. This resulted in him becoming dizzy and disoriented, so his father took him to station 19, which was serving as a medical center for anyone affected by the heat. Carina stepped in when she saw his condition and quickly diagnosed heat stroke when she noticed he wasn't sweating. She put ice packs on his neck and had them call an aid car. While they waited for it to arrive, she put him in an ice bath to reduce his temperature. When the aid car arrived, Davey was taken to the hospital. His father promised he'd never do anything like that again, but Carina said she'd still be informing Child Protective Services.\n\n==Relationships==\n===Familial===\nHis father is very strict and forced him to finish a drill despite the extreme heat.\n\n===Friendships===\nHe and [[Trent]] are friends and play football together.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS195x03-7.jpg\n</gallery>\n\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}