{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50799": {"pageid": 50799, "ns": 0, "title": "Dave Walker", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x01DaveWalker.png\n|name = Dave Walker\n|status = Alive\n|doctors = *[[Naomi Bennett]]\n*[[Sheldon Wallace]]\n|marital = [[Kendra Walker]] ''(wife)''\n|children = Max Walker †\n|only appearance = [[Take Two]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Shane Johnson]]\n}}\n'''Dave Walker''' is a man who wanted to have a baby with his wife after their first child died after being left in a car.\n\n==History==\nDave and his wife, Kendra, came in to see Naomi because they wanted to have a baby. Because Kendra had lupus, they planned to use a surrogate to carry their embryo. They'd used a surrogate before and told Naomi they'd lost their son, Max, when he was five months old.\n\nWhen Naomi talked to Addison about their case, Addison revealed that she'd been in the ER when their son came in. He'd suffocated because Dave left him in the car.\n\nNaomi asked the Walkers to sit down with Sheldon. He asked about why they didn't tell Naomi about Max and their grief process. Dave replayed the day. He'd taken the baby to day care, which was normally Kendra's job. He went to work like he normally did and forgot that his son was in the backseat. While he was sitting at work, his screen saver popped up, his son's face, and he remembered. He ran out to the car, but it was too late. Sheldon asked Kendra about her feelings. She said she didn't hate her husband, but she did feel numb. She needed to try to start over. Despite the situation, Sheldon cleared them to use a surrogate.\n\nBecause their surrogate had uterine scarring, they needed Addison to operate on her in order to allow her to carry a baby. Kendra came to Addison and said that she remembered Addison from the ER and said for a long time, she couldn't look at her husband and then she couldn't look at herself. She also said that her husband was the only person who understood how people look at you after you've lost a child the way they did. She promised that if Addison gave them their second chance, they'd never make the same mistake again.\n\nAfter that talk, Addison agreed to do the surgery so they could have their baby.\n\n==Relationships==\n===Romantic===\nHe is married to [[Kendra Walker]].\n\n===Familial===\nHis first child, Max, died after being left in a hot car.\n\n{{DEFAULTSORT:Walker, Dave}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Patients]]\n[[Category:Patients (REI)]]\n[[Category:Patients (Psych)]]"}]}}}}