{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51267": {"pageid": 51267, "ns": 0, "title": "David Gibbs", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP5x12DavidGibson.png\n|name = David Gibbs\n|status = Deceased\n|hidem = hide\n|marital = [[Joanna Gibbs]] ''(wife)''\n|other family = Mother-in-law †\n|first appearance = [[God Laughs]]\n|last appearance = [[Losing Battles]]\n|count = 2\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Private Practice)|5]]\n|portrayed by = [[Michael B. Silver]]\n}}\n'''David Gibbs''' was the husband of [[Joanna Gibbs]].\n\n==History==\n===Meeting Violet===\nWhile Violet was in the airport waiting for her flight to New York, she overheard Joanna and David Gibbs talking. When David left to get coffee, Joanna started crying, so Violet offered her a tissue. Joanna opened up to Violet, saying that her husband used to be supportive of her work as a lawyer, but had recently stopped supporting that. She'd made partner, but things hadn't slowed down. She said that it changed something in David. She'd come to LA to get away, but David followed and was apologetic about what he'd said and done. Violet asked what he'd done and Joanna confessed that David had hit her.\n\nShe said that his hours had been cut at work while hers were getting worse, so he was always home and stewing. She also said it was partially her fault. She cancelled a run with him last minute. She texted her assistant about missing the conference call she was supposed to be on and he hit her. She hadn't told anyone what happened, even her mother, whom she was visiting.\n\nWhen David returned, Violet sent Joanna to the bathroom, saying she'd meet her there. In the bathroom, they talked more about the abuse, but Joanna insisted that she was just making a reasonable sacrifice and Violet didn't know anything about her marriage.\n\nAs they prepared to board their flight, Violet implored Joanna not to get on the plane. She said that if she couldn't talk to her mother or friends, she could talk to Violet. She slipped Joanna her card as David tried to rush her onto the plane.\n\nViolet later got a call from Joanna, who hadn't gotten on the plane. ''(\"[[God Laughs]]\")''\n\n===Joanna's Pregnancy===\nJoanna came to the practice six months later, pregnant and badly beaten. Violet and Addison took her to the ER where they determined she was 12 weeks pregnant. David came in and Violet and Pete tried to stop him from seeing her, but he said that the day at the airport was his wake-up call. He'd done therapy and anger management and they were doing so much better. He insisted that he wasn't the one who had beaten her.\n\nAfter her exam, Addison told David Joanna was bleeding into her abdomen and she wasn't able to detect a fetal heartbeat. She'd lost the pregnancy because of the trauma. Addison also said there was a tear in Joanna's uterus and she might have to do a hysterectomy to stabilize her. David told her to do it. Addison said she might be able to do it without the hysterectomy, but it was riskier. David said just to do the hysterectomy, despite Violet's insistence that he shouldn't be making the decision.\n\nAfter surgery, Joanna was stable and Addison told David she was able to control the bleeding without doing the hysterectomy. David was angry and decided that he wanted her transferred to another hospital as soon as possible.\n\nJoanna woke up from her surgery and said that David didn't want a baby, but she thought it would be a new start for them. She thought David would be excited like she was, but he wasn't. She got up to get him more food, but he punched her. Joanna said she didn't want to talk to the police. She wanted David dead.\n\nDavid was shocked to find that Joanna had left the hospital without him.\n\nJoanna went home with Violet to her house, where Violet took care of her while she started to heal. Joanna said that Violet's book made her feel like a failure because she'd gone back to David. She didn't want to go to the police because she didn't want to be treated like a victim. She believed it was her fault because she'd gone back to David. Violet expressed concern about Joanna saying she wanted David dead, but Joanna said she wasn't serious.\n\nThe next day, David showed up at Violet's house, angry and insisting that Joanna come with him. David blamed Violet for Joanna leaving him and hit her, knocking her out. When she woke up, she found Joanna stabbing a deceased David repeatedly. Violet stopped her and Joanna said she had to do it and asked if Violet would tell the police that.\n\nThe police came to the house and Joanna was arrested. Violet told [[Detective Rollins]], who came to investigate the death, that it was self-defense, despite not witnessing it personally. ''(\"[[Losing Battles]]\")''\n\n==Relationships==\n===Romantic===\nHe was married to [[Joanna Gibbs]] until his death.\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPP5x01DavidGibbs.png|[[God Laughs]]\nPP5x12DavidGibson.png|[[Losing Battles]]\n</gallery>\n\n==Appearances==\n{{David Gibbs Appearances}}\n\n{{DEFAULTSORT:Gibbs, David}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]\n[[Category:Deceased Characters]]"}]}}}}