{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49729": {"pageid": 49729, "ns": 0, "title": "David Walker", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP102DaveWalker.png\n|name = David Walker\n|status = Alive\n|alias = Dave\n|diagnosis = *Alcoholism\n*Coprine poisoning\n|doctors = *[[Sam Bennett]]\n*[[Charlotte King]]\n|marital = Wife ''(separated)''\n|children = [[Stevie Walker]]\n|parents = [[Gloria Walker]]\n|only appearance = [[In Which Sam Receives an Unexpected Visitor]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 1 (Private Practice)|1]]\n|portrayed by = [[Sean O'Bryan]]\n}}\n\n'''David Walker''' is a man who became mysteriously ill.\n\n==History==\nDavid had a headache and nausea and called Sam at the practice to get a house call. Sam arrived and found Dave on the kitchen floor. Dave's mother, Gloria, seemed dazed and wouldn't let Sam in, so he broke a window. By that point, Dave's son, Stevie, was with his father, who was unresponsive. Sam called an ambulance and had the paramedics take Stevie and Gloria along with Dave to the hospital, worried about leaving Gloria in charge of Stevie. In the ER, Dave was quickly discharged at his own request. Sam came to the house and requested that they not eat anything from the kitchen until it had been completely cleaned, concerned about poisoning. Later, Stevie came to the practice with the same symptoms of his father. Suspicious, Sam ran tests and found coprine in Stevie's blood, a natural antabuse from ink cap mushrooms. He deduced that Gloria had been feeding them to Dave to get him to stop drinking, because drinking made him violently ill after consuming the mushrooms. Sam spoke to Gloria privately, trying to convince her to stop, but she was unwilling to do so because she knew she didn't have much time left to live and didn't want her son to keep drinking, as she knew he would end up dead. Sam called Stevie and Dave into his office and lied to them, saying that Dave was allergic to alcohol and that it could be genetic, so Stevie also shouldn't drink to be safe.\n\n==Relationships==\n===Romantic===\nHe is married, but his wife left him shortly before his mysterious symptoms.\n\n===Familial===\nDave lives with his mother, Gloria, and his son, Stevie. When his mother felt his drinking had gotten out of control, she fed him ink cap mushrooms in order to make him sick whenever he drank, saying that that's how he would learn not to drink.\n\n{{DEFAULTSORT:Walker, David}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S1 Characters]]\n[[Category:Patients]]\n[[Category:Patients (General)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Trauma)]]"}]}}}}