{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"86062": {"pageid": 86062, "ns": 0, "title": "Davis Martinez", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = 19x01DavisMartinez.png\n|name = Davis Martinez\n|status = Alive\n|marital = [[Sarah Martinez]] ''(wife)''\n|children = *[[Cara Martinez]]\n*[[Jonathan Martinez]]\n|only appearance = [[Everything Has Changed]]\n|seasons = '''[[Grey's Anatomy|GA]]:''' [[Season 19 (Grey's Anatomy)|19]]\n|portrayed by = [[Steve Forbess]]\n}}\n\n'''Davis Martinez''' is the husband of [[Sarah Martinez]].\n\n==History==\nDavis's wife, Sarah, was in the hospital waiting for at triple organ transplant. After a tour bus was thrown off a cliff during a tornado, Sarah and her family were told they had a donor for her, for all three organs. Before Sarah was taken into surgery, she said that if she died instead of being buried or cremated, she wanted her family to turn her into a tree, so she could fight climate change and helped the world instead of contributing to pollution.\n\nSarah's transplant went forward and was successful. When she woke up after the surgery, she asked to see her family, but was told she'd need to wait a few days to heal more before that would be possible. She also asked to thank her donor's family.\n\n==Relationships==\n===Romantic===\nHe is married to [[Sarah Martinez]].\n\n===Familial===\nHe and his wife have two children: Cara and Jonathan. They are also about to become grandparents.\n\n{{DEFAULTSORT:Martinez, Davis}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S19 Characters]]"}]}}}}