{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"64838": {"pageid": 64838, "ns": 0, "title": "Dayna Rutledge", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = 14x08DaynaRutledge.png\n|name = Dayna Rutledge\n|status = Alive\n|diagnosis = Bruised ribs\n|doctors = *[[Arizona Robbins]]\n*[[Owen Hunt]]\n*[[Scott Hanson]]\n*[[Levi Schmitt]]\n|treatment = Chemotherapy\n|marital = [[Peggy Knox]] ''(wife)''\n|children = [[Rose (Searching for the Ghost)|Rose]]\n|first appearance = *'''[[Grey's Anatomy|GA]]:''' [[Out of Nowhere]]\n*'''[[Station 19|S19]]:''' [[Searching for the Ghost]]\n|last appearance = *'''[[Grey's Anatomy|GA]]:''' [[Judgment Day]]\n*'''[[Station 19|S19]]:''' [[Pick Up The Pieces]]\n|count = 5\n|seasons = *'''[[Grey's Anatomy|GA]]:''' [[Season 14 (Grey's Anatomy)|14]]\n*'''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]] and [[Season 6 (Station 19)|6]]\n|portrayed by = [[Nina Millin]]\n}}\n'''Dayna Rutledge''' is the wife of [[Peggy Knox]].\n\n==History==\n===Baby's Birth===\nDayna and her wife, Peggy, had planned to have a home water birth, but Peggy panicked during labor and came to the hospital. Despite the hack, she was in such advanced labor that the hospital had to take her in. She wanted painkillers, but because of the hack, they didn't have access to any of that, so Carina suggested that Dayna initiate orgasm to relieve some of her pain. After that suggestion, Peggy refused to listen to her and when the power went out for a minute, Peggy decided to try to leave. However, Arizona examined her and determined the baby was already crowning, so Arizona coached her through pushing and her baby was born. ''(\"[[Out of Nowhere]]\")''\n\n===Cancer Diagnosis and Car Accident===\nDayna had an inconclusive mammogram and was referred to [[Scott Hanson]] for a second opinion. He diagnosed her with stage II breast cancer and started her on chemotherapy. He also promised her she'd get through it. After her second round, she projectile vomited in the car, causing her wife to serve and hit a tree. She was taken to the ER, where they did a CT scan that didn't show any evidence of cancer, raising suspicion. After scheduling a fake appointment where she, too, was diagnosed with cancer, Arizona, along with Owen, decided they needed to stop Hanson. While Owen confronted him and called the police, Arizona showed Dayna and Peggy Dayna's real scans and told her she didn't actually have cancer, which they both celebrated. ''(\"[[Hold Back the River]]\")''\n\n===Weed Cookies===\nTo express their gratitude, Peggy and Dayna gave Arizona some cookies. They later paged her because they realized they had used peanut butter with marijuana left over from Dayna's chemotherapy. ''(\"[[Judgment Day]]\")''\n\n===Getting Injured While Walking===\nPeggy, Dayna, and Rose were out for a walk when Rose started fussing because she didn't want to be in the stroller, so Peggy took her out, but she refused to walk, so Dayna had to carry her. While they were walking, Dayna tripped when Peggy tried to blow Rose's nose, but couldn't break her fall because she was holding Rose, so Peggy reached out to cradle Rose's head so it wouldn't hit the ground, leading to Dayna injuring her face and Peggy her hand. They walked to station 19, where Carina recognized them, as she'd delivered their daughter. Thanks to the supplies that had arrived for the clinic, Carina and Ben were able to treat them at the station. Because of the location of their injuries, Ben suspected that Peggy had hit Dayna, but this was quickly put to rest when they independently gave the same story of what had happened. After they were treated, they had to fill out of a lot of paperwork, but they were grateful to avoid the ER. Before they left, Carina shared that she and Maya were looking at their options and asked if they'd used anonymous donor. They shared that they had and said there were pros and cons of using an anonymous versus a known donor. ''(\"[[Searching for the Ghost]]\")''\n\n===Helping at the Clinic===\nPeggy and Dayna volunteered to help at the Dean Miller Memorial Clinic. They sat at the registration desk to check patients in. They recognized Jack as a former employee of the station, but decided not to pry about that. They gave him his paperwork. Next, they checked in [[Brooke]], who said it stung when she peed. Peggy said she had been there and slipped a pamphlet about STIs on top of Brooke's paperwork. They later led Brooke to a room and share their experience getting chlamydia in college until Carina interrupted them and politely sent them to sort inventory instead. When Brooke got her results, they eavesdropped and celebrated when her tests were negative. ''(\"[[Pick Up The Pieces]]\")''\n\n==Relationships==\n===Romantic===\nShe is married to [[Peggy Knox]]. They've been married for seven years. ''(\"[[Searching for the Ghost]]\")''\n\n===Familial===\nShe and Peggy have a daughter named Rose.\n\n===Friendships===\n====Lucille====\nShe has a friend named Lucille whose \"cancer\" was \"cured\" by [[Scott Hanson]].\n\n====Carina DeLuca====\nShe and her wife are friends with [[Carina DeLuca]]. ''(\"[[Pick Up The Pieces]]\")''\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\n14x08DaynaRutledge.png|[[Out of Nowhere]]\n14x18DaynaRutledge.png|[[Hold Back the River]]\n14x20DaynaRutledge.png|[[Judgment Day]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS196x05-32.jpg\nS196x05-33.jpg\nS196x05-34.jpg\n</gallery>\n\n==Appearances==\n{{Dayna Rutledge Appearances}}\n\n[[de:Dayna Rutledge]]\n{{DEFAULTSORT:Rutledge, Dayna}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S14 Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 S6 Characters]]\n[[Category:S19 Rescuees]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Oncology)]]\n[[Category:Patients (Trauma)]]"}]}}}}