{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49861": {"pageid": 49861, "ns": 0, "title": "Dean Miller (Private Practice)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP201DeanMiller.png\n|name = Dean Miller\n|status = Alive\n|diagnosis = Human immunodeficiency virus\n|doctors = [[Cooper Freedman]]\n|treatment = Anti-retrovirals\n|parents = *[[Robin Miller]]\n*[[Mark Miller]]\n|only appearance = [[A Family Thing]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Tyler Patrick Jones]]\n}}\n\n'''Dean Miller''' is a patient of Cooper's whose parents refused to tell him he was HIV positive.\n\n==History==\nDean came into the practice to see Cooper. While Cooper was examining him, he told Cooper that he had a girlfriend and he was going to have sex with her. Cooper pushed condoms on him because he knew that Dean was HIV positive. Dean was unaware of his condition because his parents refused to tell him. When he was diagnosed, they thought he wouldn't live long enough to understand, so they told him he had a kidney condition and most of his symptoms were side effects of the HIV cocktail.\n\nUnable to tell Dean's parents about his intent to have sex and unable to tell Dean about his HIV status, Cooper called Dean's parents into his office and told them he believed it was time to tell Dean. They refused and warned him not to overstep his boundaries.\n\nDesperate to prevent Dean from passing HIV to another kid, Cooper called the whole family into his office and told Dean's parents that he was planning to have sex with his girlfriend. They asked him to leave the office so they could talk to Dean. They told him about his HIV status, but he angrily told Cooper that it was too late and they'd already had sex. His father also attacked Cooper and knocked him down.\n\nThe next day, Dean came into the practice with his parents, his girlfriend, and her parents. He said they had a lot of questions. Cooper invited them back to his office to answer them.\n\n==Relationships==\n===Romantic===\nHe has a girlfriend named Amy. The two had sex before Dean learned of his HIV status.\n\n===Familial===\nDean's parents decided not to tell Dean that he had HIV, believing that it would end his childhood.\n\n==Notes and Trivia==\n*He was 14 at the time of him learning he had HIV.\n*He'd been seeing Cooper since he was five.\n\n{{DISPLAYTITLE:Dean Miller}}\n{{DEFAULTSORT:Miller, Dean}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Peds)]]\n[[Category:Patients (ID)]]"}]}}}}