{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"67820": {"pageid": 67820, "ns": 0, "title": "Deborah", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S191x04Deborah.png\n|name = Deborah\n|status = Alive\n|alias = Deb\n|siblings = [[Sue]]\n|marital = Ex-spouse\n|workplace = The Sunken Meadow Inn Bed & Breakfast\n|only appearance = [[Reignited]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 1 (Station 19)|1]]\n|portrayed by = [[Megan Gallagher]]\n}}\n\n'''Deborah''' is one of a pair of sisters whose B&B caught fire.\n\n==History==\nDeborah and her sister, Sue, put all their money into opening a B&B. The night before it opened, Deborah was preparing for the opening while Sue sat and drank wine, upsetting Deborah. While Deborah was baking welcome cookies, the oven caught on fire. It spread to her oven mitt, which she threw. They called the fire department and the fire, which was contained to the stove top, was quickly extinguished.\n\nThey were later called back to the B&B with a much larger fire raging. The kitchen was engulfed in flames. Sue had looked for Deborah, but couldn't find her. They went inside and put out the fire, but realized quickly that there was still a reignition point. They had to turn off the gas to the oven to stop the fire from reigniting again. Andy then found Deborah, who had a leg wound and was trapped. She walked past bursting wine bottles to get to her and then helped her back out of the house. While they were escaping, she inhaled some glass, compromising her airway. Outside, intubation was unsuccessful, so Maya criked her and then started CPR. They then took her to the hospital.\n\n==Relationships==\n===Romantic===\nShe is divorced. She went to Sue with the B&B idea after the divorce was finalized.\n\n===Familial===\nShe and her sister decided to open a B&B together.\n\n==Career==\nShe and her sister are in the process of opening a B&B.\n\n==Notes and Trivia==\n*The B&B is located at 479 Sunken Meadow Road.\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S1 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}