{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52495": {"pageid": 52495, "ns": 0, "title": "Debra Diamanti", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP6x01DebraDiamanti.png\n|name = Debra Diamanti\n|status = Alive\n|alias = Deb\n|diagnosis = Pregnancy\n|doctors = *[[Addison Forbes Montgomery]]\n*Dr. Myers\n*[[Jake Reilly]]\n|treatment = Vaginal delivery\n|children = Max Diamanti\n|parents = *Mother †\n*[[Ed Diamanti]]\n|only appearance = [[Aftershock]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 6 (Private Practice)|6]]\n|portrayed by = [[Jillian Bach]]\n}}\n\n'''Debra Diamanti''' is the daughter of [[Ed Diamanti]].\n\n==History==\nDebra's father, Ed, was a recovering alcoholic who was seeing Violet. He invited Debra to one of his sessions to try to make amends with her. She showed up at the session visibly pregnant, to his surprise. Ed told her he'd been sober for six months and needed to talk to her. She talked bout their history and about how he just left. He said that she'd told him to leave which is why he went. He thought it would be better for her if he left, but she said that after he left, her mother was broken. She told him she wasn't sorry just as her water broke in the office.\n\nAddison examined her at the practice and then had her moved to the hospital, where she said Debra's regular OB would meet her. Ed worried about going to the hospital to be with Debra, saying she didn't want him around. Violet encouraged him to go anyway.\n\nAt the hospital, Jake took over Debra's care because her OB was held up at another hospital. She labored alone because when Ed came to the hospital, he had a cardiac episode and had to be rushed in for a catheterization to open his closed artery. During his procedure, he talked about all the events that had lined up to save his life.\n\nAfter her baby was born, Amelia talked to Debra and brought her and the baby to see Ed, who apologized to her. She introduced him to his grandson, Max.\n\n==Relationships==\n===Familial===\nShe hadn't seen her father for 23 years when he asked her to come to one of his sessions. She'd told him to leave when she was 17 and he did. It destroyed her mother, who never recovered from it. When her father got back into touch with her while she was pregnant, they started to work on repairing their relationship.\n\n===Friendships===\nHer best friend was supposed to be with her during her labor, but took a trip to Cabo and missed the birth.\n\n==Notes and Trivia==\n*She got a job at 17 to help support herself and her mother after her dad left.\n*She hates needles because of her father's frequent hospitalizations.\n\n{{DEFAULTSORT:Diamanti, Debra}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S6 Characters]]\n[[Category:Patients]]\n[[Category:Patients (OB/GYN)]]"}]}}}}