{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52563": {"pageid": 52563, "ns": 0, "title": "Dee Bennett", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PP6x05-3.jpg\n|name = Dee Bennett\n|status = Alive\n|children = *[[Sam Bennett]]\n*[[Corinne Bennett]]\n|grandchildren = [[Maya Bennett]]\n|other family = *[[Naomi Bennett]] ''(daughter-in-law)''\n*[[Olivia Davis]] ''(great-granddaughter)''\n|workplace = Print shop\n|only appearance = [[The Next Episode]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 6 (Private Practice)|6]]\n|portrayed by = [[Alfre Woodard]]\n}}\n\n'''Dee Bennett''' is the mother of [[Sam Bennett]].\n\n==History==\nWhile Sam had cameras following him to film a reality pilot about his life, Dee came to visit him. She brought with her [[Raymond McCray|Raymond]] and [[Jillian McCray]], her boss and his wife. Raymond needed cardiac studies after being in the ER a few weeks prior with chest pain. His symptoms had been getting worse since then. His EKG showed non-specific abnormalities, so Sam moved him to St. Ambrose for a chest CT and an echo.\n\nRaymond's tests showed pulmonary hypertension. Sam started him on anti-coagulants and placed an umbrella, which he hoped would solve the problem. When Jillian and Sam left Raymond's hospital room, the camera crew caught Dee and Raymond kissing in his room. Sam walked back in time to see it as well.\n\nWhile they ate dinner that night, Dee mentioned visiting Corinne, who was doing well. Sam snapped at her for putting a lot of salt on her food and then confronted her about her relationship with Raymond. Dee defended herself, saying things happen and it was for her to deal with.\n\nDee, Raymond, and Jillian all attended a barbecue at Sam's house a few days later. Raymond pulled Sam aside and said it wasn't a fling and he really loved Dee. Sam told him to get away from him. Raymond collapsed at the party and had to be rushed to the ER. They stabilized him and moved him to the OR to remove the clots.\n\nDuring the surgery, he started to bleed into his chest. He survived the surgery, but was told he needed a lung transplant. Sam suggested they start testing family members, but Raymond and Jillian said they didn't have any children or nieces and nephews. Dee wanted to pray, but Jillian instead suggested that Sam get tested revealing that Raymond is his biological father. Jillian told Raymond she'd known all along, but hadn't said anything.\n\nDee talked to Sam about how their relationship played out. Sam decided to get tested to see if he was a match for Raymond. The test revealed that he was a match and he told Raymond he'd donate if Raymond wanted it. Raymond told Sam about how he'd watched Sam grow up and how he'd thought a lot about what would be different if they were a family. But he made the choice to stay with Jillian. He told Sam he wouldn't let Sam take a part of himself to save him. He was ready to go. Jillian took Raymond back home to die.\n\n==Relationships==\n===Romantic===\nDee had an affair for over 40 years with her married boss, [[Raymond McCray]]. The relationship produced two children, Sam and Corinne. After Sam was born, Dee told Raymond that if he wanted to be in Sam's life, they needed to be a family. He decided to stay with his wife, so she tried to move on, but she couldn't stay away from him.\n\n===Familial===\nDee raised her two children by herself because their father was married to another woman. According to her son, despite doing it alone, she spent more time with him than other kids whose moms stayed home. When they were young, Dee told her children that their father had walked out on them, but as an adult, Sam learned that Raymond, his mom's boss, was his biological father.\n\n==Career==\nShe works at the print shop that Raymond owns.\n\n==Notes and Trivia== \n*[[Bizzy Forbes]] once got drunk and asked Dee if ''Amistad'' was an accurate portrayal of slavery. Dee sarcastically told Bizzy that she would “ask her slave friends”. <ref>[[The Next Episode]], 6x05 (PP) </ref>\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP6x05-3.jpg\nPP6x05-6.jpg\nPP6x05-9.jpg\nPP6x05-11.jpg\nPP6x05-12.jpg\nPP6x05-13.jpg\nPP6x05-14.jpg\nPP6x05-15.jpg\nPP6x05-16.jpg\nPP6x05-17.jpg\nPP6x05-18.jpg\n</gallery>\n\n{{DEFAULTSORT:Bennett, Dee}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S6 Characters]]"}]}}}}