{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"83786": {"pageid": 83786, "ns": 0, "title": "Deja Duval", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Firefighter Infobox\n|image = S195x13-9.jpg\n|name = Deja Duval\n|status = Alive\n|job = Firefighter\n|workplace = [[SFD Station 23]] ''(former)''\n|first appearance = [[Things We Lost in the Fire (Station 19)|Things We Lost in the Fire]]\n|last appearance = [[Alone in the Dark]]\n|count = 8\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Natasha Ward]]\n}}\n\n'''Deja Duval''' was a firefighter at station 23 until its closure.\n\n==History==\n===First Day===\nWhen Diane Lewis brought it to the department's attention that Andy was the only female firefighter at station 23, they sent Deja, a recent fire academy graduate, to work there. [[Pat Aquino]] assigned Andy to show her the ropes. Andy showed her her locker and gave her some tips about the station. Andy was dismayed when Deja laughed at Maddox's sexist jokes and told her she didn't have to do that. Deja said that she wasn't a legacy like Andy and if she had to laugh at some sexist jokes to fit in, she could do that.\n\nThey were later called out to back up station 19 at a gas main explosion. Andy coached Deja on the way, reminding her to listen to command and remember what she'd learned. Maddox called her feisty. Andy tried to defend Deja, but Deja brushed it off, saying she could take a compliment.\n\nAfter [[Pat Aquino]] and [[Dean Miller]] were seriously injured, station 23 drove to the hospital. Deja asked if the shift was normal and Theo told her that it wasn't. They all cried together, despite Andy's insistence that Dean would live. ''(\"[[Things We Lost in the Fire (Station 19)|Things We Lost in the Fire]]\")''\n\n===Thanksgiving===\nOn Thanksgiving, Deja was sent to the store to get groceries for Thanksgiving, despite them already having enough food. Andy explained that they were making extra food for the families of Aquino and Morse. ''(\"[[Little Girl Blue]]\")''\n\n===Andy's Stint as Captain===\nAndy stepped in as acting captain while Aquino recovered. During this time, there was an increase in sexist comments, especially directed toward Deja, in the name of hazing. Andy encouraged Deja to speak up for herself and not let them speak to her like that, but Deja continued to insist it was fine. When they were called out to an apartment fire, Andy assigned Deja and Maddox to evacuate the building's residents. However, when they got inside, Maddox said all the action was in fire attack, so he left her to do evacuations on her own. When she told Andy what Maddox had done, Andy tried to call him back, but was repeatedly ignored. When they returned to the station, Andy called everyone's attention to her and said that the attitude around the station needed to change, that the hazing and the sexism and ignoring her orders needed to stop or there would be consequences. She then privately told Deja she was writing Maddox up for what he'd done and would leave Deja's name out of it. She realized that it was her job as captain to make the station a safe place for everyone working there. ''(\"[[A House Is Not a Home]]\")''\n\nOn the first day the new chief, [[Natasha Ross]], visited the station, station 23 was called out alongside station 19 to retrieve a car that had gone over Leon's Ridge. On the scene, Deja helped block traffic to prevent any additional accidents. When [[Owen Hunt]] was lifted out of the car, Deja helped get him safely back onto solid ground. ''(\"[[Started from the Bottom]]\")''\n\n===10K N Turnouts===\nDeja, along with the rest of stations 19 and 23, participated in the 10K N Turnouts fundraiser. After it was over, all the members of 23 went home to enjoy their day off. ''(\"[[Searching for the Ghost]]\")''\n\n===Skydiver===\nDeja and the rest of station 23 responded to a call about a skydiver who had gotten caught in a tree. They arrived on the scene to find [[Sam]], who was impaled on a tree branch in multiple places. She regained consciousness shortly after they arrived. Andy sent Maddox and Theo up into the tree to start cutting her free while Deja cleared room for them to work. While they were working, Maddox dropped his saw, which made Sam start to panic. Wanting to keep her calm, Andy climbed up the ladder herself and helped get Sam free. Once the branches were cut, they put her on a stretcher, but she coded. Andy did CPR on the way to the hospital, but they were unable to resuscitate her. ''(\"[[In My Tree]]\")''\n\n===Candy Factory Fire and Station Closure===\nAt the start of their shift, Ross came and told the team she was shutting 23 down. She told them they'd all be given reassignments or severances and they'd know which soon. Until it was shut down, she encouraged them to keep serving the city as they'd always done.\n\nDeja responded along with the rest of station 23 to a fire at Sweet Ana's Candy Factory. She was sent inside with Andy on backup fire attack. They went inside with a line, but struggled to move as the candy made the floor very sticky. They then worked to close the hopper to stop the flow of sugar, which would make extinguishing the fire much easier. While they were trying to do that, they heard [[Stella]] calling out for help. Deja helped her get to Theo, who evacuated her. Then she went back to Andy and they were able to use something nearby to get enough leverage to close the hopper. Shortly after that, the fire was put out.\n\nThe next morning, as the next shift arrived to relieve them, Deja complimented Andy's leadership and Andy gave a speech about them being part of the history of station 23. ''(\"[[Cold Blue Steel and Sweet Fire]]\")''\n\nThe firefighters gathered at the station one last time, taking pictures, before the flag was lowered and the lights were turned off for the last time. Then they went to Joe's for drinks, where Andy bought the first round for everyone. They then sat and shared stories of calls they'd been on together. When Deja overheard Andy telling Theo about her conversation with Ross, she told the others and they all became upset with Andy, blaming her for the station being closed, and left. ''(\"[[Alone in the Dark]]\")''\n\n==Relationships==\n===Professional===\nAndy was assigned to mentor her when she joined station 23.\n\n==Career==\nShe is a firefighter at [[SFD Station 23]].\n\n==Notes and Trivia==\n*She wanted to be a high school teacher before deciding to become a firefighter.<ref>[[A House Is Not a Home]], 5x07 (S19)</ref>\n*When asked if she could cook, she said she could make toast.<ref>[[Started from the Bottom]], 5x09 (S19)</ref>\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nS195x05DejaDuval.png|[[Things We Lost in the Fire (Station 19)|Things We Lost in the Fire]]\nS195x06DejaDuval.png|[[Little Girl Blue]]\nS195x07DejaDuval.png|[[A House Is Not a Home]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS195x06-16.jpg\nS195x06-20.jpg\nS195x07-14.jpg\nS195x07-15.jpg\nS195x07-16.jpg\nS195x07-17.jpg\nS195x12-34.jpg\nS195x12-36.jpg\nS195x12-37.jpg\nS195x13-1.jpg\nS195x13-2.jpg\nS195x13-6.jpg\nS195x13-8.jpg\nS195x13-9.jpg\nS195x13-11.jpg\n</gallery>\n\n==Appearances==\n{{Deja Duval Appearances}}\n\n{{Scrollbox}}\n{{DEFAULTSORT:Duval, Deja}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:Firefighters]]"}]}}}}