{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"84174": {"pageid": 84174, "ns": 0, "title": "Delilah Tillerman", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S195x08DelilahTillerman.png\n|name = Delilah Tillerman\n|status = Alive\n|marital = [[Terrence Tillerman]] ''(husband)''\n|children = *[[Penelope Tillerman]]\n*[[Rory Tillerman]]\n*[[Tommy Tillerman]]\n|parents = Mother\n|other family = [[Robyn Tillerman]]\n|only appearance = [[All I Want for Christmas is You]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Stacie Greenwell]]\n}}\n\n'''Delilah Tillerman''' is the wife of [[Terrence Tillerman]].\n\n==History==\nDelilah went to her family's for christmas along with her hushand, Terrence, and their three children. On their way, they ordered last-minute groceries, but accidently put their home address for the delivery. Not wanting their kids to go without their eggnog, Terrence went back to their house to pick it up, only to end up trapped between his car and another. Delilah went back to see him and ended up singing to him as they prepared to move him to the PRT. He had her turn around when they moved the car, so she wouldn't have to watch if he died. She continued singing as they moved him. They loaded him into the PRT and closed the doors. Then her children arrived and they all waited as Terrence was treated in the PRT. When the PRT began to drive way, Delilah asked what that meant. Maya told her that the sirens meant that Terrence was alive, which was a good sign.\n\nAt Grey Sloan, Terrence was rushed into surgery. It was a long surgery, but afterward, the whole family was in Terrence's room singing Christmas carols.\n\n==Relationships==\n===Romantic===\nShe is married to [[Terrence Tillerman]].\n\n===Familial===\nShe and Terrence have three children: Penelope, Rory, and Tommy.\n\n==Notes and Trivia==\n*She and her family live at 535 Christopher Court.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS195x08-24.jpg\nS195x08-25.jpg\nS195x08-26.jpg\nS195x08-28.jpg\n</gallery>\n\n{{DEFAULTSORT:Tillerman, Delilah}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]"}]}}}}