{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52263": {"pageid": 52263, "ns": 0, "title": "Denise", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP5x14Denise.png\n|name = Denise\n|status = Alive\n|siblings = Eli\n|parents = [[Melissa (Too Much)|Melissa]]\n|only appearance = [[Too Much]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Private Practice)|5]]\n|portrayed by = [[Allison Miller]]\n}}\n'''Denise''' is the daughter of [[Melissa (Too Much)|Melissa]].\n\n==History==\nDenise brought in Eli, whom she said was her son. He had been crying for 14 hours and wasn't able to eat or sleep. Pete and Cooper examined him and said he was small for ten days and he was malnourished and dehydrated. They questioned why she was bottle feeding instead of breastfeeding, if there was trouble latching or what. Cooper then noticed she didn't look like she'd given birth ten days prior. They figured out Eli wasn't her son.\n\nShe explained that Eli was her brother. Her mother's a drug addict who gave birth and then left him two days later to score. Her mom had been doing it to her since she was eight. She was in foster care for a while and went back and forth. She wanted better for Eli, so she was taking care of him.\n\nEli had neonatal abstinence syndrome because of his mother's drug use and a cystic adenomatoid malformation. It needed to be removed, but operating with him being so small was risky. Pete brought in [[Melissa (Too Much)|Melissa]], whom he had found. She said she'd left to score drugs, but she changed her mind and got clean instead by locking herself in a motel room for eight days. She said she'd called during those eight days, but Denise didn't answer or call or her back.\n\nMelissa went in to see Eli and Denise yelled at her, saying she wouldn't let her hurt Eli. Eli started crashing and they had to rush him into surgery.\n\nAfter his surgery, Melissa said she was trying to do the wrong thing and really wanted to have the chance to be a mother to Eli.\n\nBecause of the complicated situation, they called social services, who sent [[Gladys]]. Gladys spoke to Melissa and Denise and said that if the doctors believed Melissa having Eli was to his detriment, they could explore other options.\n\nCooper spoke to Denise, telling her that Melissa would need a lot of help taking care of Eli and said that even if it didn't seem like it, they were a family and they needed to look out for one another.\n\nDenise came to see Eli in the NICU and talked to Melissa. Melissa told Denise she was sorry and Denise told her to do better with Eli.\n\n==Relationships==\n===Familial===\nHer mother is a drug addict. She was eight the first time her mother left her to score drugs. She woke up and the house was empty. In high school, a teacher found out and Denise spent time in foster care. She spent time going back and forth until she was an adult. When her brother, Eli, was born, she wanted to protect him from that.\n\n==Notes and Trivia==\n*She was 19 when Eli was born.\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]"}]}}}}