{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51223": {"pageid": 51223, "ns": 0, "title": "Dennis Hoffman", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x18MrHoffman.png\n|name = Dennis Hoffman\n|status = Alive\n|marital = Wife †\n|children = Son †\n|grandchildren = [[Patrick Hoffman]]\n|other family = Daughter-in-law †\n|job = Conductor ''(former)''\n|only appearance = [[The Hardest Part]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Tom Bower]]\n}}\n'''Dennis Hoffman''' is the grandfather of [[Patrick Hoffman]].\n\n==History==\nDennis's grandson, Patrick, a piano prodigy, came in to see Cooper because of numbness. Cooper decided to order an MRI and have Amelia consult. He was being raised by Dennis after his parents died in a car accident when he was five.\n\nThe MRI showed a large brain tumor in the area of Patrick's brain that controls hand function. Amelia recommended surgery, but said the safest option meant that Patrick might lose all function in his right hand, meaning he wouldn't be able to play piano. The alternative was an awake craniotomy, in order to allow her to track progress and monitor his hand function as she worked. But because it would take longer, there was a risk he'd end up with paralysis in his right leg. Patrick said he needed piano and asked Dennis to let him have the surgery because he needed piano, but didn't need his legs.\n\nHowever, Dennis said they were going to go with the safer option, though Patrick said it wasn't what he wanted. Amelia and Cooper informed them that they couldn't do what Patrick wanted without Dennis's consent and they also couldn't do what Dennis wanted without Patrick's consent. It would become a matter for the courts. They'd probably rule with Dennis, but they didn't have time to wait for that. Patrick said Dennis could either let him do the awake craniotomy or let him die.\n\nCooper went to talk to Patrick, who said that being a musician was the most important thing in the world to him. He also said that music was his entire relationship with his grandfather. After his parents' funeral, Dennis never looked at him until he started to teach him to play piano. He believed Dennis couldn't learn another way to bond with him.\n\nAmelia brought Dennis in and said that they needed to talk to each other and choose a surgery because his tumor would keep growing. Dennis said he loves Patrick, even though he doesn't say it. Amelia told him what Patrick had said about his relationship and said Dennis needed to tell Patrick he loves him. He became angry, saying she didn't understand, but after she told him about her father's death, he said to do the surgery if that's what Patrick wanted.\n\nPatrick was taken in for surgery and believed his grandfather wouldn't show up to see him before the surgery because he only loved him for his music. During the surgery, Patrick played piano in order to give Amelia an idea of which areas she could cut into and which she couldn't. He said he wished Cooper had been right about his grandfather loving him no matter what.\n\nDennis arrived at the hospital after Patrick was already in surgery. He regretted agreeing to the surgery, saying he thought if he gave Patrick what he wanted, Patrick would know how he felt. Not wanting to risk Patrick dying before he had a chance to tell him, Cooper brought Dennis into the OR to tell Patrick he loved him. At that moment, Patrick started bleeding and said he couldn't feel his hand. Cooper took Dennis back out of the OR while Amelia worked to stop the bleeding.\n\nAmelia later came out and told Dennis she'd gotten the whole tumor. They wouldn't know until he woke up if he'd have any paralysis, but she was hopeful.\n\n==Relationships==\n===Romantic===\nHis wife died of a stroke.\n\n===Familial===\nHis son died in a car accident. After the accident, Dennis took over raising his grandson, Patrick.\n\n==Career==\nHe was a renowned conductor until his son died.\n\n{{DEFAULTSORT:Hoffman, Dennis}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]"}]}}}}