{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52571": {"pageid": 52571, "ns": 0, "title": "Gwen Petrucci", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP6x06GwenPetrucci.png\n|name = Gwen Petrucci\n|status = Alive\n|diagnosis = *Spina bifida\n*Scalp laceration\n|doctors = *[[Addison Forbes Montgomery]]\n*[[James Peterson]]\n|treatment = *Physical therapy\n*Stitches\n|parents = *[[Sean Petrucci]]\n*Father\n|only appearance = [[Apron Strings]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 6 (Private Practice)|6]]\n|portrayed by = [[Lourdes Mack]]\n}}\n\n'''Gwen Petrucci''' is a girl with spina bifida who had surgery before she was born.\n\n==History==\nGwen was diagnosed in utero with spina bifida. Her mother decided to have fetal surgery at Addison's recommendation to repair her spinal column. The surgery was successful, but even so, Gwen was struggling to learn to walk at age seven. While in physical therapy, she fell and hit her head.\n\nUnbeknownst to Gwen, her mother saw Addison in the ER and decided to sue her in order to get money to raise and care for Gwen after being laid off. Addison eventually convinced her to drop the lawsuit so that Gwen wouldn't even find out and get the feeling that she wasn't wanted.\n\n==Relationships==\n===Familial===\nHer father left the family before she was two. After that, her mother raised and cared for her alone.\n\n==Notes and Trivia==\n*She was 7 at the time of her scalp laceration.\n\n{{DEFAULTSORT:Petrucci, Gwen}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S6 Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]"}]}}}}