{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"74258": {"pageid": 74258, "ns": 0, "title": "Gwen", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S192x15Gwen.png\n|name = Gwen\n|status = Alive\n|marital = Husband\n|children = Daughter\n|only appearance = [[Always Ready]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 2 (Station 19)|2]]\n|portrayed by = [[Greta Jung]]\n}}\n\n'''Gwen''' is a woman who climbed a very large tower after missing some doses of her anxiety medication.\n\n==History==\nStation 19 was called out to help a woman who was trapped at the top of Bryn Mawr Tower. When they arrived, they found Gwen at the top of the tower. Ryan was already at the scene and told them she hadn't responded well to attempts to communicate with her. In order to get her down, they knew they had to send someone up after her, so Vic put on a harness and climbed the toward toward Gwen. Once she got to the top, she started to get to know Gwen. Gwen said that she felt lost and explained that she'd missed a few doses of her anxiety medication and then gotten laid off at work. She couldn't go home because she was never home that early, so she went to the tower to get some air. However, once she got to the top of the tower, she realized she couldn't get down. Vic tried to get her to agree to be harnessed, but she refused. However, the radio suddenly chirped with a message from her team, saying that she needed to be traded out. Gwen begged Vic not to leave her, so Vic said she wouldn't. But when they said Ripley was sick and she needed to get to the hospital, Gwen saw her face and said she knew he was important and she didn't want to stand in the way of Vic getting to see him. Vic was then able to get Gwen secured and they went down the tower together. Gwen was then taken to the psychiatric unit at [[Seattle Presbyterian Hospital]].\n\n==Relationships==\n===Romantic===\nShe is married.\n\n===Familial===\nShe has a six year old daughter who likes cars. The daughter gave her one of her cars to take with her for luck on what ended up being her last day of work. Gwen then handed the car over to Vic when she went to go see Ripley in the hospital.\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S2 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}