{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51928": {"pageid": 51928, "ns": 0, "title": "Hailey", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP5x09Hailey.png\n|name = Hailey\n|status = Alive\n|diagnosis = Drug addiction\n|doctors = [[Dr. Dave]]\n|treatment = *Rehabilitation\n*Group therapy\n|parents = Mother\n|only appearance = [[The Breaking Point]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 5 (Private Practice)|5]]\n|portrayed by = [[Debby Ryan]]\n}}\n\n'''Hailey''' is a girl Amelia met in rehab.\n\n==History==\nHailey was in a room with Amelia when she first went to rehab. They endured withdrawal together. When Hailey had the sensation of bugs crawling on her, Amelia explained what was happening and that there were no bugs.\n\nIn a later group session, as Hailey prepared to leave rehab, she said she felt safe there, but Amelia said it was easy to stay sober in rehab. The real test was staying sober in the real world. Hailey called her out on never talking in group. Hailey said that Amelia needed to face the fact that she didn't kill Ryan or the guilt would kill her. When Amelia broke down crying, Hailey said she could finally leave. Amelia walked her out of the facility and told her not to use drugs. Hailey told Amelia to let her friends in.\n\nAmelia later saw Hailey return to rehab after a relapse. When Amelia was discharged on Thanksgiving, Hailey hugged her and told her not to use drugs. Amelia told her that she was Hailey's age when she first got sober and then she went on to become a doctor. She believed Hailey could do good things, too.\n\n==Relationships==\n===Romantic===\nShe had a boyfriend who died. She says he was a bad influence on her.\n\n===Friendships===\nHer best friend died. Hailey said she missed her every day.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP5x09-11.jpg\nPP5x09-18.jpg\nPP5x09-19.jpg\nPP5x09-20.jpg\nPP5x09-22.jpg\n</gallery>\n\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S5 Characters]]\n[[Category:Patients]]\n[[Category:Patients (General)]]"}]}}}}