{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49940": {"pageid": 49940, "ns": 0, "title": "Hal Jarvis", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP207HalJarvis.png\n|name = Hal Jarvis\n|status = Alive\n|diagnosis = Pedophilia\n|doctors = [[Violet Turner]]\n|treatment = Talk therapy\n|marital = Ex-spouse\n|only appearance = [[Tempting Faith]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Cullen Douglas]]\n}}\n'''Hal Jarvis''' is a pedophile who was treated by Violet as a condition of his release.\n\n==History==\nHal was on trial for possession of photographs of children in minimal clothing. Violet was subpoenaed for his case because she'd seen him as a client for three sessions. He received a suspended sentence, but a condition was that he had daily sessions with Violet, which had to be after hours, because the practice also had pediatric patients.\n\nIn their first mandated session, he told Violet he knew it was sick and was sorry he hadn't told her before. He said that that's why he was depressed. He was keeping that secret. He said that getting caught was freeing because he couldn't hide anymore. He wanted to get the thoughts out of his head. He believed that if he did anything to any of the children, they'd become like him because he was also abused as a child. It tore him apart and he didn't want to do it to anyone else. He asked Violet for her help.\n\nIn a later session, he spoke explicitly about Jody Sampica. He said that he didn't want to hurt her, but he did want to be with her. The photographs, to him, felt less dangerous than his fantasy about Jody. He said he just wants to talk to her, but Violet asked if that's what his abuser told him. She told him she didn't want to just talk.\n\nAfter his session, he went out to the waiting room and saw [[Maya Bennett]]. He sat down next to her and started to talk. When Violet saw, she pushed Hal out the door, telling him to leave.\n\nViolet later called the judge and said that she believed that Hal was a danger, so he was arrested. Violet visited him in jail and said that she had an ethical obligation to help people and since he couldn't control his impulses yet, he was a danger. He repeated that he hadn't done anything, which she said she knew.\n\n==Relationships==\n===Romantic===\nHe is divorced. His divorce is one of the subjects he discussed with Violet during their sessions.\n\n{{DEFAULTSORT:Jarvis, Hal}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Psych)]]"}]}}}}