{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"86013": {"pageid": 86013, "ns": 0, "title": "Hallie", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S196x01Hallie.png\n|name = Hallie\n|status = Alive\n|marital = Adam ''(husband)''\n|parents = Parents\n|only appearance = [[Twist and Shout]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 6 (Station 19)|6]]\n|portrayed by = [[Shelby Rabara]]\n}}\n\n'''Hallie''' is a woman who was in a car accident and then got swept up into a tornado.\n\n==History==\nHallie was driving in a car she and her husband had just bought when she was hit by [[Wes (Twist and Shout)|Wes]], who claims Hallie was turning when she wasn't supposed to be. When station 19 arrived on the scene, Maya put a collar on Hallie, then Andy checked her out. Hallie said her right hand was hurting, but couldn't tell if her other hand hurt as well. Before they could get her out, a tornado swept through the town, forcing them to abandon Hallie to shelter themselves. Andy told her to cover her head, but Hallie began to panic immediately and pulled off the collar.\n\nWhen the tornado passed, Hallie found herself still trapped in her car, a short ways away from where she'd been before. Travis Montgomery was there at a political event and he came out to calm her down while they waited for the aid car to come and get her out. When she started to panic more, Travis had [[Norton]] bring him tools and he got Hallie out and onto a table as an aid car arrived to take her to the hospital. He then found her phone and used it to call her husband. He assured Adam that Hallie was okay, then handed the phone to Hallie so she could tell him herself.\n\n==Relationships==\n===Romantic===\nShe is married to Adam. They got married a year ago, but have been together for five. Their wedding took place in her parents' backyard and she says it was the best day of her life.\n\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S6 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}