{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"84693": {"pageid": 84693, "ns": 0, "title": "Hank (In My Tree)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S195x12Hank.png\n|name = Hank\n|status = Alive\n|marital = Wife †\n|only appearance = [[In My Tree]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[John Bishop]]\n}}\n\n'''Hank''' is an unhoused man who came into the clinic for treatment.\n\n==History==\nHank, who had been living on the streets since losing his house after his wife died, came into the clinic on the first day it was open. Jack noticed he was scratching his legs a lot and asked if he could take a long. When he did, he saw that Hank had scabies. He gave Hank a bottle of body shampoo and instructed him on how to use it. But when he realized Hank wouldn't have a private place to apply it, he asked Hank to come upstairs. In the station bathroom, Jack applied the shampoo to Hank's whole body, then cut his hair and shaved his beard. Then he had Hank take a shower and gave him clean clothes to wear. When he was finished, Hank said that no one had looked him in the eyes in six years and thanked Jack for his help.\n\n==Relationships==\n===Romantic===\nHis wife died. Before her death, she had a row of porcelain farm animal figurines. Every day, he hid them to rile her up and every day, she put them back. When she died, he just left them as she had, because he had trouble caring about anything, even when his house was in foreclosure.\n\n{{DISPLAYTITLE:Hank}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}