{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"71068": {"pageid": 71068, "ns": 0, "title": "Hannah Sherwood", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S192x06HannahSherwood.png\n|name = Hannah Sherwood\n|status = Alive\n|marital = Val Sherwood ''(wife)''\n|children = [[Parker Sylvana Sherwood]]\n|only appearance = [[Last Day on Earth]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 2 (Station 19)|2]]\n|portrayed by = [[Rebecca Field]]\n}}\n\n'''Hannah Sherwood''' is a woman who was rescued after getting her hand stuck in a garbage disposal.\n\n==History==\nHannah was doing dishes when her wedding ring fell down into the disposal. She impulsively reached for it and got her hand stuck in the garbage disposal. She called for help and Ben, Travis, and Dean responded to the call. Travis, who had the most experience with the situation, began taking the disposal apart from below while Dean and Ben talked to her and gave her pain medication. Her daughter watched them work and seemed disinterested in her mother's condition. When Hannah noticed the tattoo on Parker's arm, she nearly pulled her hand out, but they stopped her. Once Travis finished taking apart the disposal, Hannah was able to remove her hand. Then they bandaged her up and told her to follow up with the hospital. Despite her detached attitude during the ordeal, Parker hugged her mom.\n\n==Relationships==\n===Romantic===\nShe is married to Val Sherwood. Val is in the Army and is frequently deployed. Hannah said she missed Val every day and worried she was screwing up Parker on her own.\n\n===Familial===\nHer daughter, Parker, started acting out when her wife was deployed because she missed her mom.\n\n==Notes and Trivia==\n*She and her family live at 414 Cedar Drive.\n\n{{DEFAULTSORT:Sherwood, Hannah}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S2 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}