{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50149": {"pageid": 50149, "ns": 0, "title": "Harold Allen", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = PP220HaroldAllen.png\n|name = Harold Allen\n|status = Alive\n|title = M.D.\n|job = Doctor\n|workplace = \n|only appearance = [[Do the Right Thing]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Marty Lodge]]\n}}\n'''Harold Allen''' is a doctor who was put on trial related to the death of a patient.\n\n==History==\nHarold was sued by a patient's family for malpractice after the patient died. Sam was an expert witness in the case and testified that Harold had given the standard of care. However, when questioned by the other side, he became flustered. In order to save the case, [[Duncan]], Harold's lawyer, decided to put Sam back on the stand. When Sam reviewed the medicine to prepare for this, he discovered that the patient had received morphine for a surgery two years prior, which was overkill unless the patient was allergic to aspirin, which Martin Weiser was. He noticed that it wasn't flagged on the chart, but there was a blank page where that information would have been. He figured out that Harold Allen hadn't been able to revive him because he'd given him aspirin and he was allergic. He went to Harold with the information and Harold said he hid it because he was worried he'd lose everything over that mistake.\n\nThe next day in court, Sam testified that Harold had done everything he should have with what he knew at the time. When [[Corinne Lee]] questioned what he meant by that, he said that Harold didn't review the patient's medical records, which listed an aspirin sensitivity. Corinne noted that that wasn't in their discovery, which Sam said was due to Harold changing the pages.\n\n==Career==\nHe is a doctor. He was sued for malpractice when a patient died because he was unaware of the patient's aspirin sensitivity.\n\n{{DEFAULTSORT:Allen, Harold}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Doctors]]"}]}}}}