{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"74068": {"pageid": 74068, "ns": 0, "title": "Harold (Crazy Train)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S192x10Harold.png\n|name = Harold\n|status = Alive\n|children = [[Will (Crazy Train)|Will]]\n|only appearance = [[Crazy Train]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 2 (Station 19)|2]]\n|portrayed by = [[Michael Welch]]\n}}\n\n'''Harold''' was one of the passengers on the train with a bird flu outbreak.\n\n==History==\nHarold and his son, Will, were on the subway when the train stalled. A few people on the train were injured, including Will. While Maya was examining him, he coughed up blood. Maya noticed his luggage, which indicated he'd just gotten off an international flight, and asked where he'd been. Harold explained that he'd been in Bashran with his mother, an aid worker. Maya, remembering the news reports about an outbreak of the avian flu, called out to report the symptoms and the CDC was called in. Another subway passenger, [[Neil]], had been on the same flight and also had some symptoms. After talking to Harold about Will's condition, Maya and Jack made an announcement to the whole care and informed them they wouldn't be able to leave until the CDC cleared them. Tensions started to rise as Will and Neil's condition declined. When [[Reese]] tried to leave, a security guard, [[Kenneth]], stopped him using a taser, which caused him heart trouble. Because they didn't have access to the outside, Jack decided to use Harold as a walking blood donor for his son. Once the blood got to Will, he started to improve and once the CDC arrived, he was moved to the hospital in isolation.\n\n==Relationships==\n===Romantic===\nHe was involved with Will's mother, but they didn't stay together.\n\n===Familial===\nHis son was born when he was very young. When Will was younger, they got along well, but when Will went to live in Bashran with his mother, he and Harold drifted apart.\n\n==Notes and Trivia==\n*His blood type is O-.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS192x10-3.jpg\nS192x10-6.jpg\nS192x10-7.jpg\n</gallery>\n\n{{DISPLAYTITLE:Harold}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S2 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}