{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"84556": {"pageid": 84556, "ns": 0, "title": "Harry (Season 5)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S195x11Harry.png\n|name = Harry\n|title = PhD\n|status = Alive\n|marital = Susan ''(wife, separated)''\n|job = Scholar\n|only appearance = [[The Little Things You Do Together]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Jim Ortlieb]]\n}}\n\n'''Harry''' is a man who threatened to light himself on fire after his wife left him.\n\n==History==\nHarry's wife shocked him one day by saying their marriage was over after twenty-five years. The next day, his neighbors called 911 when they saw him yelling and pacing in his front yard. Crisis One arrived to find Harry quietly sitting in his car. Travis asked him what was going on and suggested he call his wife, not aware of what had happened between then. Harry called his wife and held the phone up so Travis could hear her yelling at him. Then he picked up the container of gas next to him and poured it on his lap. He quickly began to choke on the fumes, so Travis was able to persuade him to open the door so he could breathe. He did while revealed that he had a lighter in his hand. Travis started asking him about his work. Though he recognized Travis was just trying to distract him, he answered the question. At this point, Andy insisted on calling the engine, so they would be able to put him out if he lit himself on fire. When it arrived, Harry became agitated. He told Travis about his wife suddenly leaving him, saying it was a long-time coming. That was news to him, as she had not previously mentioned anything to him. To connect with Harry, Travis confessed that he was doing the same thing to someone, falling out of love and not giving him the chance to fix things. Harry then lit the lighter and dropped it as his feat, igniting himself. Maya and Sullivan quickly put him out with fire extinguishers with some help from the hose. They then put him on a stretcher and got him into the aid car to go to the hospital.\n\n==Relationships==\n===Romantic===\nHe was married to his wife, Susan, for 25 years when woke up one day and told him it was over, blindsiding him. On their wedding day, she gave him a lighter engraved with a Noël Coward quote, \"Marriage is the aftermath of love.\" He later used that same lighter to light himself on fire.\n\n==Career==\nHe's a scholar. He wrote his dissertation on Noël Coward.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS195x11-5.jpg\nS195x11-7.jpg\nS195x11-9.jpg\n</gallery>\n\n{{DISPLAYTITLE:Harry}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}