{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"85322": {"pageid": 85322, "ns": 0, "title": "Hazel Talbert", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = 18x18HazelTalbert.png\n|name = Hazel Talbert\n|status = Alive\n|marital = [[Margot Talbert]] ''(wife)''\n|only appearance = [[I'll Cover You]]\n|seasons = '''[[Grey's Anatomy|GA]]:''' [[Season 18 (Grey's Anatomy)|18]]\n|portrayed by = [[Janab Kareem]]\n}}\n\n'''Hazel Talbert''' is the wife of [[Margot Talbert]].\n\n==History==\nHazel's wife, Margot, came into the ER with throbbing abdominal pain that radiated to her back. She told the doctors it had started that morning. They examined her and find that her abdomen was pulsating, so they ordered a CT, which showed an abdominal aortic aneurysm. While she was in the CT, they asked if she could call anyone for her and she said no. She admitted that she'd been having the pain for a few months and said Hazel would be angry to know she hadn't gotten it looked out because she told Hazel she had. As they prepared for her surgery, Winston informed her they were obligated to notify next of kin and would be calling her wife. Margot was upset by that and Maggie told her that wasn't necessarily true. Winston asked her what would happen if she died. Margot then coded, because her aneurysm had ruptured. They rushed to start her surgery and were able to repair the damage. After her surgery, Hazel came to see her and thanked the doctors for saving her life.\n\n==Relationships==\n===Romantic===\nShe is married to [[Margot Talbert]].\n\n{{DEFAULTSORT:Talbert, Hazel}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S18 Characters]]"}]}}}}