{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"6667": {"pageid": 6667, "ns": 0, "title": "Heather Parker", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = PP308HeatherParker.png\n|name = Heather Parker\n|born = [[Timeline|1984]]\n|died = [[Timeline|2009]]; [[Los Angeles]], California\n|status = Deceased\n|marital = [[Dell Parker]] † ''(husband)''\n|children = [[Betsey Parker]]\n|parents = Mother\n|other family = [[Monica Bratton]]\n|first appearance = [[Contamination]]\n|last appearance = [[Blowups]]\n|count = 5\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]] and [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Agnes Bruckner]]\n}}\n\n'''Heather Parker''' is a drug addict, who was married to [[Dell Parker]], and died because of an explosion in her house that occurred because she was cooking meth. She died at [[St. Ambrose Hospital]] while talking to [[Pete Wilder]].\n\n==History==\n===Drug Addiction===\nHeather initially got into drugs because of [[Dell Parker]] when they were teenagers. ''(\"[[Contamination]]\")''\n\n===Dell's Petition for Custody===\nShe got clean and relapsed several times over the early years of Betsey's life, providing an unstable early childhood. At one point, she got cleaned up enough to get a good job. In order to get the job, she left Betsey with Dell all day and was unable to be reached. She received notification that day that Dell petitioned for full custody. She confronted Dell about it and he said that they could work something out, so he could get to see her more, but he also didn't take her away from Heather. ''(\"[[Contamination]]\")''\n\n===Promotion===\nHeather got a promotion at work, but said it was in St. Louis. Dell said Heather could go, but that Betsey needed to stay. Heather left angry. Dell later came to the apartment to talk to Heather, but found the apartment cleared out and Betsey and Heather gone. ''(\"[[What Women Want]]\")''\n\n===Relapse and Return to Los Angeles===\nHeather came back to Los Angeles and showed up at the practice alone. The pressure of her job got to her and she started using drugs again. She came to Dell because she needed $10,000. She said that if he gave her the money, she'd let him have Betsey. He got the money from Sam, but when Heather showed up for it, he told her he could call the police or DCFS. He couldn't give her the money to go kill herself because while he didn't like her, he loved his daughter and Heather is his daughter's mother. He then told her to come say goodbye to Betsey. She did so and then left, saying she'd somehow get Betsey back. ''(\"[[Yours, Mine & Ours]]\")''\n\n===Marriage===\nHeather got clean again and this time, she and Dell got married. Violet and Naomi tried an intervention, but Dell said he was happy with Heather. She said the same thing. She'd gone through rehab and wasn't doing drugs, which gave them the chance to be a family. ''(\"[[Sins of the Father]]\")''\n\n===Meth Explosion and Death===\nHeather was cooking at the stove when the house exploded around her. Dell came in and got Betsey out. He went back for Heather, but by that point, she was seriously burned. They were both rushed to the hospital, where they started treating Heather's burns. [[Dr. Simcox]] did burn treatment and estimated a 30% chance of survival. When Dell learned that Heather had been cooking meth, he went to her room and told her he hoped she died. She then continued burn treatment, but told Pete just to let her die. Knowing she was going to die, she asked to see Betsey to say goodbye. Dell refused because of Heather's drug use. However, Pete tried to sneak her away, but was thwarted by Dell. Heather then died with just Pete there, apologizing to Dell for what she'd done. ''(\"[[Blowups]]\")''\n\n==Relationships==\n===Romantic===\nShe was married to [[Dell Parker]] until her death. They met in high school and dated briefly, but didn't get married until several years later. ''(\"[[Sins of the Father]]\")''\n\n==Notes and Trivia==\n*At the time of her death, she was 24 years old.\n*Her last words were \"I wanted to be a good mom. I wanted to.\"<ref>[[Blowups]], 3x10 (PP)</ref>\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nPP211HeatherParker.png|[[Contamination]]\nPP219HeatherParker.png|[[What Women Want]]\nPP222HeatherParker.png|[[Yours, Mine & Ours]]\nPP308HeatherParker.png|[[Sins of the Father]]\nPP310HeatherParker.png|[[Blowups]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP3x10-16.JPG\nPP3x10-23.JPG\n</gallery>\n\n==Appearances==\n{{Heather Parker Appearances}}\n{{Scrollbox}}\n\n{{DEFAULTSORT:Parker, Heather}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:PP S3 Characters]]\n[[Category:Deceased Characters]]\n[[Category:Patients]]\n[[Category:Patients (Trauma)]]\n[[Category:Patients (ER)]]"}]}}}}