{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"83873": {"pageid": 83873, "ns": 0, "title": "Heather Young", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = 18x06-15.jpg\n|name = Heather Young\n|status = Alive\n|marital = [[Noah Young]] † ''(husband)''\n|children = [[Danny Young]]\n|first appearance = [[Everyday Is a Holiday (With You)]]\n|last appearance = [[Living In a House Divided]]\n|count = 2\n|seasons = '''[[Grey's Anatomy|GA]]:''' [[Season 18 (Grey's Anatomy)|18]]\n|portrayed by = [[Ashley Tavares]]\n}}\n\n'''Heather Young''' is the wife of [[Noah Young]].\n\n==History==\nHeather came to the hospital with her son, Danny, when she heard that her husband, Noah, had collapsed at work while bagging groceries. She expressed regret at letting him get a job as she knew that, due to pulmonary fibrosis, he didn't have the stamina to get through a whole shift. However, he had insisted because the pills were piling up. At the hospital, she waited while Noah had tests and got some treatments to help him breathe. When Bailey came to find her, she was struggling not to cry. She spoke briefly with Bailey about her struggle with Noah dying. Bailey took Heather to a patient room and gave her permission to break down, as she'd been holding it together for her husband and her son.\n\nLater, with his chest tube in, Noah asked Owen how much longer it would be before it was over. Owen said it would be soon. He helped Owen get ready and the family left the hospital together. ''(\"[[Everyday Is a Holiday (With You)]]\")''\n\nNoah later died after taking medication Owen provided to him to hasten his death. ''(\"[[It Came Upon a Midnight Clear]]\")''\n\nWith Noah gone, Heather worked with Owen to get the same medication to other soldiers with the same condition who didn't live in states where physician-assisted suicide was an option for them. After Owen was in an accident, she came to the hospital to get his car key so she could get the medicine out of his car to distribute it. While she was doing this, Teddy followed her and told her she would call the police if Heather didn't tell her what the medication was. ''(\"[[Living In a House Divided]]\")''\n\nLater, Heather told [[John (Out for Blood)|John]] what Owen had done and sent John to Seattle to get the same treatment for his wife. When Owen tried calling her to ask her about it, she didn't answer his call. ''(\"[[Out for Blood]]\")''\n\n==Relationships==\n===Romantic===\nShe was married to [[Noah Young]] until his death.\n\n===Familial===\nShe and her husband have one son, Danny.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\n18x06-15.jpg\n18x06-32.jpg\n18x06-33.jpg\n18x06-34.jpg\n</gallery>\n\n==Appearances==\n{{Heather Young Appearances}}\n\n{{DEFAULTSORT:Young, Heather}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S18 Characters]]"}]}}}}