{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50495": {"pageid": 50495, "ns": 0, "title": "Henry (Fear of Flying)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP316Henry.png\n|name = Henry\n|status = Alive\n|job = Seed vendor\n|only appearance = [[Fear of Flying]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Adam Godley]]\n}}\n\n'''Henry''' is the boyfriend of [[May]].\n\n==History==\nHenry's girlfriend, May, was at the practice with pain. Her boyfriend, Henry, had just flown in from another country and they consummated their relationship. She had severe pain in her genitals, so Naomi did an exam.\n\nMay had signs of an allergic reaction, but she couldn't pin down the cause, so she called in Pete for help. Pete determined that she was allergic to Henry's sperm and the next reaction would likely be worse. Naomi said they could still have a baby, washing his sperm before inseminating. They were also told they'd need to use condoms until Pete could figure out a treatment. He consulted with [[Charlotte King]] for information on semen allergies.\n\nMay later showed up in the ambulance with difficulty breathing. Pete gave her a breathing treatment to ease her breathing. Henry said they'd used a condom, but it either broke or leaked because there was seminal fluid present. Henry said he couldn't keep doing that because he didn't want to hurt or kill her. Pete asked them to be patient while he looked for a way.\n\nMay later came to Pete and said Henry had broken up with her, so he didn't have to waste his time looking for a solution.\n\nPete had Henry and May both come in and suggested exposure therapy. He couldn't guarantee it would work and it would take months, but it could help them.\n\n==Relationships==\n===Romantic===\nHe met his girlfriend, May, online. They were in love and believed they were soul mates.\n\n==Career==\nHe sells rare Peruvian lily seedlings online. Through that work, he met his girlfriend, May.\n\n{{DISPLAYTITLE:Henry}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]"}]}}}}