{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"82261": {"pageid": 82261, "ns": 0, "title": "Henry Lau", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = S194x13HenryLau.png\n|name = Henry Lau\n|status = Alive\n|marital = [[Petra Lau]] ''(wife)''\n|children = [[JJ Lau]]\n|grandparents = Grandparents\n|grandchildren = [[Pruitt Arike Miller]]\n|other family = Great-grandfather\n|job =\n|workplace = LCP Holdings\n|only appearance = [[I Guess I'm Floating]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 4 (Station 19)|4]]\n|portrayed by = [[Wilky Lau]]\n}}\n\n'''Henry Lau''' is [[JJ Lau|JJ's]] father and [[Pruitt Arike Miller|Pru's]] grandfather.\n\n==History==\nHenry and his wife, Petra, flew from Hong Kong to Seattle to meet their granddaughter, Pru, and her father, Dean. Upon their arrival in Seattle, they pledged their support for Dean suing over his wrongful arrest, which they'd seen on video. They also pledged their support for Pru. They had looked up Dean and his parents to know who Pru had in her corner and arranged to meet Dean's parents at his houseboat to get to know each other. After the dinner, they expressed desire to continue to visit Pru and get to know her.\n\n==Relationships==\n===Romantic===\nHe is married to [[Petra Lau]].\n\n===Familial===\nHis great-grandfather built parts of the transcontinental railroad. Then his son opened a store, which was burned down. They re-built it, but it was burned three more times because they were Chinese. After that, they moved to Hong Kong and made their fortune there.\n\nHe and his wife were both dismayed at how their daughter turned out, including her leaving her daughter shortly after birth. Despite this, they had a strong desire to be in Pru's life and help support her.\n\n==Career==\nHe and his wife are the owners of Lau Central Pacific Holdings, a private equity firm.\n\n{{DEFAULTSORT:Lau, Henry}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S4 Characters]]"}]}}}}