{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"49906": {"pageid": 49906, "ns": 0, "title": "Henry", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP2x06-16.jpg\n|name = Henry\n|status = Alive\n|diagnosis = *Anemia\n*High blood pressure\n|doctors = [[Sam Bennett]]\n|treatment = Oral medication\n|marital = [[Frances]] ''(wife)''\n|other family = Helen † ''(sister-in-law)''\n|only appearance = [[Serving Two Masters]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 2 (Private Practice)|2]]\n|portrayed by = [[Billy Dee Williams]]\n}}\n'''Henry''' is a patient who was struggling to maintain his own health as he cared for his wife, [[Frances]].\n\n==History==\nAfter cancelling his appointment several times because it was hard to get away from his wife, [[Frances]], who had Alzheimer's, Henry finally saw a doctor. He had lost significant weight and was anemic. Because caring for his wife put additional stress on him, Sam suggested that he put his wife in a nursing home so she could get the care she needed and he could start taking better care of himself.\n\nWhen Frances had an accident while Henry was helping her out of the tub, they both landed in the hospital. While looking through Frances's chart, Naomi saw that they hadn't done a CT before diagnosing her with Alzheimer's. Naomi looked into it and believed that Frances had normal-pressure hydrocephalus instead of Alzheimer's. She was too fragile for neurosurgery, but Naomi suggested that a spinal tap could relieve the pressure enough to make her lucid for long enough to see how hard things are for Henry, hoping she could convince him to put her in a home.\n\nThey did the spinal tap and Frances woke up. When she heard about her condition, she told Henry to promise to visit her every day, hold her hand, and then let her go.\n\n==Relationships==\n===Romantic===\nHe has been married to [[Frances]] for almost 50 years. When she was diagnosed with Alzheimer's, he became her primary caregiver, which put great strain on his health.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP2x06-7.jpg\nPP2x06-10.jpg\nPP2x06-16.jpg\nPP2x06-30.jpg\nPP2x06-34.jpg\nPP2x06-36.jpg\n</gallery>\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S2 Characters]]\n[[Category:Patients]]\n[[Category:Patients (General)]]\n[[Category:Patients (ER)]]"}]}}}}