{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51180": {"pageid": 51180, "ns": 0, "title": "Hillary Loveman", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x14Hillary.png\n|name = Hillary Loveman\n|status = Alive\n|doctors = [[Violet Turner]]\n|treatment = Talk therapy\n|marital = [[Brett Loveman]] † ''(husband)''\n|children = Justin Loveman\n|other family = Mother-in-law †\n|only appearance = [[Home Again]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Paula Malcomson]]\n}}\n'''Hillary Loveman''' is the wife of [[Brett Loveman]].\n\n==History==\nHillary's husband, Brett, was on death row and scheduled to be executed in 48 hours. She was in therapy to get some closure on the issue, but she said she'd rather spend the time calling the governor's office to try to get another stay. Meanwhile, Brett was also being counseled in his last days. He'd been in prison for 17 years and had maintained his innocence the entire time, but in the last days, he confessed to Sheldon that he had done it.\n\nHe was a very calm guy, never raised his voice to anyone, but snapped. He'd met a man in a bar who was rude and disrespectful, so he followed him home and killed him. He said it felt like something inside him broke. He went home to get his gun, came back, and shot him. He said he didn't want Hillary to spend any more time hating the world, so she needed to know the truth about what he'd done.\n\nHillary continued to work on ways to get Brett another stay. Violet came to her home and asked her to talk about what would happen if she couldn't get a stay. She was determined to clear Brett's name, even if it happened after he was dead.\n\nBrett had Hillary brought to the prison and confessed to her that he'd killed Paul Miller. She initially laughed in disbelief and then left without talking to Brett.\n\nDespite the confession, Hillary continued to try to to get a stay. She said that their son was colicky. And Brett had gotten fired when they were already broke. Then his mother died. And she believed that's why he killed Paul.\n\nHillary went to [[Ellen Miller]], Paul's wife, and told her that Brett had murdered her husband. She said she already knew that and Hillary had been the only person who seemed not to know that. Hillary apologized to Ellen and then asked her to ask the governor for a stay, saying she needed more time. Ellen talked about the milestones in their children's lives that Paul had missed because of Brett. She said Brett had taken all the time she had left from her, so she wouldn't give Hillary more time with Brett.\n\nAs Brett was taken to be prepared for his execution, Hillary still refused to see him. After he was taken, she decided she wanted to see him, but was told she could witness the execution, but couldn't talk to him anymore. She decided to attend the execution and watched as Brett was given a lethal injection.\n\n==Relationships==\n===Romantic===\nShe was married to [[Brett Loveman]] until his death. They'd been together since high school.\n\n===Familial===\nHer son, Justin, was nine months old when her husband was imprisoned.\n\n{{DEFAULTSORT:Loveman, Hillary}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Psych)]]"}]}}}}