{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"85420": {"pageid": 85420, "ns": 0, "title": "Holly (Crawl Out Through the Fallout)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Other Characters Infobox\n|image = S195x18Holly.png\n|name = Holly\n|status = Alive\n|children = Son\n|parents = Parents\n|job = Barista\n|workplace = La Gaviota\n|only appearance = [[Crawl Out Through the Fallout]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Lily Mae Harrington]]\n}}\n\n'''Holly''' is a woman who was raped in college by [[Jeremy Benanti]].\n\n==History==\nWhen Holly was in college, she went to a bar where they had $3 margarita night. She drank many of these and went outside when she felt like she was going to vomit. [[Jeremy Benanti]] follow her out. When she woke up the next morning, she didn't know anything was wrong until she went to take a shower and realized her panties were missing. She showered, then noticed she had bruises up and down her sides. Her roommate told her to report it, but she didn't know what to say because she didn't know what happened. She ended up failing out of school the second semester. Her parents sent her to a shrink and she had a recovered memory of Jeremy pulling her beside the dumpster outside the bar and raping her. She reported it to the dean, but the dean said he didn't want to ruin a young man's future over the word of a drunk college dropout.\n\nYears later, Holly learned that [[Andy Herrera]] had killed Jeremy in self-defense after he attempted to rape her outside a bar. She was shocked when Andy came into the coffeeshop where she was working to ask her to come talk to the prosecutor about her experience in the hopes of the prosecutor dropping the manslaughter charge against Andy. She tried to get Andy to leave, saying she didn't want her son to see Jeremy's case associated with her, but Andy persuaded her to tell her story. Once Holly told Andy what had happened to her, Andy said that she was looking at ten years if convicted and she needed people to stand up and say it wasn't right for her to go to jail for defending herself. Holly agreed to go with Andy to the prosector's office and the charges against her were dropped.\n\n==Relationships==\n===Familial===\nShe has a son she's raising on her own because his dad isn't in the picture.\n\n==Career==\nShe is a barista at La Gaviota.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS195x18-37.jpg\nS195x18-38.jpg\nS195x18-39.jpg\n</gallery>\n\n{{DISPLAYTITLE:Holly}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]"}]}}}}