{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"52832": {"pageid": 52832, "ns": 0, "title": "Holly", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP6x13Holly.png\n|name = Holly\n|status = Alive\n|doctors = [[Violet Turner]]\n|treatment = Talk therapy\n|parents = Parents †\n|other family = Aunt\n|only appearance = [[In Which We Say Goodbye]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 6 (Private Practice)|6]]\n|portrayed by = [[Sarah Ramos]]\n}}\n'''Holly''' is a patient of Violet's who had lost her parents and boyfriend in a car accident.\n\n==History==\nHolly was seeing Violet. She talked about her day and said it wasn't until she went to bed that she realized it was the six year anniversary of the car accident that killed her parents and boyfriend. She felt guilty because it didn't seem right that she could forget them, but then she felt relieved. At the end of their session, Violet told Holly that she believed they were done. Holly'd been seeing her for five years, but she'd been weaned off her medications and was living on her own. She was applying to cooking schools. She'd been able to visit with her boyfriend's parents for the first time since the accident, the final step on her goal list. Holly said it was great and hugged Violet.\n\nHolly later came to Violet's office to tell her that she'd gotten into Le Cordon Bleu. She didn't believe she could go, but Violet said she could handle it. Holly started to panic, saying it was too far away from Violet, who had said she'd always be there for her. She said she wasn't going and she wasn't leaving therapy because she wasn't ready. Violet agreed to keep seeing Holly.\n\nAt a later session, Holly was talking about a recipe when Violet said that it would be their last session and the receptionist wouldn't let her make another if she called. She was ready to be done because she was sitting there talking about food instead of feelings. Holly asked how she should know she was done, but Violet said she just needed to trust her. Violet said that she got into Le Cordon Bleu because she'd applied. She wanted to go and Violet worried that her ability to keep coming back to therapy was holding her back. Holly admitted she was scared, but Violet said that was normal.\n\nAs Holly prepared to get in the cab to the airport, Violet reminded her she could do it and told her to have a wonderful time. Holly thanked her for what she'd done and Violet said she'd be just fine.\n\n==Relationships==\n===Romantic===\nHer boyfriend died in a car accident, along with her parents. Holly herself survived the accident.\n\n===Familial===\nHer parents died in a car accident in which she was the only survivor.\n\n==Notes and Trivia==\n*She was the last patient to be treated on screen in ''[[Private Practice]]''.\n*She was the symbol of Private Practice ending: her treatment took 6 years, which is as long as the series ran, and she was ready to move in the finale.\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S6 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Psych)]]"}]}}}}