{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"74092": {"pageid": 74092, "ns": 0, "title": "Ifeya Miller", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Character Family Infobox\n|image = S195x13-14.jpg\n|name = Ifeya Miller\n|status = Alive\n|marital = [[Bill Miller (Character)|Bill Miller]] ''(husband)''\n|children = *[[Dean Miller]] †\n*[[Yemi Miller]]\n|grandchildren = [[Pruitt Arike Miller]]\n|first appearance = [[Baby Boom]]\n|last appearance =\n|count = 6\n|seasons = '''[[Station 19|S19]]:''' [[Season 2 (Station 19)|2]], [[Season 4 (Station 19)|4]], and [[Season 5 (Station 19)|5]]\n|portrayed by = [[Barbara Eve Harris]]\n}}\n\n'''Ifeya Miller''' is the mother of [[Dean Miller]].\n\n==History==\n===Raising Her Kids===\nIfeya used to walk her children to school every day. The other kids would laugh because they looked different and because she talked different and she would bend down and say to her son, \"We are Nigerian and we are brave\". ''(\"[[Something About What Happens When We Talk]]\")''\n\n===Family Dinner===\nIfeya, along with her husband and daughter, went to her son's house to have dinner with him and Jack. During the dinner, Ifeya and Bill continuously tried to get Dean to join the family business. This came to a head when Yemi announced that she wanted to move out of their house, inspired by Dean. Ifeya then took Dean outside to talk to him privately, where he explained that being a firefighter is more than a job to him. He and Ifeya then made a deal that she would back off Yemi and let her move out and support her if he would go on a few dates that she set up for him. ''(\"[[Baby Boom]]\")''\n\n===Pru's Birth and Infancy===\nWhen Pru was born, Ifeya and Bill disapproved of how she came into the world and cut Dean off for some time. However. After the start of the [[COVID-19 Pandemic]] and Dean's wrongful arrest, they started to mend fences.\n\nIfeya came to Dean's house to babysit Pru while he went to work. He spent a bit of time before they left explaining to her how to take care of Pru, but she reminded him she'd taken care of kids before. ''(\"[[Here It Comes Again]]\")''\n\n===Meeting JJ's Parents===\nWhen JJ's parents came to town to meet Dean and Pru, they arranged to have a dinner with Ifeya and Bill. Despite a small amount of tension, with Ifeya expressing that she didn't want Pru influenced by JJ's lifestyle, the dinner went well and JJ's parents expressed desire to continue visiting her and having a relationship with her. ''(\"[[I Guess I'm Floating]]\")''\n\n===Babysitting Pru===\nOn the first day of Crisis One, Ifeya went to [[Dean's Houseboat]] and babysat Pru so he could go to work. She felt it was too soon to launch the program and believed they needed more training. ''(\"[[Can't Feel My Face]]\")''\n\n===Fighting for Custody of Pru===\nDespite Dean's will stipulating that he wanted Pru to be raised by Ben and Bailey in the event of his death, Ifeya and Bill took her to live with them and insisted that they would be raising her instead. They also cleared out Dean's houseboat and arranged for it to be sold. When Ben and Bailey tried to reach a good solution for everyone, she refused and said she needed to override her son because she didn't believe he'd made the right decision for Pru. However, when Pru woke up that night crying for Bailey, she called Bailey and let her, along with Ben and Joey, help put Pru back to bed. ''(\"[[A House Is Not a Home]]\")''\n\nAfter months of fighting, Ifeya and Bill came to Ben and Bailey's place and told them that they wanted Pru to live with Ben and Bailey permanently, but wanted virtually all holidays and alternating birthdays. Bailey rejected the offer, saying that arrangement made them glorified nannies while Ifeya and Bill got to do all the fun things. She then implied that she was privy to some private medical information that could make the difference in court. Ifeya then told Bailey she'd had a heart attack and had had surgery to implant a pacemaker, which they were still adjusting. It made it difficult to keep up with a toddler. Ifeya and Bill then agreed to sharing the holidays, but Ifeya still asked Ben to quit firefighting, as she didn't want Pru to lose a second father to a fire. ''(\"[[Cold Blue Steel and Sweet Fire]]\")''\n\n==Relationships==\n===Romantic===\nShe is married to [[Bill Miller (Character)|Bill Miller]] with two children. They met when they were 22.\n\n===Familial===\nShe wanted both her children to join the family business and puts a lot of pressure on both of them to be successful. She was disappointed when Dean became a firefighter and when his daughter [[Pruitt Arike Miller]] was born, she cut him off and refused to meet his daughter.\n\n==Career==\nShe started and runs her own business. She expects both of her children to join the family business.\n\n==Notes and Trivia==\n*She was born in Nigeria and came to the US as an exchange student.\n*She speaks both English and Yoruba.\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nS192x11IfeyaMiller.png|[[Baby Boom]]\nS194x11IfeyaMiller.png|[[Here It Comes Again]]\nS194x13IfeyaMiller.png|[[I Guess I'm Floating]]\nS195x02IfeyaMiller.png|[[Can't Feel My Face]]\nS195x07IfeyaMiller.png|[[A House Is Not a Home]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS195x13-14.jpg\nS195x13-16.jpg\nS195x13-19.jpg\nS195x13-22.jpg\n</gallery>\n\n==Appearances==\n{{Ifeya Miller Appearances}}\n{{Scrollbox}}\n\n{{DEFAULTSORT:Miller, Ifeya}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S2 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:S19 S5 Characters]]"}]}}}}