{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"78688": {"pageid": 78688, "ns": 0, "title": "Inara", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S194x14-11.jpg\n|name = Inara\n|status = Alive\n|marital = [[Ted]] ''(ex-husband)''\n|siblings = Sister\n|children = [[Marcus (Station 19)|Marcus]]\n|other family = At least two nieces or nephews\n|first appearance = [[Dream a Little Dream of Me]]\n|last appearance = [[Forever and Ever, Amen]]\n|count = 12\n|seasons = '''[[Station 19|S19]]:''' [[Season 3 (Station 19)|3]] and [[Season 4 (Station 19)|4]]\n|portrayed by = [[Colleen Foy]]\n}}\n\n'''Inara''' is a woman whom Jack saved from her abusive husband. She had a short-lived romantic relationship with Jack.\n\n==History==\n===Escaping Her Abusive Husband===\nInara and her son, Marcus, were living with her new husband, Ted. Marcus witnessed Ted hitting his mother and turned the burners on to fill the house with gas. Then his mother called 911 to report a gas leak. The firefighters responded to the calls, which happened three times in a single week. During the third call, they became suspicious that something more serious was going on, especially after Jack saw Inara signing to Marcus that daddy had calmed down. Jack separated Marcus and Inara from Ted and used sign language to learn the truth about what was happening, including that Inara didn't have anywhere else to take Marcus. She also said she'd called the police the first time it happened, but Ted convinced them she was overreacting and he'd locked her in a closet for eleven hours that night. Once he knew the truth, Jack helped Dean stall Ted while Inara went inside and packed a bag. Then they lied to Ted and said it was safe for him to stay in the house but not for Marcus and Inara to stay with him. While he was disputing this, they noticed flames in a room in the house. The fire was quickly extinguished and Ted believed that Marcus started it. When the firefighters witnessed him grabbing Marcus and yelling at him, they pulled him away. Jack then took Inara and Marcus to [[Marsha Smith|Marsha's]] house where she welcomed them to stay with her. Knowing that Inara had started the fire when she was inside packing her bag, Jack told her to flush the matches she had, throw away the clothes she was wearing, and scrub herself in the shower. She thanked him for his help. ''(\"[[Dream a Little Dream of Me]]\")''\n\n===Living with Marsha and Growing Relationship with Jack===\nInara and Marcus continued to live with Marsha. Jack came by after his shift and spent time with Marsha, Inara, and Marcus, who taught him facts about dinosaurs. ''(\"[[Louder Than a Bomb]]\")''\n\nDuring the Covid-19 pandemic, Jack delivered groceries and supplies to them. He was unable to come inside, but flirted with Inara from a distance as she stood in the doorway. ''(\"[[Nothing Seems the Same]]\")''\n\nInara made energy bars for the firefighters, which she sent to the station with Jack. While he claimed the others loved them, she knew that wasn't true as she'd tasted one herself. Later, when a loose tiger became trapped in the barn at the station, Jack FaceTimed Inara and Marcus so they could see the tiger. ''(\"[[Wild World]]\")''\n\nInara told Jack he didn't have to keep feeding them, but he said he wanted to. ''(\"[[We Are Family]]\")''\n\nOne day, while Inara was at work, Marsha collapsed, so Marcus texted Jack, who brought the aid car to pick her up. She was struggling to breath, so they took both her and Marcus to Grey Sloan. She was immediately tested and taken to the COVID unit. Jack and Marcus were also tested immediately and Inara was tested later. Marsha's test came back positive, but the other three tested negative. Jack was upset because Marsha had continuously refused to wear her mask. When Inara got home from work, she was worried that Marsha would die and they'd have to find another place to live. Jack offered to stay in the apartment with them until Marsha was able to come home, to keep them safe from Ted. He ended up sleeping on the couch, while Marcus slept on the floor next to him. ''(\"[[Don't Look Back in Anger]]\")''\n\nAfter some time in the hospital, Marsha started feeling better. She video called Inara, Jack, and Marcus asking for gossip and Inara and Jack were surprised to learn that Marcus already knew the two of them had hooked up and both he and Marsha were happy about it. Later, when Jack came home and asked Inara officially to be his girlfriend, Marcus and Marsha both celebrated. ''(\"[[Learning to Fly]]\")''\n\nMarsha's condition continued to improve until she was finally told she'd be able to go home the next day. Jack took the day off and he, Marcus, and Inara planned to come to the hospital to pick her up. However, as they were getting ready to leave, Jack got a call from Emmett telling them not to come as Marsha had taken a turn and they expected her to need to go on a ventilator later that day. Jack hadn't gotten a call as her son was her emergency contact. They were all heartbroken that they wouldn't be able to bring her home, so Maya brought the ladder truck to the hospital and Jack climbed up with Marcus and they held a sign outside Marsha's hospital window telling her to get better soon so Marcus could beat her at Parcheesi. ''(\"[[Make No Mistake, He's Mine]]\")''\n\nInara called Jack when Marcus panicked after seeing a fire truck drive by. He was worried that something would happen to Jack while he was at work. At the advice of Theo Ruiz, whose own father was a firefighter who died in the line of duty, Jack took Marcus on a tour of the station over the phone and explained to him that most of the job wasn't very dangerous at all. This helped reassure Marcus that Jack wasn't going anywhere. ''(\"[[No One is Alone]]\")''\n\nWith Marsha on a ventilator, her son eventually stepped in and used his power of attorney to have them remove it. When the time came, Jack, Inara, and Marcus did a video call with the hospital. Her son was also on the call, but left as soon as the process was initiated. Levi explained to them that there would probably be shallowing of her breathing and it could take minutes or hours. They stayed on the call and talked to her as she breathed. Hours later, while Jack was sharing a memory of Marsha getting a pet bird to talk to, they were surprised to hear Marsha laughing. She had woken up and was breathing well enough on her own. All the firefighters celebrated along with Inara, Jack, and Marcus. ''(\"[[Save Yourself]]\")''\n\nWhen Marsha improved enough to come home, Inara and Jack got her set up on the couch with everything she needed before they went to work for the day. ''(\"[[Here It Comes Again]]\")''\n\nAs Marsha progressed in her recovery, she offered to take Marcus to the park to work on an egg-drop project for school, giving Jack and Inara their first real alone time as a couple. They started to kiss some time after Marsha and Marcus left, but were interrupted when [[Sonia]] fell past their window into the dumpster. They rushed downstairs to help her. While Jack was talking to Sonia, keeping her calm, Inara was shocked to learn that Jack had slept with [[Eva Vasquez|a married woman]]. After Sonia was taken to the hospital, Jack and Inara returned to their alone time and had sex. ''(\"[[Comfortably Numb]]\")''\n\n===Maya and Carina's Wedding===\nWith the tension growing between her and Jack, Inara decided to take Marcus and move to California to live with her sister. She'd previously been unable to as Ted knew where the sister lived, but the sister had moved and Ted had gone to New York with a new woman, making Inara believe it was safe. Before she left, she attended Maya and Carina's Wedding with Jack. At the wedding, Inara stopped Jack when he started to say something. She was insistent that she was going to take Marcus and move and that Jack would stay in Seattle with Marsha. She knew that Jack wasn't in love with her, but rather with their family unit and didn't want Marcus to continue to get attached. ''(\"[[Forever and Ever, Amen]]\")''\n\n==Relationships==\n===Romantic===\n====[[Ted]]====\nShe is divorced from [[Ted]]. Because he was abusive, she lives in fear that he'll find her.\n\n====[[Jack Gibson]]====\nShe developed a relationship with Jack after Jack helped her escape her abusive husband and set her up to live with Marsha. Their relationship grew until one day, while Marsha was in the hospital with COVID and Marcus was asleep, they kissed and then had sex. Jack tried to talk to her about it afterward, but she said she felt good and didn't want to lose that good feeling, so she asked him to wait. ''(\"[[Out of Control]]\")''\n\n===Familial===\nShe has one son, Marcus. She also has a sister who lives in California, whom she went to live with after she deemed it safe to do so without Ted finding her. ''(\"[[Forever and Ever, Amen]]\")''\n\n==Notes and Trivia==\n*She lived at 6912 Bryn Mawr Court.<ref>[[Dream a Little Dream of Me]], 3x13 (S19)</ref>\n*She knows American Sign Language.<ref>[[Dream a Little Dream of Me]], 3x13 (S19)</ref>\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" crop=\"true\" hideaddbutton=\"true\">\nS193x13Inara.png|[[Dream a Little Dream of Me]]\nS193x16Inara.png|[[Louder Than a Bomb]]\nS194x01Inara.png|[[Nothing Seems the Same]]\nS194x02Inara.png|[[Wild World]]\nS194x03Inara.png|[[We Are Family]]\nS194x04Inara.png|[[Don't Look Back in Anger]]\nS194x05Inara.png|[[Out of Control]]\nS194x07Inara.png|[[Learning to Fly]]\nS194x08Inara.png|[[Make No Mistake, He's Mine]]\nS194x09Inara.png|[[No One is Alone]]\nS194x10Inara.png|[[Save Yourself]]\nS194x11Inara.png|[[Here It Comes Again]]\nS194x14Inara.png|[[Comfortably Numb]]\nS194x16Inara.png|[[Forever and Ever, Amen]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS194x04-11.jpg\nS194x04-12.jpg\nS194x04-13.jpg\nS194x04-15.jpg\nS194x04-26.jpg\nS194x04-27.jpg\nS194x14-1.jpg\nS194x14-2.jpg\nS194x14-3.jpg\nS194x14-4.jpg\nS194x14-5.jpg\nS194x14-7.jpg\nS194x14-8.jpg\nS194x14-10.jpg\nS194x14-11.jpg\nS194x14-12.jpg\nS194x14-13.jpg\nS194x14-14.jpg\nS194x14-15.jpg\nS194x14-16.jpg\nS194x14-17.jpg\nS194x16-7.jpg\nS194x16-8.jpg\nS194x16-13.jpg\nS194x16-22.jpg\nS194x16-23.jpg\nS194x16-24.jpg\nS194x16-28.jpg\nS194x16-35.jpg\n</gallery>\n\n==Appearances==\n{{Inara Appearances}}\n\n{{Scrollbox}}\n\n[[de:Inara]]\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S3 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}