{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"74279": {"pageid": 74279, "ns": 0, "title": "Incident Commander Nalley", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Firefighter Infobox\n|image = S192x17IncidentCommanderNalley.png\n|name = Incident Commander Nalley\n|status = Alive\n|job = Firefighter\n|workplace = California Department of Forestry and Fire Protection\n|only appearance = [[Into the Wildfire]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 2 (Station 19)|2]]\n|portrayed by = [[Joe Nieves]]\n}}\n\n'''Incident Commander Nalley''' is the firefighter in charge of sending teams out to fight the Los Angeles wildfire.\n\n==History==\nStation 19 brought supplies and drove down to Los Angeles to help fight an out of control wildfire. When they arrived, they met Nalley, who told them their turnouts were useless there and so were their oxygen tanks, because the fire was too hot to use either. He then assigned them a neighborhood, where their job was to clear brush and secure houses to minimize the damage. However, when the wind shifted and put them in danger, Nalley said it was too dangerous to send anyone else in after them. [[Dylan (Into the Wildfire)|Dylan]] then said he knew of a side road, a hiking path wide enough for them to get out. They were able to get a call through to station 19 when radio communication went down and they used his directions to get station 19 out of the neighborhood to safety.\n\n==Career==\nHe is a firefighter with California Department of Forestry and Fire Protection.\n\n{{DEFAULTSORT:Nalley, Incident Commander}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S2 Characters]]\n[[Category:Firefighters]]"}]}}}}