{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"83542": {"pageid": 83542, "ns": 0, "title": "Ingrid Saunders", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S195x06IngridSaunders.png\n|name = Ingrid Saunders\n|status = Alive\n|marital = Scott Saunders † ''(husband)''\n|job = Shop owner\n|workplace = Ingrid's By the Sea\n|first appearance = [[Too Darn Hot]]\n|last appearance = [[Little Girl Blue]]\n|count = 4\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[Lindsey Gort]]\n}}\n\n'''Ingrid Saunders''' is a woman who was rescued by station 19.\n\n==History==\nIngrid was working at her shop on Seaway when there was a fire. Station 19 responded and Ben moved Ingrid to safety.\n\nLater, during the heat wave, when station 19 was open to the neighborhood to treat minor ailments, Ingrid came to the station to thank Ben specifically for getting her out of the building. He told her it was just part of the job. ''(\"[[Too Darn Hot]]\")''\n\nWhen she was preparing to rebuild her store, Ingrid brought her plans to station 19 and asked Ben to look over them, as she didn't want a repeat of what happened before. ''(\"[[100% or Nothing]]\")''\n\nIngrid later stopped back in to see about the plans. Ben admitted he hadn't had a chance to look at them. Ingrid said she'd been smelling burned plastic, but she thought it might just be in her head. Jack asked if she'd had any therapy following the fire. She said she hadn't. Jack said it could help as being in a fire was a trauma, even if you hadn't lost anyone. Ingrid then said she had actually lost her husband, about a year before the fire. Ingrid then left the station quickly. ''(\"[[Things We Lost in the Fire (Station 19)|Things We Lost in the Fire]]\")''\n\n===Thanksgiving===\nOn Thanksgiving Day, Ingrid called emergency services because she thought she smelled gas in her store. Ben and Sullivan responded and said there was no trace of gas anywhere in her store. Ben was sympathetic to her grief, so he invited her to the station's Thanksgiving dinner. She accepted the invitation.\n\nIngrid arrived at the station with a pie and was shocked to learn Ben is married. She tried to leave, but Ben insisted that she stay. Ingrid ended up upstairs on the roof, where she admitted to Ben that she was embarrassed because she felt there was something between them. Ingrid spoke about her husband's death and then climbed over the side of the roof. When Ben pointed out that a fall from the building was unlikely to kill her, she said she'd still enjoy the hospital stay, because she'd be around people who were taking care of her. And if she was lucky, she might hit her head instead. Ben talked to Ingrid about her grief and his own grief and was able to persuade her to step back onto the roof. He then had someone take her to Grey Sloan to be evaluated and get help. ''(\"[[Little Girl Blue]]\")''\n\n==Relationships==\n===Romantic===\nShe was married to a man named Scott for ten years until he died of carbon monoxide poisoning in his sleep while she was out of town. ''(\"[[Things We Lost in the Fire (Station 19)|Things We Lost in the Fire]]\")''\n\n==Career==\nShe runs her own business called Ingrid's By the Sea, a coffee, tea and pottery shop on Seaway.\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\nS195x03IngridSaunders.png|[[Too Darn Hot]]\nS195x04IngridSaunders.png|[[100% or Nothing]]\nS195x05IngridSaunders.png|[[Things We Lost in the Fire (Station 19)|Things We Lost in the Fire]]\nS195x06IngridSaunders.png|[[Little Girl Blue]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS195x06-13.jpg\nS195x06-14.jpg\n</gallery>\n\n==Appearances==\n{{Ingrid Saunders Appearances}}\n\n{{DEFAULTSORT:Saunders, Ingrid}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}