{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50775": {"pageid": 50775, "ns": 0, "title": "Irwin", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP322Irwin.png\n|name = Irwin\n|alias = The Weasel\n|status = Alive\n|marital = [[Claire (Private Practice)|Claire]] ''(wife)''\n|only appearance = [[In the Name of Love]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Timothy Bottoms]]\n}}\n'''Irwin''' is the husband of [[Claire (Private Practice)|Claire]].\n\n==History==\nIrwin's wife, Claire, came into the practice with him. She'd seen Violet previously and had always been very angry, so Violet was shocked to see her happy and very loving toward Irwin. She said that she was feeling better, doing charity work, and wasn't angry anymore. Irwin was concerned because of the drastic personality change. Claire said that she had found God and that's why she wasn't angry anymore.\n\nAmelia consulted and ran tests on Claire, which revealed a large tumor in her frontal lobe. It caused the personality change.\n\nClaire was disbelieving when Amelia told her she had a brain tumor. She insisted that it was God. Amelia warned her that the tumor was slow-growing, but would kill her if she didn't have it removed. She decided that if dying was God's plan, she'd die.\n\nAmelia stopped her from leaving. She talked about her history of drug abuse and how it made her artificially happy, just like Claire's tumor, but almost killed her, just like Claire's tumor would. After hearing what Amelia said, Claire agreed to have the surgery.\n\nWhile Claire was in surgery, Violet talked to Irwin, who said that he loved Claire the way she was with the tumor and didn't know if he could love her if she went back to how she was before.\n\nAfter surgery, Claire woke up as angry as she was before. When Irwin left, she told Amelia she had nothing left and Amelia should have let her die happy. Violet talked to her, saying she didn't have to be alone. She offered other treatment options to try to deal with her anger.\n\n==Relationships==\n===Romantic===\nHe is married to [[Claire (Private Practice)|Claire]].\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]"}]}}}}