{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"84781": {"pageid": 84781, "ns": 0, "title": "Ivan", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = 18x13Ivan.png\n|name = Ivan\n|status = Alive\n|diagnosis = *Abdominal crush injuries\n*Ruptured diaphragm\n*Liver laceration\n*DIC\n*Displaced humerus fracture\n|doctors = *[[Miranda Bailey]]\n*[[Richard Webber]]\n*[[Atticus Lincoln]]\n*[[Winston Ndugu]]\n*[[Amelia Shepherd]]\n*[[Taryn Helm]]\n*[[Jordan Wright (Character)|Jordan Wright]]\n|treatment = Surgery\n|job = Second grade teacher\n|only appearance = [[Put the Squeeze On Me]]\n|seasons = '''[[Grey's Anatomy|GA]]:''' [[Season 18 (Grey's Anatomy)|18]]\n|portrayed by = [[Gabe Fonseca (Actor)|Gabe Fonseca]]\n}}\n\n'''Ivan''' is a man who came into the ER with a python wrapped around his body.\n\n==History==\nIvan was feeding his Burmese python, Gigi, when she bit his arm instead of her food. Then she wrapped her body around his and began constricting. Ivan's boyfriend, [[Clark (Put the Squeeze On Me)|Clark]], put him in the back of the car and drove him to the hospital. Once they arrived, several doctors came out to assess Ivan. Ivan kept insisting that it looked worse than it was and that Gigi hadn't meant any harm. When Animal Control was delayed, Winston had the idea to spray Gigi with alcohol, which would irritate her eyes and get her to release her jaw so they could free him. Bailey did that and then Winston, Jordan, and Link unwrapped Gigi from Ivan's body. Then they got him onto a gurney and took him inside.\n\nIn the ER, he had reduced oxygen and a chest x-ray showed opacity in his chest. Richard believed it was a hemothorax and wanted to insert a chest tube, but Bailey said no and insisted on a CT, which showed that Ivan actually had a diaphragmatic rupture and the opacity was his abdominal organs, which had been compressed into his chest cavity. They took him into surgery, where they moved his organs back into his abdomen. When he started coding and went into DIC, they were forced to stop the surgery, pack him, and move him to the ICU.\n\nOn the way to the ICU, he coded again, and Bailey did chest compressions until they got him into his room, where they defibrillated. They were able to stabilize him enough that his boyfriend was able to sit with him. The hope was that they could continue his surgery the next day.\n\n==Relationships==\n===Romantic===\nHe is dating [[Clark (Put the Squeeze On Me)|Clark]].\n\n==Career==\nHe is a second grade teacher. He initially purchased Gigi for his class, but had to take her home when she got too big.\n\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S18 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Cardio)]]\n[[Category:Patients (ER)]]\n[[Category:Patients (General)]]\n[[Category:Patients (Neuro)]]\n[[Category:Patients (Ortho)]]\n[[Category:Patients (Trauma)]]"}]}}}}