{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"86245": {"pageid": 86245, "ns": 0, "title": "Ivy (Season 6)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S196x02Ivy.png\n|name = Ivy\n|status = Alive\n|marital = [[Gerald]] ''(husband)''\n|children = At least one child\n|grandchildren = Grandson\n|only appearance = [[Everybody's Got Something to Hide Except Me and My Monkey]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 6 (Station 19)|6]]\n|portrayed by = [[Diana Tanaka]]\n}}\n\n'''Ivy''' is a woman whose apartment complex caught on fire.\n\n==History==\nIvy and her husband, Gerald, were at home when their apartment complex caught on fire. Because Gerald uses a walker, they were unable to evacuate themselves. When firefighters arrived, they assisted Gerald out of the building and pushed Ivy to walk herself out, stopping her from continuing to grab things, though she did bring out their wedding album. Once they were outside at triage, Ben and Travis gave them both oxygen masks and called for an aid car to take Gerald to the hospital. While they waited, Gerald went into cardiac arrest. They were able to restore sinus rhythm with CPR and then defibrillation. Ivy and Gerald were then put into an aid car so Gerald could be treated at the hospital. On the way, Ivy asked the firefighters about their lives and learned that Travis was running for mayor and that he was also single and gay. Ivy wrote down his name and then also wrote down her grandson's number for him.\n\n==Relationships==\n===Romantic===\nShe is married to [[Gerald]]. They have lived in the same apartment for 40 years.\n\n===Familial===\nShe and her husband have at least one child and at least one grandson, who is gay. When she learned Travis was gay and single, she wrote down her grandson's number for him.\n\n{{DISPLAYTITLE:Ivy}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S6 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}