{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"80739": {"pageid": 80739, "ns": 0, "title": "Izzy Packing", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S194x03IzzyPacking.png\n|name = Izzy Packing Arnett\n|status = Alive\n|grandparents = Grandmother †\n|job = *Drag Queen\n*Volunteer Firefighter\n|workplace = [[Seattle Fire Department]] Station 7\n|only appearance = [[We Are Family]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 4 (Station 19)|4]]\n|portrayed by = [[Roxy Wood]]\n}}\n\n'''Izzy Packing''' is a drag queen whose apartment caught on fire due to faulty wiring.\n\n==History==\nIzzy Packing and fellow queens [[Rainbow Trout]], [[Elizabeth Gaylor]], and [[Ruby Red Slippers]] lived together in apartment building owned by a landlord they referred to as a slumlord. One day, a smoke smell overwhelmed the building, leading to one of their neighbors calling the fire department. Rainbow Trout let the firefighters into the building, where they cut the power so they could find the source of the smell before it started a fire. The firefighters ended up tracing the smell to a room in the queens' apartment. The firefighters started an evacuation, warning them that there was about to be a fire in their apartment. Ruby got out, but Izzy, Elizabeth, and Rainbow went back in for their valuables, delaying their exit. On their way out, Rainbow fell and hurt her ankle. She couldn't walk, so Izzy picked her up and carried her downstairs and out of the building. Elizabeth, meanwhile, had stopped to take a xanax and ignored firefighter instructions to go back inside after Big Red, Izzy's beloved wig. She opened a door, which caused a smoke explosion, throwing all three of them back.\n\nWhen Jack woke, he picked up Elizabeth and carried her outside, where her sisters swarmed her. She was given oxygen and taken to the hospital. Izzy rode with her in the aid car and explained to Travis that the wig had come from her meemaw, who had accepted her when she came out. Despite that, she'd let that wig burn up a million times to make sure her sisters were safe, as they'd been the ones to pick her up when her meemaw died.\n\n==Relationships==\n===Familial===\nShe came out to her meemaw at the age of twelve only to be told her meemaw already knew and loved her anyway. Her meemaw gave her her favorite performance wig, \"Big Red,\" which became Izzy's favorite. She was upset when Big Red was destroyed in the fire, but said she'd let it burn a million times to make sure her sisters were safe.\n\n===Friendships===\nShe is very close with [[Rainbow Trout]], [[Elizabeth Gaylor]], and [[Ruby Red Slippers]]. She says they picked her back up when her meemaw died and taught her how to be a queen and be part of a community.\n\n==Career==\nShe is a prominent drag queen in Seattle. With the COVID-19 pandemic, she and her fellow queens were forced to start streaming their performances on the internet. Together, they call themselves the Queen Anne Queens. She is also a volunteer firefighter with SFD Station 7.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS194x03-12.jpg\n</gallery>\n\n{{DEFAULTSORT:Packing, Izzy}}\n\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S4 Characters]]\n[[Category:Firefighters]]\n[[Category:S19 Rescuees]]"}]}}}}