{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"51191": {"pageid": 51191, "ns": 0, "title": "Jack", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x15-16.jpg\n|name = Jack\n|status = Alive\n|marital = [[Lara]] ''(fiancée)''\n|only appearance = [[Two Steps Back]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Matt Roth]]\n}}\n\n'''Jack''' is the fiancé of [[Lara]].\n\n==History==\nJack's fiancée, Lara, brought her sister, [[Andi]], to the practice. She said they were cooking dinner when Andi responded as one of her \"others\", Gina. She'd been diagnosed with multiple personality disorder at the age of seven after a car accident that killed their parents. Lara said it took a lot of therapy to get that under control, but she hadn't seen another personality in nearly ten years, so she was concerned that they were coming back.\n\nAndi then talked to Sheldon herself, believing her sister was worrying too much. When Sheldon started to talk to Andi about what her sister had said, Gina replied, telling him angrily to back off. Sheldon said it was very convincing.\n\nSheldon talked to Lara and Jack about Andi. Jack said he'd known Andi almost as long as he'd known Lara and he was suspicious because he hadn't seen any of her others before then, a week before they were set to move to Arizona. Lara said she couldn't leave Andi and Jack said he wouldn't go without her.\n\nSheldon called Andi back in and did art therapy with her, something her previous shrink liked to do a lot. While she colored, he talked to her about Jack. She said she was okay with the moving. She drew a picture of Jack and then suddenly became more aggressive in her drawing. When Sheldon asked her about it, she said she was Maggie, who said they don't care about Andi and asked how Lara could just walk out on her like that. Maggie said that she didn't like Jack because she was taking Lara away. Maggie then asked if she could draw, too. She used crayons and began to draw a childlike picture.\n\nSheldon was then convinced that it was real, because the pictures were completely different art styles and drawn with different hands.\n\nSheldon talked to all three of them together. Jack still believed Andi was manipulating them. Jack said that Andi was jealous of him and the time Lara spent with him. Gina then spoke and said he hated Jack. Sheldon then figured out that Andi was faking it, because Maggie had told him she hated Jack, not Gina. Andi then said she loved Jack and didn't want Lara to take him away from her.\n\nAndi told Sheldon that it felt like it was her and Lara against the world and Jack was the first person to understand that. She was jealous of Lara for having him. She apologized for wasting Sheldon's time and he said that if she wanted, they could start over. Lara then came in and said she was mad at Andi, but Andi's her sister and she still loved her, so they needed to figure it out so Andi could stay in their lives, hers and Jack's.\n\n==Relationships==\n===Romantic===\nHe is engaged to [[Lara]].\n\n==Career==\nHe was promoted to manage a new plant in Arizona, requiring a move.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP4x15-2.jpg\nPP4x15-3.jpg\nPP4x15-5.jpg\nPP4x15-11.jpg\nPP4x15-12.jpg\nPP4x15-13.jpg\nPP4x15-16.jpg\n</gallery>\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]"}]}}}}