{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50942": {"pageid": 50942, "ns": 0, "title": "Jackie", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x04Jackie.png\n|name = Jackie\n|status = Alive\n|marital = Husband †\n|children = [[Kenny]]\n|only appearance = [[A Better Place to Be]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Romy Rosemont]]\n}}\n'''Jackie''' is the mother of [[Kenny]].\n\n==History==\nJackie's son, Kenny, came into the practice with a stomachache. When he refused to poop in a cup to have tests run, Cooper suggested he just tell the truth. He knew Kenny was faking a stomachache to get out of school. He admitted he was being bullied because he likes anime. His dad had gotten him into it, but his dad was dead. Kenny just wanted to get out of school, but Cooper said he couldn't hide forever, so he should find the other kids who like anime. Jackie then came in and Cooper suggested she keep him home for the rest of the day.\n\nKenny and Jackie came back into the practice and Jackie was upset because Kenny had taken a knife to school. As they left, Sheldon stopped them and asked to talk to Jackie. He offered his services to help Kenny.\n\nKenny talked to Sheldon and they bonded over anime. He admitted that the kids had kicked him until he took off his anime shirt. He said he didn't want acceptance. He just wanted to stay at the school long enough to find other kids like him. He'd changed schools six times in two years.\n\nKenny used anime as a way to escape to a world where his dad was still alive. And his mother constantly pulling him out of schools to protect him prevented him from developing coping skills.\n\nThey went to Kenny's house to talk to Jackie. They explained that she needed to stop pulling him out of school. She said that he came home and cried every day. It drove her crazy. She said that her son was a wimp, not knowing that Kenny was listening in.\n\nKenny later came into the ER after trying to kill himself by stabbing himself. Jackie blamed herself. When Kenny woke up, they told him suicide was not the answer and that he needs to stick around to see things get great. He told his mom he didn't want to switch schools. He wanted to have a chance at his current school and he agreed to keep seeing Sheldon.\n\n==Relationships==\n===Romantic===\nShe was married until her husband died.\n\n===Familial===\nShe believes her son is a wimp and moved him from school to school to keep him away from bullies.\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]"}]}}}}