{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50964": {"pageid": 50964, "ns": 0, "title": "Jacob Deever", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP4x06JacobDeever.png\n|name = Jacob Deever\n|status = Alive\n|diagnosis = *Facial lacerations\n*Bruised arm\n*HIV\n|doctors = *[[Pete Wilder]]\n*[[Charlotte King]]\n*[[Violet Turner]]\n|treatment = \n|marital = [[Angela Deever]] ''(wife, separated)''\n|only appearance = [[All in the Family]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]]\n|portrayed by = [[Rockmond Dunbar]]\n}}\n'''Jacob Deever''' is a man who was in a car accident with his boyfriend, a prostitute.\n\n==History==\nJacob came into the hospital after a minor car accident. The other guy in the car, [[Evan Arnold]], had more serious injuries. Jacob tried to leave without being examined, but the police stopped him. Evan was a prostitute, which is why Jacob tried leaving.\n\nWhen Pete saw Jacob at the practice later, he found out he was married and his wife had had bladder reconstruction to have a baby. He met Jacob outside the hospital and talked to him. Jacob claimed not to know that Evan was a prostitute.\n\nCharlotte tested Jacob's blood and found out he had HIV, though Angela was negative. Pete brought him back in and told him he had HIV. He said it was only one time, but Pete said he couldn't already be HIV+ from the time in the car with Evan. They talked to him and convinced him that he couldn't keep living the lie.\n\nThey called Jacob, Evan, and Angela all in and Jacob tried to tell Angela. She said she already knew and loved and accepted him. However, when she found out he'd exposed her to HIV, she slapped him and left.\n\n==Relationships==\n===Romantic===\n====[[Angela Deever]]====\nHe was married to [[Angela Deever]] for almost 20 years.\n\n====[[Evan Arnold]]====\nHe started seeing Evan, a male prostitute. However, their relationship developed beyond prostitution.\n\n==Notes and Trivia==\n*He was 43 at the time of his accident.\n\n{{DEFAULTSORT:Deever, Jacob}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]\n[[Category:Patients]]\n[[Category:Patients (ER)]]\n[[Category:Patients (Trauma)]]"}]}}}}