{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"84697": {"pageid": 84697, "ns": 0, "title": "Jae-Jin Park", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Rescuee Infobox\n|image = S195x12JaeJinPark.png\n|name = Jae-Jin Park\n|status = Alive\n|marital = Wife\n|children = [[Justin Park]]\n|only appearance = [[In My Tree]]\n|seasons = '''[[Station 19|S19]]:''' [[Season 5 (Station 19)|5]]\n|portrayed by = [[David Young Lee]]\n}}\n\n'''Jae-Jin Park''' is a man who came into the clinic on the first day it was open.\n\n==History==\nJae-Jin came into the clinic on the first day it was open. He only spoke Korean and struggled to communicate with Travis, whose Korean was limited. Travis tried using an app on his phone, but it didn't work well enough for him to understand what was troubling Jae-Jin. [[Natasha Ross|Chief Ross]] overheard this conversation and stepped in, asking him in Korean about his symptoms and translating for Travis that he had unexpected weight loss, fatigue, and swelling in his legs. She recognized the symptoms from when her own father had stage four cancer, so she and Travis discussed what they would do next. Before they could decide, Jae-Jin's son came in. They told him they believed his father needed to go to the hospital, but he told them he already knew his father had stage four cancer, but it was inoperable, so they hadn't told him, because they knew he would hide from them to avoid feeling like a burden and they wanted to go on trips and enjoy the time they had left with him. He then left with his father, telling him that they told him he just needed to get outside more.\n\n==Relationships==\n===Romantic===\nHe is married.\n\n===Familial===\nHe has a son, [[Justin Park|Justin]], who didn't tell him when he was diagnosed with cancer because he knew his father would feel like a burden.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nS195x12-15.jpg\nS195x12-20.jpg\nS195x12-21.jpg\nS195x12-26.jpg\nS195x12-44.jpg\n</gallery>\n\n{{DEFAULTSORT:Park, Jae-Jin}}\n[[Category:Characters]]\n[[Category:S19 Characters]]\n[[Category:S19 S5 Characters]]\n[[Category:S19 Rescuees]]"}]}}}}