{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"6914": {"pageid": 6914, "ns": 0, "title": "Jake Reilly", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Attending Infobox\n|image = PP6x03-9.jpg\n|name = Jacob Miguel Reilly\n|status = Alive\n|alias = *Pineapple Guy\n*Fiji Guy\n*Prince Charming\n*Zeus\n*Thor\n*Beckham\n|title = M.D., [[Fellow of the American College of Obstetricians and Gynecologists|F.A.C.O.G.]]\n|marital = *[[Lily Reilly]] † ''(wife)''\n*[[Addison Forbes Montgomery]] ''(wife)''\n|children = *[[Angela Reilly]]\n*[[Henry Montgomery]]\n|siblings = Three sisters\n|parents = *Father\n*Mother †\n|other family = *[[Bizzy Forbes]] † ''(mother-in-law)''\n*[[\"The Captain\" Montgomery]] ''(father-in-law)''\n*[[Archer Montgomery]] ''(brother in-law)''\n|job = *[[Attending]] [[Reproductive Endocrinology and Infertility|Reproductive Endocrinologist and Infertility Specialist]]\n*[[Attending]] [[Obstetrics and Gynecology|OB/GYN]]\n*[[Attending]] [[General Surgery|General Surgeon]]\n|workplace = '''Current'''<br>[[Seaside Health and Wellness]]<br>\n'''Former'''<br>[[Johns Hopkins Hospital]]<br>\n|first appearance = [[...To Change the Things I Can]]\n|last appearance = [[In Which We Say Goodbye]]\n|count = 36\n|seasons = '''[[Private Practice|PP]]:''' [[Season 4 (Private Practice)|4]], [[Season 5 (Private Practice)|5]], and [[Season 6 (Private Practice)|6]]\n|portrayed by = [[Benjamin Bratt]]\n}}\n{{Quote|Look, everything you were saying before. You’re feeling it because this is right. You and me together is.. right. And I’m not gonna let you run away because you’re scared, I told you before I stay and fight. And I fought for a year to be with you and that was hard because I like Sam, a lot. But, I knew the moment I met you, in that grocery, and then when you randomly appear on my exam table I knew again. And If I had to wait that was just what I was going to do. And so, I joined the practice, and waited, and waited, and waited. But I’m not gonna wait anymore because this is our time. We’re supposed to be together. You and me. And I’m in love with you too, though I actually said it. |'''[[Jake Reilly]]''' to '''[[Addison Forbes Montgomery]]'''}}\n\n'''Jake Reilly''' is the [[Reproductive Endocrinology and Infertility|reproductive endocrinologist and infertility specialist]] at [[Seaside Health and Wellness]] and the husband of [[Addison Forbes Montgomery]]. Like his wife, Jake also has a double-specialty, practicing [[General Surgery|general surgery]].\n\n==History==\n===Early Life===\nJake grew up with three younger sisters. Their dad left when he was 9 years old and their mother died when he was 18. College had to wait, as he didn't want to split up his family. He worked three jobs and eventually got a free ride to college, and afterwards put himself through med school. There have been many women in his life, but his first real love was Lily.\n\n===Marriage to Lily Reilly===\nBefore coming to Los Angeles, Jake was married to [[Lily Reilly]], a drug addict, who had a 8 year old daughter, [[Angela Reilly|Angela]]. After he met her, he soon adopted her daughter. One evening, Lily's drug dealer came to their home. Jake couldn't get rid of him, so he severely beat up the dealer. As a result, the police stepped in and Jake was arrested. His prints were taken and put into the system.\n\nJake frequently spent long hours at his office in order to unconsciously avoid Lily's drug addiction. Working was his way of escaping.\n\nLily died of an overdose and Jake was left alone to take care of Angela, whom he considers to be his own daughter.\n\n===Meeting Addison===\nHe and Addison first met in the supermarket and flirted over pineapples. When they met again, they agreed to go on a date, but decided not to tell each other about who they were in order to make it more exciting. They kissed and flirted and he asked her to come to Fiji with him as a very long date, but standing in the airport after saying goodbye to Naomi, she decided not to go. However, Jake himself didn't go either because of a medical emergency.\n\nSoon after, they found out about their identities when he ended up being her fertility doctor.\n\n===Joining the Practice===\nJake joined the practice to fill the hole left by Naomi. Initially, he felt like an outsider of the practice family. He was happy with that, as he found them to be sharing way too much with each other, but he gradually became part of the family as well.\n===Falling in Love with Addison===\n\n===Marriage to Addison===\nAddison proposed to Jake but he didn't say yes. She was embarrassed and hid out in the bathroom. Jake later talked to a hallucination of his dead wife [[Lily Reilly]], who understood he was old school and thought he was the one who had to propose. Lily convinced him that Jake could move on from her as their vows were till death. Jake then set up a romantic scene at Addison's house and asked her to propose again. She did and he accepted.<ref>[[The World According to Jake]], 6x07 (PP)</ref>\n\n===COVID-19 Pandemic===\nDuring the pandemic, he took interest in model trains.<ref>[[With a Little Help From My Friends]], 18x04</ref>\n\n==Personality==\nJake is a doctor who is incredibly devoted to his patients. He's willing to spend his personal time with patients if that's what they require. He also tries not to judge about what his patients ask for, as he just considers it his job to make it happen if he can.\n\nHe describes himself as patient and understanding. There is however, a limit to his patience, as demonstrated when Addison wouldn't open up to him about [[Mark Sloan]]. \n\n==Relationships==\n===Romantic===\n====[[Lily Reilly]]====\nAt some point in his life, Jake met Lily Reilly. They married and he adopted her 8 year old daughter. However, Lily was a drug addict. Even so, Jake loved her and always hoped that she would choose him over drugs. He once found her on the floor of the bathroom, where she had overdosed on drugs. He performed CPR on her until the paramedics arrived. She died of an overdose.\n\nBefore Jake married Addison, he occasionally talked to Lily, who had already died, asking for advice about Angela. Eventually, her spirit left him, saying he no longer needed her because Addison loves him and makes him happy.<ref>[[The World According to Jake]], 6x07 (PP)</ref>\n\n====[[Addison Forbes Montgomery]]====\nWhen Addison's therapist told her to make a change in her life, she met Jake and they flirted over pineapples at the grocery store. They started seeing each other at a coffee shop. However, they both agreed to keep their identities in secret. Jake was going on vacation to Fiji and he asked Addison to come with him. She eventually accepted, but when at the airport, she realized it wasn't right to try to avoid Sam and the problems the practice was suffering.\n\n[[File:PP6x13-9.jpg|thumb|left|Jake and Addison at their wedding.]]\nLater on, Addison started her fertility treatment only to find out that her doctor was Jake. He admitted he never left for Fiji. Flustered and embarrassed, she left his office.\n\nAddison was extremely startled when she saw that Jake had applied for the fertility specialist opening at Oceanside Wellness. She insisted that there was something wrong with him as a doctor, but he was the perfect candidate, so he was hired.\n\nLater, Addison decided to start fertility treatments again, and Jake was her doctor. He conducted two rounds of IVF on her. When both rounds failed, he helped her attempt to find a suitable surrogate.\n\nAfter Addison broke up with Sam for good, Jake told Addison that she wasn't ready for what he had to offer. He could love her, marry her, and make a baby with her, but she had to get ready. He couldn't have her pining after another man. Addison replied she could get ready.\n\nAfter Addison adopted Henry, Jake moved in with her to be Henry's loving father. A few weeks after, Addison proposed that they get married, startling him and prompting her to lock herself in the bathroom. He insisted he never said no. A few weeks later, Mildred interviewed Jake (a standard procedure when adopting a child) where she found out about Jake's criminal history. Addison wasn't upset about this because she said that her, Jake, and Henry were all supposed to be together, and the judge would see that.\n\nWhen Addison proposed to him one evening, he was stunned. He replied that marriage was a big step, and he wanted the two of them to be ready. Addison was humiliated, and locked herself in the bathroom. Their relationship was tested when Addison accused him of spending too much time with his patients. He shot back that everything was always about her. Fortunately, they got through it after Addison defended Jake to one of his former patients, [[Megan Stewart]].\n\nJake proposed to Addison and they married after Henry's adoption was finalized. He stated to Addison that he knew she was \"the one\" when he invited her to Fiji and again when he saw her sitting on his exam table for the first time.\n\n===Familial===\nJake grew up as the oldest of four. He has three younger sisters. Their dad left when Jake was 9 years old, and their mother died when he was 18.\n\n====[[Henry Montgomery]]====\nJake is Henry's father. When Jake and Addison were dating, he acted like a father figure to Henry and had to meet [[Mildred Clemons]], the social worker, after he moved in with Addison to make sure he was a good figure in Henry's life. Addison, Jake, and Henry are all now a family.\n\n==Career==\nDr. Reilly graduated from [[Duke University School of Medicine]] and completed [[Resident|residencies]] in [[General Surgery|surgery]] and [[Obstetrics and Gynecology|OB/GYN]] at [[Johns Hopkins Hospital|Johns Hopkins]], as well as completing a [[Fellow|fellowship]] in [[Reproductive Endocrinology and Infertility|reproductive endocrinology and infertility]]. He is also [[Board Certification|double-board certified]] in [[Board Certification#American Board of Surgery|general surgery]] and [[Board Certification#Obstetrics and Gynecology|obstetrics and gynecology]]. He started to work at [[Seaside Health and Wellness]] after [[Naomi Bennett]] left the practice.\n\nBefore med school, Jake worked three jobs to pay for college: he was a bike courier, a short-order cook, and a bellman. At some point, he even sold his sperm.\n\n==Notes and Trivia==\n*He and Addison met while flirting over pineapples, which he hates.<ref>[[...To Change the Things I Can]], 4x22 (PP)</ref>\n*Before choosing fertility, he played around with idea of specializing in drug addictions.<ref>[[Who We Are]], 5x08 (PP)</ref>\n*When Jake is formally introduced, his lab coat shows, \"Jake Reilly, M.D., [[Fellow of the American College of Obstetricians and Gynecologists|F.A.C.O.G.]]\" with \"[[Reproductive Endocrinology and Infertility|Reproductive Endocrinology]]\" on the second line, embroidered in script font.\n*He and Sam played intramural basketball in college.\n*Jake is the best fertility doctor in the country, second only to [[Naomi Bennett|Naomi]].\n*At some point in his life, Jake sold sperm in order to get money to take care of his family and to go to college. Therefore, it's likely that he has biological children he doesn't know about.\n*During his interview at [[Seaside Health and Wellness]], [[Addison Forbes Montgomery|Addison]] specifically mentions he is [[Board Certification|board certified]] in [[General Surgery|general surgery]] and [[Obstetrics and Gynecology|OB/GYN]]; despite having completed a [[Fellow|fellowship]] in [[Reproductive Endocrinology and Infertility|REI]], subsequent episodes and promotional material for [[Private Practice]] has not stated him being board certified in REI: this cannot be assumed as there is an insufficient evidence by the show to support a board certification in REI.\n*He is a fan of Game of Thrones as he and his [[Henry Montgomery|son]] binged and subsequently argued over the show, much to the annoyance of his [[Addison Forbes Montgomery|wife]]. <ref>[[With a Little Help From My Friends]], 18x04 (GA)</ref>\n*During the Covid-19 Pandemic, He took up model railroading as a hobby.\n\n==Gallery==\n<gallery widths=\"150\" position=\"center\" orientation=\"landscape\" bordersize=\"none\" spacing=\"small\" hideaddbutton=\"true\">\nPP5x03JakeReilly.png\nPP5x22JakeReilly.png\nPP6x01JakeReilly.png\nPP6x13JakeReilly.png\n</gallery>\n\n{{GalleryLink}}\n\n==Notable Episodes==\nThese episodes are Jake-centric or otherwise very informative about his life.\n*[[Remember Me]]\n*[[Drifting Back]]\n*[[The World According to Jake]]\n*[[In Which We Say Goodbye]]\n\n==Memorable Quotes==\n:'''Jake:''' You're not ready for what I have to offer.\n:'''[[Addison Forbes Montgomery|Addison]]:''' I can get ready.\n:'''Jake:''' That would be nice.\n\n==Appearances==\n{{Jake Reilly Appearances}}\n{{Scrollbox}}\n\n[[de:Jake Reilly]]\n{{DEFAULTSORT:Reilly, Jake}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S4 Characters]]\n[[Category:PP S5 Characters]]\n[[Category:PP S6 Characters]]\n[[Category:Doctors]]"}]}}}}