{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"50281": {"pageid": 50281, "ns": 0, "title": "Jake (The Hard Part)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Patient Infobox\n|image = PP3x07-5.jpg\n|name = Jake\n|status = Alive\n|diagnosis = *Broken rib\n*Lacerated thigh\n*Internal bleeding\n*Collapsed lung\n|doctors = *[[Addison Forbes Montgomery]]\n*[[Sam Bennett]]\n|treatment = *Pressure dressing\n*Chest tube\n*Saline\n|marital = [[Kara (The Hard Part)|Kara]] † ''(wife)''\n|children = Daughter\n|only appearance = [[The Hard Part]]\n|seasons = '''[[Private Practice|PP]]:''' [[Season 3 (Private Practice)|3]]\n|portrayed by = [[Brennan Elliott]]\n}}\n\n'''Jake''' is a man who was injured in a car accident.\n\n==History==\nWhile hiking in a canyon, Addison and Sam heard Jake calling for help. He told them they'd crashed and his wife was out there as well. Addison went down to the car while Sam tended to Jake. Addison found Kara and saw that she was pregnant and stuck in the car door. She had lost feeling in her fingers and told Addison they'd been out there since the previous day. Her pregnancy was at term. She said she could feel the baby moving, but Addison couldn't get the right angle to get a fetal heartbeat.\n\nSam said Jake had a broken rib and internal bleeding. Sam said if he ran, he could get back by dark. Addison said she'd go back and forth between them while they waited for him to get back. Before Sam could leave, Jake's lung collapsed and he had to improvise a chest tube to relieve the pressure.\n\nAddison climbed in the car to examine Kara and she said that she was at fault for the accident, because she grabbed her husband's arm when a bee flew in the car. Addison found that Kara had a broken rib.\n\nSam brought Jake back down to the car, saying that his chest tube needed to be opened every 30 minutes or his heart would arrest. Same decided to try to find the road instead of going back the way he and Addison came. However, when Addison climbed back into the car, she and Kara rolled farther down the hill. Addison was injured in the second crash, which trapped her in the car with Kara. Because she was trapped, Sam said he couldn't leave because since Addison couldn't take care of the chest tube, Jake would die if she left.\n\nAfter nightfall, Kara's water broke. Addison examined her again and determined that the baby was a footling breech because of the second crash. She attempted to change the baby's position to make the delivery easier.\n\nSam sewed the tube in Jake's chest into place so that he could leave and get help. Addison told Sam Kara's labor was progressing quickly and advised him to stay safe because they needed him to be able to come back and bring help.\n\nWhen the baby's foot came through the cervix, Addison said she was going to try to push his foot back up the birth canal and change his position from the inside. Addison started to do it, but Kara said it was too painful. Jake gave her a pep talk and said she could do it. Addison was able to change the baby's position successfully. She then coached Kara through difficult delivery.\n\nThe baby didn't breathe right away, but Addison was able to stimulate and she started crying. After the birth, Jake stopped responding to them. Addison attempted again to get out of the car, but wasn't able to. However, they heard helicopters coming to find them. They put Jake in a sling and took him to the hospital. They gave the baby oxygen and got her out of there. Then they worked on prying the door open to get Kara and Addison out. However, as soon as they did, Kara started bleeding severely from her arm and she crashed. They tried everything they could, but Kara was dead in the car.\n\nAt the hospital, Addison brought the baby to Jake and Sam told him that Kara had died.\n\n==Relationships==\n===Romantic===\nHe was married to [[Kara (The Hard Part)|Kara]] until her death.\n\n==Notes and Trivia==\n*He wanted a home birth, which Kara said he could have if the baby came out of him.\n\n==Gallery==\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\nPP3x07-2.jpg\nPP3x07-5.jpg\n</gallery>\n\n{{DISPLAYTITLE:Jake}}\n[[Category:Characters]]\n[[Category:PP Characters]]\n[[Category:PP S3 Characters]]\n[[Category:Patients]]\n[[Category:Patients (Trauma)]]\n[[Category:Patients (Cardio)]]"}]}}}}