{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"84917": {"pageid": 84917, "ns": 0, "title": "Jamarah Blake", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Other Characters Infobox\n|image = 18x19-11.jpg\n|name = Jamarah Blake\n|status = Alive\n|workplace = Medical Accreditation Council\n|first appearance = [[Put It to the Test]]\n|last appearance = [[You Are the Blood]]\n|count = 3\n|seasons = '''[[Grey's Anatomy|GA]]:''' [[Season 18 (Grey's Anatomy)|18]]\n|portrayed by = [[Dawnn Lewis]]\n}}\n\n'''Jamarah Blake''' is an employee of the Medical Accreditation Council who came to Grey Sloan to investigate their residency program.\n\n==History==\nJamarah came to Grey Sloan with [[MaryAnn Suchan]] to investigate their residency program after receiving anonymous complaints. For this investigation, they interviewed the attendings about the program. They wanted to interview residents, but they were all on grand rounds with [[Nick Marsh]], except [[Levi Schmitt]], who had left the program. They noted that the program had lost seven surgeons in the last year as Bailey showed them around the hospital.\n\nOnce the tour was over, they began interviewing attendings, all of whom defended the program and its efficacy. They also interviewed [[Jo Wilson]], who spoke about her decision to change from surgery to obstetrics, but still defended the surgical residency program. After speaking to her, they asked to speak to Richard next. Bailey suggested they go take a break and she'd bring him to them. At the end of the day, they said that they had a top-quality program, but they simply didn't have enough surgeons to keep the program running. They put the program on probation and left Bailey a list of concrete steps she needed to take before their return in a few weeks, telling her if she didn't make the changes, the program would be shut down. ''(\"[[Put It to the Test]]\")''\n\nJamarah returned at a later date and was pleased that they'd corrected the issues she flagged. She came concerned, however, when she saw that many of the hospital's surgical residents were donating blood during their shifts. Bailey assured her it was strictly voluntary and only due to the nationwide blood shortage. Jamarah then observed from the gallery while Meredith and Nick attempted to remove [[Cora|a large pancreatic head tumor]]. During the surgery, she was shocked to learn that Meredith was leaving the hospital. ''(\"[[Out for Blood]]\")''\n\nJamarah then met Jackson, who said the Foundation was committed to Grey Sloan's success and was putting additional funding into the hospital to make it better. Jamarah confronted him over Meredith leaving, saying it made her wonder what else Jackson was hiding. She then went to Bailey and asked if she knew that the hospital had been closed to trauma. She said she didn't, but she wasn't surprised. At the end of the day, Jamarah told Bailey that she'd seen often how sometimes programs suffered because people worked together for so long that they no longer respected the authority of the people in charge. She told Bailey she was shutting down the program and re-assigning the residents. She told Bailey to take the time to rebuild and start over. ''(\"[[You Are the Blood]]\")''\n\n==Career==\nShe works for the Medical Accreditation Council.\n\n==Gallery==\n===Episodic===\n<gallery type=\"slideshow\" position=\"center\" hideaddbutton=\"true\" crop=\"true\">\n18x19JamarahBlake.png|[[Out for Blood]]\n18x20JamarahBlake.png|[[You Are the Blood]]\n</gallery>\n\n===Episode Stills===\n<gallery orientation=\"landscape\" position=\"center\" spacing=\"small\" bordersize=\"none\" hideaddbutton=\"true\">\n18x15-1.jpg\n18x15-2.jpg\n18x15-3.jpg\n18x19-10.jpg\n18x19-11.jpg\n</gallery>\n\n==Appearances==\n{{Jamarah Blake Appearances}}\n\n[[de:Jamarah Blake]]\n{{DEFAULTSORT:Blake, Jamarah}}\n[[Category:Characters]]\n[[Category:GA Characters]]\n[[Category:GA S18 Characters]]"}]}}}}